
/*
-----------------------------------------------------------------
 - UConst
-----------------------------------------------------------------
*/
#define CONST_Ammo_None                                          0
#define CONST_CameraHandyCamPresetNone                           0
#define CONST_CameraShakePreset_None                             0
#define CONST_ClothingItemCategory_None                          0
#define CONST_Contact_None                                       0
#define CONST_CSA_InputMapping_None                              0
#define CONST_DisplayPoint_None                                  0
#define CONST_District_None                                      0
#define CONST_Equipment_Equipment__None                          0
#define CONST_GolemPartClass_None                                0
#define CONST_HeatActionAffect_None                              0
#define CONST_HeatActionAffect_EndMission                        1
#define CONST_HeatActionAffect_StartMissionAsOwner               2
#define CONST_HeatLevel_None                                     0
#define CONST_HUDColour_None                                     0
#define CONST_DMM_None                                           0
#define CONST_HUDIcon_None                                       0
#define CONST_HUDMarkerOffset_None                               0
#define CONST_HUDMarkerOffset_UseAutoRouteLocation               1

	MiguelEstebano = 494,
	DispatcherGK = 495,
	DispatcherBR = 496,
	KasparDanko = 497,
	FS_LAM1 = 498,
	FS_LAM2 = 499,
	MK_KOR1 = 500,
	MK_KOR2 = 501,
	MK_KOR3 = 502,
	ME_AMM = 503,
	FE_LAM1 = 504,
	FK_KOR3 = 505,
	FK_KOR2 = 506,
	FK_KOR1 = 507,
	FE_IND1 = 508,
	ME_UKS1 = 509,
	FE_CHI = 510,
	ME_UAF1 = 511,
	FE_KOR1 = 512,
	MS_SPA3 = 513,
	MS_SPA1 = 514,
	MS_LAM2 = 515,
	MS_LAM3 = 516,
	MS_LAM1 = 517,
	FM_SPA1 = 518,
	FE_AME1 = 519,
	FE_AME2 = 520,
	FE_AME3 = 521,
	FE_AFA1 = 522,
	ME_AFA1 = 523,
	FE_AUS1 = 524,
	FE_AMJ1 = 525,
	ME_AMI1 = 526,
	ME_AMJ1 = 527,
	ME_AME3 = 528,
	ME_AME2 = 529,
	ME_AME1 = 530,
	Run = 531,
	Cower = 532,
	NPCDeathNearby = 533,
	Shot = 534,
	VehicleCollisionNearby = 535,
	LookAtNPCPanicing = 536,
	EventWithNoSpecificDialogue = 537,
	LookAtGeneral = 538,
	GunfireNearby = 539,
	LookAtPlayer = 540,
	BulletImpactNearby = 541,
	VehicleApproaching = 542,
	ExplosionNearby = 543,
	LookAtDead = 544,
	LookAtSiren = 545,
	etAudioSwitchValues_MAX = 546,
};
enum etAudioLocEventTypes
{
	Play_Contact_Pledge_Break_Hot = 0,
	Cancel_LC_Mug = 1,
	Play_ThemeMusicNonlinear = 2,
	Play_LC_MugStart = 3,
	Play_Contact_GreetingKnown = 4,
	Play_Player_Angry = 5,
	Play_Contact_Dispatch = 6,
	Play_Death = 7,
	Play_Player_Smoke = 8,
	Play_LC_EjectedUpset = 9,
	Play_Player_Exertion_Med = 10,
	Play_LC_CollidedWith = 11,
	Play_Player_Exertion_High = 12,
	Play_LC_Curse = 13,
	Play_LC_Help = 14,
	Play_Contact_Mission_Accepted = 15,
	Play_Player_Exertion_Low = 16,
	Play_Player_Cry = 17,
	Play_Contact_GreetingLiked = 18,
	Stop_LC_BeingEjected = 19,
	Play_Player_Celebrate = 20,
	Play_LC_BeingEjected = 21,
	Play_LC_BeingEjected_Offside = 22,
	Play_LC_MugPunch = 23,
	Stop_ThemeMusicNonlinear = 24,
	Play_LC_Police = 25,
	Play_Player_Chuckle = 26,
	Stop_LC_MugPunch = 27,
	Play_LC_Panic_MidSequence = 28,
	Play_Player_Death_High = 29,
	Play_Contact_Dispatch_Rival = 30,
	Play_Contact_ResponseFaction = 31,
	Play_Contact_Dispatch_Bounty = 32,
	Play_LC_Death = 33,
	Play_LC_MugEnd = 34,
	Play_LC_LookAt = 35,
	Stop_LC_Panic = 36,
	Play_LC_MobilePhone = 37,
	Play_Player_Death_Low = 38,
	Play_Player_HurtLow = 39,
	Play_LC_EjectedAngryCrim = 40,
	Play_LC_Panic = 41,
	Play_Contact_GoodbyeKnown = 42,
	Play_Player_HurtMed = 43,
	Play_LC_PunchedVehicle = 44,
	Play_LC_Hurt_Med = 45,
	Play_LC_EjectedAngryEnf = 46,
	Play_Player_HurtHigh = 47,
	Play_Contact_Dispatch_Backup = 48,
	Play_LC_Ejected_Initial = 49,
	Play_LC_PainNudgedByCar = 50,
	Play_Contact_Pledge_Break_Passes = 51,
	Stop_LC_MobilePhone = 52,
	Play_LC_PainBullet = 53,
	Play_Contact_ResponseLocked = 54,
	Play_LC_Hurt_Low = 55,
	Play_Player_Shock = 56,
	Stop_LC_Ejected_Initial = 57,
	etAudioLocEventTypes_MAX = 58,
};

/*
-----------------------------------------------------------------
 - Structs
-----------------------------------------------------------------
*/
//0x000018
//GroupMember[0x1DF2E728]
struct FGroupMember
{
	int                                                m_nCharacterUID;                                  		// 0x000000 (0x0004)              
	FVector3                                           m_LocationUnreliable;                             		// 0x000004 (0x000C)              
	unsigned char                                      m_nHealthUnreliable;                              		// 0x000010 (0x0001)              PROPERTY: 
	unsigned char                                      m_eStatus;                                        		// 0x000011 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000012[0x2];                                   		// 0x000012 (0x0002) MISSED OFFSET
	unsigned long                                      m_bHoldingTaskItem : 1;                           		// 0x000014 (0x0004) [0x00000001] 
};
//0x000083
//GroupPacket[0x1DF2E6C0]
struct FGroupPacket
{
	int                                                m_nCharacterUIDs[0x14];                           		// 0x000000 (0x0050)              
	unsigned char                                      m_nHealths[0x14];                                 		// 0x000050 (0x0014)              PROPERTY: 
	unsigned char                                      m_eStatuses[0x14];                                		// 0x000064 (0x0014)              PROPERTY: 
	int                                                m_nIdentifier;                                    		// 0x000078 (0x0004)              
	int                                                m_nLeaderUID;                                     		// 0x00007C (0x0004)              
	unsigned char                                      m_eFaction;                                       		// 0x000080 (0x0001)              PROPERTY: etFaction
	unsigned char                                      m_nCollisionGroupID;                              		// 0x000081 (0x0001)              PROPERTY: 
	unsigned char                                      m_nNumMembers;                                    		// 0x000082 (0x0001)              PROPERTY: 
};
//0x000174
//UnreliableDataPacket[0x1DF2E790]
struct FUnreliableDataPacket
{
	int                                                m_nCharacterUIDs[0x14];                           		// 0x000000 (0x0050)              
	FVector3                                           m_Locations[0x14];                                		// 0x000050 (0x00F0)              
	unsigned char                                      m_nHealths[0x14];                                 		// 0x000140 (0x0014)              PROPERTY: 
	unsigned char                                      m_eStatuses[0x14];                                		// 0x000154 (0x0014)              PROPERTY: 
	int                                                m_nIdentifier;                                    		// 0x000168 (0x0004)              
	unsigned char                                      m_nNumMembers;                                    		// 0x00016C (0x0001)              PROPERTY: 
	unsigned char                                      m_nHoldingTaskItems;                              		// 0x00016D (0x0001)              PROPERTY: 
	unsigned char                                      _0x00016E[0x2];                                   		// 0x00016E (0x0002) MISSED OFFSET
	int                                                m_nChecksum;                                      		// 0x000170 (0x0004)              
};
//0x000018
//SideMember[0x1DF2E658]
struct FSideMember
{
	int                                                m_nCharacterUID;                                  		// 0x000000 (0x0004)              
	FVector3                                           m_LocationUnreliable;                             		// 0x000004 (0x000C)              
	unsigned char                                      m_nHealthUnreliable;                              		// 0x000010 (0x0001)              PROPERTY: 
	unsigned char                                      m_eStatus;                                        		// 0x000011 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000012[0x2];                                   		// 0x000012 (0x0002) MISSED OFFSET
	unsigned long                                      m_bHoldingTaskItem : 1;                           		// 0x000014 (0x0004) [0x00000001] 
};
//0x000068
//SidePacket[0x1DF2E5F0]
struct FSidePacket
{
	int                                                m_nCharacterUIDs[0x14];                           		// 0x000000 (0x0050)              
	int                                                m_nSideID;                                        		// 0x000050 (0x0004)              
	int                                                m_nOppositionID;                                  		// 0x000054 (0x0004)              
	int                                                m_nLeaderUID;                                     		// 0x000058 (0x0004)              
	int                                                m_nMissionID;                                     		// 0x00005C (0x0004)              
	unsigned char                                      m_eFaction;                                       		// 0x000060 (0x0001)              PROPERTY: etFaction
	unsigned char                                      m_nTeamNameID;                                    		// 0x000061 (0x0001)              PROPERTY: 
	unsigned char                                      m_nCollisionGroupID;                              		// 0x000062 (0x0001)              PROPERTY: 
	unsigned char                                      m_nNumMembers;                                    		// 0x000063 (0x0001)              PROPERTY: 
	unsigned long                                      m_bFFASide : 1;                                   		// 0x000064 (0x0004) [0x00000001] 
	unsigned long                                      m_bShowGroupOnly : 1;                             		// 0x000064 (0x0004) [0x00000002] 
};
//0x000005
//CharacterStatus[0x1DF2E588]
struct FCharacterStatus
{
	int                                                m_eStatusIconCombo;                               		// 0x000000 (0x0004)              
	unsigned char                                      m_eCharacterStatus;                               		// 0x000004 (0x0001)              PROPERTY: etCharacterStatus
};
//0x000005
//OpenWorldConstant[0x1DF2E520]
struct FOpenWorldConstant
{
	float                                              m_fValue;                                         		// 0x000000 (0x0004)              
	unsigned char                                      m_eOpenWorldConstant;                             		// 0x000004 (0x0001)              PROPERTY: etOpenWorldConstant
};
//0x000011
//SkillRatingConstant[0x1DF2E4B8]
struct FSkillRatingConstant
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	float                                              m_fValue;                                         		// 0x00000C (0x0004)              
	unsigned char                                      m_eSkillRatingConstant;                           		// 0x000010 (0x0001)              PROPERTY: etSkillRatingConstant
};
//0x00005A
//tResupplyOperation[0x1DF2E450]
struct FtResupplyOperation
{
	double                                             m_fResupplyStartTime;                             		// 0x000000 (0x0008)              
	double                                             m_fLastUpdateTime;                                		// 0x000008 (0x0008)              
	int                                                m_nResupplyUnitSize;                              		// 0x000010 (0x0004)              
	float                                              m_fUnitResupplySeconds;                           		// 0x000014 (0x0004)              
	class AcAPBPlayerController*                       m_pPC;                                            		// 0x000018 (0x0004)              
	class AcWeapon*                                    m_pWeapon;                                        		// 0x00001C (0x0004)              
	class UiAmmoConsumer*                              m_pAmmoConsumer;                                  		// 0x000020 (0x0004)              
	unsigned char                                      _0x000024[0x4];                                   		// 0x000024 (0x0004) ALIGNEMENT
	class UiAmmoSupplier*                              m_pAmmoSupplier;                                  		// 0x000028 (0x0004)              
	unsigned char                                      _0x00002C[0x4];                                   		// 0x00002C (0x0004) ALIGNEMENT
	class UiAmmoCarrier*                               m_pAmmoCarrier;                                   		// 0x000030 (0x0004)              
	unsigned char                                      _0x000034[0x4];                                   		// 0x000034 (0x0004) ALIGNEMENT
	float                                              m_fAmmoResupplyRadius;                            		// 0x000038 (0x0004)              
	float                                              m_fProgress;                                      		// 0x00003C (0x0004)              
	int                                                m_nStartAmmoAmount;                               		// 0x000040 (0x0004)              
	int                                                m_nTotalAmmoSupplied;                             		// 0x000044 (0x0004)              
	int                                                m_nTotalAmmoSuppliedFromStorage;                  		// 0x000048 (0x0004)              
	int                                                m_nTotalAmmoBought;                               		// 0x00004C (0x0004)              
	int                                                m_nTotalCost;                                     		// 0x000050 (0x0004)              
	float                                              m_fFractionalCost;                                		// 0x000054 (0x0004)              
	unsigned char                                      m_eResupplyState;                                 		// 0x000058 (0x0001)              PROPERTY: etResupplyState
	unsigned char                                      m_eResupplyTarget;                                		// 0x000059 (0x0001)              PROPERTY: etResupplyTarget
};
//0x000010
//tPendingResupplyInfo[0x1DF2E3E8]
struct FtPendingResupplyInfo
{
	class AcAPBPlayerController*                       m_pPC;                                            		// 0x000000 (0x0004)              
	TArray<unsigned char>                              m_aWeaponTypes;                                   		// 0x000004 (0x000C)              
};
//0x000208
//VehicleSetupType[0x1DF2E380]
struct FVehicleSetupType
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sGolemobileBase;                                		// 0x00000C (0x000C)              
	struct FString                                     m_sPhysicsAsset;                                  		// 0x000018 (0x000C)              
	struct FString                                     m_sSharedDataObject;                              		// 0x000024 (0x000C)              
	struct FString                                     m_sVehicleName;                                   		// 0x000030 (0x000C)              
	struct FString                                     m_sVehicleSetupAsset;                             		// 0x00003C (0x000C)              
	struct FString                                     m_sVFXPrefab;                                     		// 0x000048 (0x000C)              
	int                                                m_eAudioType;                                     		// 0x000054 (0x0004)              
	int                                                m_eExplosionType;                                 		// 0x000058 (0x0004)              
	int                                                m_eGameplayObject;                                		// 0x00005C (0x0004)              
	int                                                m_ePedestrianDriver;                              		// 0x000060 (0x0004)              
	int                                                m_eUIMeshViewerSetup;                             		// 0x000064 (0x0004)              
	int                                                m_eVehicleAnimationCategory;                      		// 0x000068 (0x0004)              
	int                                                m_eVehicleCategory;                               		// 0x00006C (0x0004)              
	float                                              m_f0msSteerAngle;                                 		// 0x000070 (0x0004)              
	float                                              m_f12msSteerAngle;                                		// 0x000074 (0x0004)              
	float                                              m_f22msSteerAngle;                                		// 0x000078 (0x0004)              
	float                                              m_f2500RpmTorque;                                 		// 0x00007C (0x0004)              
	float                                              m_f2ndGearSpeed;                                  		// 0x000080 (0x0004)              
	float                                              m_f3rdGearSpeed;                                  		// 0x000084 (0x0004)              
	float                                              m_f4500RpmTorque;                                 		// 0x000088 (0x0004)              
	float                                              m_f4thGearSpeed;                                  		// 0x00008C (0x0004)              
	float                                              m_f500RpmTorque;                                  		// 0x000090 (0x0004)              
	float                                              m_f5thGearSpeed;                                  		// 0x000094 (0x0004)              
	float                                              m_f7000RpmTorque;                                 		// 0x000098 (0x0004)              
	float                                              m_fBlobShadowScale[0x3];                          		// 0x00009C (0x000C)              
	float                                              m_fBlobShadowTranslate[0x3];                      		// 0x0000A8 (0x000C)              
	float                                              m_fBreakInCSADuration;                            		// 0x0000B4 (0x0004)              
	float                                              m_fCamBaseZFar;                                   		// 0x0000B8 (0x0004)              
	float                                              m_fCamBaseZNear;                                  		// 0x0000BC (0x0004)              
	float                                              m_fCargoHeightReductionFactor;                    		// 0x0000C0 (0x0004)              
	float                                              m_fCargoTorqueReductionFactor;                    		// 0x0000C4 (0x0004)              
	float                                              m_fChassisTorqueFactor;                           		// 0x0000C8 (0x0004)              
	float                                              m_fCollisionDamage;                               		// 0x0000CC (0x0004)              
	float                                              m_fCOMOffsetX;                                    		// 0x0000D0 (0x0004)              
	float                                              m_fCOMOffsetZ;                                    		// 0x0000D4 (0x0004)              
	float                                              m_fDriverCamFar;                                  		// 0x0000D8 (0x0004)              
	float                                              m_fDriverCamNear;                                 		// 0x0000DC (0x0004)              
	float                                              m_fEngineBrakingFactor;                           		// 0x0000E0 (0x0004)              
	float                                              m_fFinalDriveRatio;                               		// 0x0000E4 (0x0004)              
	float                                              m_fFrontLatFactor;                                		// 0x0000E8 (0x0004)              
	float                                              m_fFrontLongFactor;                               		// 0x0000EC (0x0004)              
	float                                              m_fFrontSuspensionSpeed;                          		// 0x0000F0 (0x0004)              
	float                                              m_fFrontSuspensionTravel;                         		// 0x0000F4 (0x0004)              
	float                                              m_fFrontWheelBoneOffset[0x3];                     		// 0x0000F8 (0x000C)              
	float                                              m_fFrontWheelMeshOffset[0x3];                     		// 0x000104 (0x000C)              
	float                                              m_fFrontWheelRadius;                              		// 0x000110 (0x0004)              
	float                                              m_fGearRatios[0x6];                               		// 0x000114 (0x0018)              
	float                                              m_fIdleRPM;                                       		// 0x00012C (0x0004)              
	float                                              m_fLSDFactor;                                     		// 0x000130 (0x0004)              
	float                                              m_fMaxBrakeTorque;                                		// 0x000134 (0x0004)              
	float                                              m_fMaxCargoHeightReduction;                       		// 0x000138 (0x0004)              
	float                                              m_fMaxCargoTorqueReduction;                       		// 0x00013C (0x0004)              
	float                                              m_fMaxDirt;                                       		// 0x000140 (0x0004)              
	float                                              m_fMaxDust;                                       		// 0x000144 (0x0004)              
	float                                              m_fMaxRepairTimeSecs;                             		// 0x000148 (0x0004)              
	float                                              m_fMaxReverseSpeed;                               		// 0x00014C (0x0004)              
	float                                              m_fMaxSpeed;                                      		// 0x000150 (0x0004)              
	float                                              m_fMinDirt;                                       		// 0x000154 (0x0004)              
	float                                              m_fMinDust;                                       		// 0x000158 (0x0004)              
	float                                              m_fPercentDirty;                                  		// 0x00015C (0x0004)              
	float                                              m_fPercentPerfectlyClean;                         		// 0x000160 (0x0004)              
	float                                              m_fRamraidDamageMultiplier;                       		// 0x000164 (0x0004)              
	float                                              m_fRearHandbrakeLat;                              		// 0x000168 (0x0004)              
	float                                              m_fRearHandbrakeLong;                             		// 0x00016C (0x0004)              
	float                                              m_fRearLatFactor;                                 		// 0x000170 (0x0004)              
	float                                              m_fRearLongFactor;                                		// 0x000174 (0x0004)              
	float                                              m_fRearSuspensionSpeed;                           		// 0x000178 (0x0004)              
	float                                              m_fRearSuspensionTravel;                          		// 0x00017C (0x0004)              
	float                                              m_fRearWheelBoneOffset[0x3];                      		// 0x000180 (0x000C)              
	float                                              m_fRearWheelMeshOffset[0x3];                      		// 0x00018C (0x000C)              
	float                                              m_fRearWheelRadius;                               		// 0x000198 (0x0004)              
	float                                              m_fRedlineRPM;                                    		// 0x00019C (0x0004)              
	float                                              m_fReverseThrottle;                               		// 0x0001A0 (0x0004)              
	float                                              m_fSteerAccel;                                    		// 0x0001A4 (0x0004)              
	float                                              m_fSteerSpeed;                                    		// 0x0001A8 (0x0004)              
	float                                              m_fSuspensionDamping;                             		// 0x0001AC (0x0004)              
	float                                              m_fSuspensionStiffness;                           		// 0x0001B0 (0x0004)              
	float                                              m_fWheelLatAsymptoteSlip;                         		// 0x0001B4 (0x0004)              
	float                                              m_fWheelLatAsymptoteValue;                        		// 0x0001B8 (0x0004)              
	float                                              m_fWheelLatExtremumSlip;                          		// 0x0001BC (0x0004)              
	float                                              m_fWheelLatExtremumValue;                         		// 0x0001C0 (0x0004)              
	float                                              m_fWheelLongAsymptoteSlip;                        		// 0x0001C4 (0x0004)              
	float                                              m_fWheelLongAsymptoteValue;                       		// 0x0001C8 (0x0004)              
	float                                              m_fWheelLongExtremumSlip;                         		// 0x0001CC (0x0004)              
	float                                              m_fWheelLongExtremumValue;                        		// 0x0001D0 (0x0004)              
	int                                                m_nCabinCargoPipCapacity;                         		// 0x0001D4 (0x0004)              
	int                                                m_nCameraPitchMax;                                		// 0x0001D8 (0x0004)              
	int                                                m_nCameraPitchMin;                                		// 0x0001DC (0x0004)              
	int                                                m_nCargoAreaSeatPositions;                        		// 0x0001E0 (0x0004)              
	int                                                m_nInitialCamPitch;                               		// 0x0001E4 (0x0004)              
	int                                                m_nMainCargoPipCapacity;                          		// 0x0001E8 (0x0004)              
	int                                                m_nMaxHealth;                                     		// 0x0001EC (0x0004)              
	int                                                m_nMaxRepairCost;                                 		// 0x0001F0 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x0001F4 (0x0004)              
	int                                                m_nSpawnCost;                                     		// 0x0001F8 (0x0004)              
	unsigned char                                      m_eDriveType;                                     		// 0x0001FC (0x0001)              PROPERTY: etVehicleDriveType
	unsigned char                                      m_eTempAssets;                                    		// 0x0001FD (0x0001)              PROPERTY: etVehicleTempSetup
	unsigned char                                      m_eUICategory;                                    		// 0x0001FE (0x0001)              PROPERTY: etVehicleUICategory
	unsigned char                                      m_eVehicleModelClass;                             		// 0x0001FF (0x0001)              PROPERTY: etVehicleModelClass
	unsigned char                                      m_eVehicleSetupType;                              		// 0x000200 (0x0001)              PROPERTY: etVehicleSetupType
	unsigned char                                      _0x000201[0x3];                                   		// 0x000201 (0x0003) MISSED OFFSET
	unsigned long                                      m_bHasAlarm : 1;                                  		// 0x000204 (0x0004) [0x00000001] 
	unsigned long                                      m_bHasRearSeats : 1;                              		// 0x000204 (0x0004) [0x00000002] 
	unsigned long                                      m_bHasTailLights : 1;                             		// 0x000204 (0x0004) [0x00000004] 
	unsigned long                                      m_bIsPlayerOnlyVehicle : 1;                       		// 0x000204 (0x0004) [0x00000008] 
};
//0x000019
//VehiclePositionInfo[0x1DF2E318]
struct FVehiclePositionInfo
{
	int                                                m_eVehicleAnimationCategory;                      		// 0x000000 (0x0004)              
	int                                                m_eVehicleDoorAnimationSet;                       		// 0x000004 (0x0004)              
	int                                                m_eVehicleNPCInsideAnimationSet;                  		// 0x000008 (0x0004)              
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x00000C (0x0004)              
	int                                                m_nVCPAngle;                                      		// 0x000010 (0x0004)              
	int                                                m_nVCPDirection;                                  		// 0x000014 (0x0004)              
	unsigned char                                      m_eVehiclePositionIndex;                          		// 0x000018 (0x0001)              PROPERTY: etVehiclePositionIndex
};
//0x00002C
//VehiclePlayerAnimationSet[0x1DF2E2B0]
struct FVehiclePlayerAnimationSet
{
	struct FString                                     m_sDriveSteer;                                    		// 0x000000 (0x000C)              
	struct FString                                     m_sPassengerIdle;                                 		// 0x00000C (0x000C)              
	int                                                m_eAnimTreeDecision;                              		// 0x000018 (0x0004)              
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x00001C (0x0004)              
	float                                              m_fLeanInDuration;                                		// 0x000020 (0x0004)              
	float                                              m_fLeanOutDuration;                               		// 0x000024 (0x0004)              
	unsigned long                                      m_bMirrorAnimations : 1;                          		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      m_bReverseAim : 1;                                		// 0x000028 (0x0004) [0x00000002] 
};
//0x000074
//VehicleNPCInsideAnimationSet[0x1DF2E248]
struct FVehicleNPCInsideAnimationSet
{
	struct FString                                     m_sEjectInitialCriminal;                          		// 0x000000 (0x000C)              
	struct FString                                     m_sEjectInitialEnforcer;                          		// 0x00000C (0x000C)              
	struct FString                                     m_sEjectInitialFromPassengerSideCriminal;         		// 0x000018 (0x000C)              
	struct FString                                     m_sEjectInitialFromPassengerSideEnforcer;         		// 0x000024 (0x000C)              
	struct FString                                     m_sEjectLaterCriminal;                            		// 0x000030 (0x000C)              
	struct FString                                     m_sEjectLaterEnforcer;                            		// 0x00003C (0x000C)              
	struct FString                                     m_sEjectLaterFromPassengerSideCriminal;           		// 0x000048 (0x000C)              
	struct FString                                     m_sEjectLaterFromPassengerSideEnforcer;           		// 0x000054 (0x000C)              
	int                                                m_eVehicleNPCInsideAnimationSet;                  		// 0x000060 (0x0004)              
	float                                              m_fEjectDistanceDriverSideCriminal;               		// 0x000064 (0x0004)              
	float                                              m_fEjectDistanceDriverSideEnforcer;               		// 0x000068 (0x0004)              
	float                                              m_fEjectDistancePassengerSideCriminal;            		// 0x00006C (0x0004)              
	float                                              m_fEjectDistancePassengerSideEnforcer;            		// 0x000070 (0x0004)              
};
//0x000080
//VehicleDoorAnimationSet[0x1DF2E1E0]
struct FVehicleDoorAnimationSet
{
	struct FString                                     m_sClosedFrame;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sCloseFromInside;                               		// 0x00000C (0x000C)              
	struct FString                                     m_sCloseFromOutside;                              		// 0x000018 (0x000C)              
	struct FString                                     m_sCloseGetIn;                                    		// 0x000024 (0x000C)              
	struct FString                                     m_sOpenBailOut;                                   		// 0x000030 (0x000C)              
	struct FString                                     m_sOpenFrame;                                     		// 0x00003C (0x000C)              
	struct FString                                     m_sOpenFromOutside;                               		// 0x000048 (0x000C)              
	struct FString                                     m_sOpenGetOut;                                    		// 0x000054 (0x000C)              
	struct FString                                     m_sOpenSeatSlideEjectCriminal;                    		// 0x000060 (0x000C)              
	struct FString                                     m_sOpenSeatSlideEjectEnforcer;                    		// 0x00006C (0x000C)              
	int                                                m_eVehicleDoorAnimationSet;                       		// 0x000078 (0x0004)              
	unsigned long                                      m_bDoorOpenWhileInside : 1;                       		// 0x00007C (0x0004) [0x00000001] 
};
//0x000010
//VehicleInteractionAnimation[0x1DF2E178]
struct FVehicleInteractionAnimation
{
	float                                              m_fBlendInTime;                                   		// 0x000000 (0x0004)              
	float                                              m_fBlendOutTime;                                  		// 0x000004 (0x0004)              
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x000008 (0x0001)              PROPERTY: etVehicleInteractionAnimation
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	unsigned long                                      m_bMirror : 1;                                    		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      m_bPauseAtEnd : 1;                                		// 0x00000C (0x0004) [0x00000002] 
	unsigned long                                      m_bScaleRoot : 1;                                 		// 0x00000C (0x0004) [0x00000004] 
	unsigned long                                      m_bStartAtOrigin : 1;                             		// 0x00000C (0x0004) [0x00000008] 
};
//0x000011
//VehicleInteractionSequence[0x1DF2E110]
struct FVehicleInteractionSequence
{
	struct FString                                     m_sSequenceName;                                  		// 0x000000 (0x000C)              
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x00000C (0x0004)              
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x000010 (0x0001)              PROPERTY: etVehicleInteractionAnimation
};
//0x00000C
//VehicleCritical[0x1DF2E0A8]
struct FVehicleCritical
{
	int                                                m_eHUDMessage;                                    		// 0x000000 (0x0004)              
	int                                                m_eVehicleCritical;                               		// 0x000004 (0x0004)              
	float                                              m_fWeight;                                        		// 0x000008 (0x0004)              
};
//0x00002C
//GolemPart[0x1DF2E040]
struct FGolemPart
{
	struct FString                                     m_sGolemPart;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sUsername;                                      		// 0x00000C (0x000C)              
	int                                                m_eClass;                                         		// 0x000018 (0x0004)              
	int                                                m_eClothingItemCategory;                          		// 0x00001C (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000020 (0x0004)              
	int                                                m_nVersatility;                                   		// 0x000024 (0x0004)              
	unsigned long                                      m_bStartup : 1;                                   		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      m_bTestAsset : 1;                                 		// 0x000028 (0x0004) [0x00000002] 
};
//0x00000C
//GolemPartClass[0x1DF2DFD8]
struct FGolemPartClass
{
	int                                                m_eGolemPartClass;                                		// 0x000000 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000004 (0x0004)              
	unsigned long                                      m_bCoversBreasts : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bCoversGenitalia : 1;                           		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      m_bUseInClothingPreview : 1;                      		// 0x000008 (0x0004) [0x00000004] 
};
//0x00000D
//VehicleGear[0x1DF2DF70]
struct FVehicleGear
{
	struct FString                                     m_sPackageImageRef;                               		// 0x000000 (0x000C)              
	unsigned char                                      m_eVehicleGear;                                   		// 0x00000C (0x0001)              PROPERTY: etVehicleGear
};
//0x000094
//VehicleAudioPartDefaults[0x1DF2DF08]
struct FVehicleAudioPartDefaults
{
	struct FString                                     m_sDamageType;                                    		// 0x000000 (0x000C)              
	struct FString                                     m_sDoorEventCloseFront;                           		// 0x00000C (0x000C)              
	struct FString                                     m_sDoorEventCloseRearBack;                        		// 0x000018 (0x000C)              
	struct FString                                     m_sDoorEventCloseRearSide;                        		// 0x000024 (0x000C)              
	struct FString                                     m_sDoorEventOpenFront;                            		// 0x000030 (0x000C)              
	struct FString                                     m_sDoorEventOpenRearBack;                         		// 0x00003C (0x000C)              
	struct FString                                     m_sDoorEventOpenRearSide;                         		// 0x000048 (0x000C)              
	struct FString                                     m_sLC_VehicleType;                                		// 0x000054 (0x000C)              
	struct FString                                     m_sSuspensionType;                                		// 0x000060 (0x000C)              
	int                                                m_eDefaultAmp;                                    		// 0x00006C (0x0004)              
	int                                                m_eDefaultEngine;                                 		// 0x000070 (0x0004)              
	int                                                m_eDefaultExhaust;                                		// 0x000074 (0x0004)              
	int                                                m_eDefaultHorn;                                   		// 0x000078 (0x0004)              
	int                                                m_eDefaultSiren;                                  		// 0x00007C (0x0004)              
	int                                                m_eDefaultSpeaker;                                		// 0x000080 (0x0004)              
	int                                                m_eVehicleAudioPartDefaults;                      		// 0x000084 (0x0004)              
	float                                              m_fMaxEnclosedness;                               		// 0x000088 (0x0004)              
	float                                              m_fWheelForceEventThreshold;                      		// 0x00008C (0x0004)              
	float                                              m_fWheelForceMax;                                 		// 0x000090 (0x0004)              
};
//0x00000D
//VehicleUICategory[0x1DF2DEA0]
struct FVehicleUICategory
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	unsigned char                                      m_eVehicleUICategory;                             		// 0x00000C (0x0001)              PROPERTY: etVehicleUICategory
};
//0x00000D
//VehicleTempSetup[0x1DF2DE38]
struct FVehicleTempSetup
{
	struct FString                                     m_sTempSetupInfo;                                 		// 0x000000 (0x000C)              
	unsigned char                                      m_eVehicleTempSetup;                              		// 0x00000C (0x0001)              PROPERTY: etVehicleTempSetup
};
//0x000010
//VehicleDamageLevel[0x1DF2DDD0]
struct FVehicleDamageLevel
{
	int                                                m_eHandlingEffect;                                		// 0x000000 (0x0004)              
	int                                                m_eVehicleCritical;                               		// 0x000004 (0x0004)              
	int                                                m_eVehicleDamageLevel;                            		// 0x000008 (0x0004)              
	float                                              m_fHealthThreshold;                               		// 0x00000C (0x0004)              
};
//0x00001C
//ContextSensitiveActionBase[0x1DF2DD68]
struct FContextSensitiveActionBase
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	int                                                m_eBeginCSATutorialTrigger;                       		// 0x00000C (0x0004)              
	int                                                m_eEndCSATutorialTrigger;                         		// 0x000010 (0x0004)              
	unsigned char                                      m_eAnimType;                                      		// 0x000014 (0x0001)              PROPERTY: etCSAAnimType
	unsigned char                                      m_eContextSensitiveActionBase;                    		// 0x000015 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      m_eInputType;                                     		// 0x000016 (0x0001)              PROPERTY: etCSAInputType
	unsigned char                                      m_eOpposingCSA;                                   		// 0x000017 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned long                                      m_bCanAbandon : 1;                                		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      m_bCancelsCrouch : 1;                             		// 0x000018 (0x0004) [0x00000002] 
	unsigned long                                      m_bCanResume : 1;                                 		// 0x000018 (0x0004) [0x00000004] 
	unsigned long                                      m_bConsiderActive : 1;                            		// 0x000018 (0x0004) [0x00000008] 
	unsigned long                                      m_bIndefiniteDuration : 1;                        		// 0x000018 (0x0004) [0x00000010] 
	unsigned long                                      m_bInterruptInventory : 1;                        		// 0x000018 (0x0004) [0x00000020] 
	unsigned long                                      m_bInvoked : 1;                                   		// 0x000018 (0x0004) [0x00000040] 
	unsigned long                                      m_bMissionCSA : 1;                                		// 0x000018 (0x0004) [0x00000080] 
	unsigned long                                      m_bNoHideWeapon : 1;                              		// 0x000018 (0x0004) [0x00000100] 
	unsigned long                                      m_bProgressBar : 1;                               		// 0x000018 (0x0004) [0x00000200] 
	unsigned long                                      m_bSmallTargetVolume : 1;                         		// 0x000018 (0x0004) [0x00000400] 
	unsigned long                                      m_bTimedDuration : 1;                             		// 0x000018 (0x0004) [0x00000800] 
	unsigned long                                      m_bVolumeCSA : 1;                                 		// 0x000018 (0x0004) [0x00001000] 
};
//0x000034
//ContextSensitiveAction[0x1DF2DD00]
struct FContextSensitiveAction
{
	int                                                m_eDefaultAutoRouteData;                          		// 0x000000 (0x0004)              
	float                                              m_fAimDot;                                        		// 0x000004 (0x0004)              
	float                                              m_fCameraDirectionAimDotWeightingScalar;          		// 0x000008 (0x0004)              
	float                                              m_fDistanceWeightingScalar;                       		// 0x00000C (0x0004)              
	float                                              m_fHorizontalServerDistanceErrorMargin;           		// 0x000010 (0x0004)              
	float                                              m_fHUDHintDistance;                               		// 0x000014 (0x0004)              
	float                                              m_fInteractionDistance;                           		// 0x000018 (0x0004)              
	float                                              m_fPawnDirectionAimDotWeightingScalar;            		// 0x00001C (0x0004)              
	float                                              m_fVerticalInteractionDistance;                   		// 0x000020 (0x0004)              
	float                                              m_fVerticalServerDistanceErrorMargin;             		// 0x000024 (0x0004)              
	int                                                m_nPriorityLayer;                                 		// 0x000028 (0x0004)              
	unsigned char                                      m_eContextSensitiveAction;                        		// 0x00002C (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      m_eDefaultAlignmentType;                          		// 0x00002D (0x0001)              PROPERTY: etCSAAlignmentType
	unsigned char                                      m_eLineCheckType;                                 		// 0x00002E (0x0001)              PROPERTY: etCSALineCheckType
	unsigned char                                      _0x00002F[0x1];                                   		// 0x00002F (0x0001) MISSED OFFSET
	unsigned long                                      m_bAimCheck : 1;                                  		// 0x000030 (0x0004) [0x00000001] 
	unsigned long                                      m_bAllowWhileFalling : 1;                         		// 0x000030 (0x0004) [0x00000002] 
	unsigned long                                      m_bChecksUseAutoRouteData : 1;                    		// 0x000030 (0x0004) [0x00000004] 
	unsigned long                                      m_bDefaultLineCheck : 1;                          		// 0x000030 (0x0004) [0x00000008] 
	unsigned long                                      m_bDistanceCheck : 1;                             		// 0x000030 (0x0004) [0x00000010] 
	unsigned long                                      m_bIsAnimationDrivenAction : 1;                   		// 0x000030 (0x0004) [0x00000020] 
	unsigned long                                      m_bIsTargetedCSA : 1;                             		// 0x000030 (0x0004) [0x00000040] 
	unsigned long                                      m_bLargeTaskItem : 1;                             		// 0x000030 (0x0004) [0x00000080] 
	unsigned long                                      m_bMediumTaskItem : 1;                            		// 0x000030 (0x0004) [0x00000100] 
	unsigned long                                      m_bSingleInteractionPoint : 1;                    		// 0x000030 (0x0004) [0x00000200] 
	unsigned long                                      m_bSingleProgressBar : 1;                         		// 0x000030 (0x0004) [0x00000400] 
	unsigned long                                      m_bSmallTaskItem : 1;                             		// 0x000030 (0x0004) [0x00000800] 
	unsigned long                                      m_bSprintPriority : 1;                            		// 0x000030 (0x0004) [0x00001000] 
};
//0x000005
//InvokedContextSensitiveAction[0x1DF2DC98]
struct FInvokedContextSensitiveAction
{
	float                                              m_fDuration;                                      		// 0x000000 (0x0004)              
	unsigned char                                      m_eContextSensitiveAction;                        		// 0x000004 (0x0001)              PROPERTY: etContextSensitiveActionBase
};
//0x000016
//CSA_ItemAssociation[0x1DF2DC30]
struct FCSA_ItemAssociation
{
	int                                                m_eCSA_ItemAssociation;                           		// 0x000000 (0x0004)              
	int                                                m_eDefaultEquipmentAnimationType;                 		// 0x000004 (0x0004)              
	int                                                m_eEquipmentType;                                 		// 0x000008 (0x0004)              
	int                                                m_eItemAssociationCategory;                       		// 0x00000C (0x0004)              
	float                                              m_fEffectivenessModifier;                         		// 0x000010 (0x0004)              
	unsigned char                                      m_eContextSensitiveAction;                        		// 0x000014 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      m_eFaction;                                       		// 0x000015 (0x0001)              PROPERTY: etFaction
};
//0x000010
//CSA_ItemAssociationCategory[0x1DF2DBC8]
struct FCSA_ItemAssociationCategory
{
	struct FString                                     m_sEffect;                                        		// 0x000000 (0x000C)              
	int                                                m_eCSA_ItemAssociationCategory;                   		// 0x00000C (0x0004)              
};
//0x00000A
//CSA_IATState[0x1DF2DB60]
struct FCSA_IATState
{
	int                                                m_nMaxConcurrentUsersPerActor;                    		// 0x000000 (0x0004)              
	int                                                m_nMaxConcurrentUsersPerIP;                       		// 0x000004 (0x0004)              
	unsigned char                                      m_eCSA_IATState;                                  		// 0x000008 (0x0001)              PROPERTY: etCSA_IATState
	unsigned char                                      m_eInteractiveActorType;                          		// 0x000009 (0x0001)              PROPERTY: etInteractiveActorType
};
//0x000018
//CSA_IATStateAssociation[0x1DF2DAF8]
struct FCSA_IATStateAssociation
{
	int                                                m_eCSA_IATStateAssociation;                       		// 0x000000 (0x0004)              
	int                                                m_eInputMapping;                                  		// 0x000004 (0x0004)              
	float                                              m_fDuration;                                      		// 0x000008 (0x0004)              
	int                                                m_nPriorityLayer;                                 		// 0x00000C (0x0004)              
	unsigned char                                      m_eContextSensitiveAction;                        		// 0x000010 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      m_eCSA_IATState;                                  		// 0x000011 (0x0001)              PROPERTY: etCSA_IATState
	unsigned char                                      _0x000012[0x2];                                   		// 0x000012 (0x0002) MISSED OFFSET
	unsigned long                                      m_bOverridePriority : 1;                          		// 0x000014 (0x0004) [0x00000001] 
};
//0x000006
//InteractiveActorType[0x1DF2DA90]
struct FInteractiveActorType
{
	float                                              m_Dummy;                                          		// 0x000000 (0x0004)              
	unsigned char                                      m_eInteractiveActorCategory;                      		// 0x000004 (0x0001)              PROPERTY: etInteractiveActorCategory
	unsigned char                                      m_eInteractiveActorType;                          		// 0x000005 (0x0001)              PROPERTY: etInteractiveActorType
};
//0x000058
//CSA_EquipmentAnimationType[0x1DF2DA28]
struct FCSA_EquipmentAnimationType
{
	struct FString                                     m_sIntroAnim;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sMainAnim1;                                     		// 0x00000C (0x000C)              
	struct FString                                     m_sMainAnim2;                                     		// 0x000018 (0x000C)              
	struct FString                                     m_sMainAnim3;                                     		// 0x000024 (0x000C)              
	struct FString                                     m_sOutroAnim;                                     		// 0x000030 (0x000C)              
	struct FString                                     m_sVFXClass;                                      		// 0x00003C (0x000C)              
	int                                                m_eCSA_EquipmentAnimationType;                    		// 0x000048 (0x0004)              
	float                                              m_fOutroDuration;                                 		// 0x00004C (0x0004)              
	unsigned char                                      m_eOutroEndPoint;                                 		// 0x000050 (0x0001)              PROPERTY: etCSAEndPoint
	unsigned char                                      _0x000051[0x3];                                   		// 0x000051 (0x0003) MISSED OFFSET
	unsigned long                                      m_bCanMirror : 1;                                 		// 0x000054 (0x0004) [0x00000001] 
	unsigned long                                      m_bUseRootMotion : 1;                             		// 0x000054 (0x0004) [0x00000002] 
};
//0x00000C
//CSA_EATVehicleAssociation[0x1DF2D9C0]
struct FCSA_EATVehicleAssociation
{
	int                                                m_eEquipmentAnimation;                            		// 0x000000 (0x0004)              
	int                                                m_eItemAssociation;                               		// 0x000004 (0x0004)              
	int                                                m_eVehicleAnimationType;                          		// 0x000008 (0x0004)              
};
//0x000018
//CSA_EATPropAssociation[0x1DF2D958]
struct FCSA_EATPropAssociation
{
	int                                                m_eAutoRouteData;                                 		// 0x000000 (0x0004)              
	int                                                m_eCSA_EATPropAssociation;                        		// 0x000004 (0x0004)              
	int                                                m_eEquipmentAnimation;                            		// 0x000008 (0x0004)              
	int                                                m_eItemAssociation;                               		// 0x00000C (0x0004)              
	int                                                m_ePropCategory;                                  		// 0x000010 (0x0004)              
	unsigned long                                      m_bChecksUseAutoRouteLocation : 1;                		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bUseSmallCollisionVolume : 1;                   		// 0x000014 (0x0004) [0x00000002] 
};
//0x000018
//CSA_TaskItemAnimationSet[0x1DF2D8F0]
struct FCSA_TaskItemAnimationSet
{
	struct FString                                     m_sAnimName;                                      		// 0x000000 (0x000C)              
	int                                                m_eCSA_TaskItemAnimationSet;                      		// 0x00000C (0x0004)              
	unsigned char                                      m_eCSA;                                           		// 0x000010 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      m_eTaskItemSize;                                  		// 0x000011 (0x0001)              PROPERTY: etTaskItemSize
	unsigned char                                      _0x000012[0x2];                                   		// 0x000012 (0x0002) MISSED OFFSET
	unsigned long                                      m_bLogical : 1;                                   		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bUseAnimDuration : 1;                           		// 0x000014 (0x0004) [0x00000002] 
};
//0x000050
//CSA_AutoRouteData[0x1DF2D888]
struct FCSA_AutoRouteData
{
	struct FString                                     m_sSocketName[0x5];                               		// 0x000000 (0x003C)              
	int                                                m_eCSA_AutoRouteData;                             		// 0x00003C (0x0004)              
	float                                              m_fOffsetForward;                                 		// 0x000040 (0x0004)              
	float                                              m_fOffsetRight;                                   		// 0x000044 (0x0004)              
	unsigned char                                      m_eAlignmentType;                                 		// 0x000048 (0x0001)              PROPERTY: etCSAAlignmentType
	unsigned char                                      m_eAutoRouteType;                                 		// 0x000049 (0x0001)              PROPERTY: etCSAAutoRouteType
	unsigned char                                      _0x00004A[0x2];                                   		// 0x00004A (0x0002) MISSED OFFSET
	unsigned long                                      m_bRouteAlongNormal : 1;                          		// 0x00004C (0x0004) [0x00000001] 
};
//0x000010
//CSA_InputMapping[0x1DF2D820]
struct FCSA_InputMapping
{
	struct FString                                     m_sKeyBinding;                                    		// 0x000000 (0x000C)              
	int                                                m_eCSA_InputMapping;                              		// 0x00000C (0x0004)              
};
//0x000014
//OnFootDeathAnimation[0x1DF2D7B8]
struct FOnFootDeathAnimation
{
	struct FString                                     m_sAnimName;                                      		// 0x000000 (0x000C)              
	unsigned char                                      m_eOnFootDeathAnimation;                          		// 0x00000C (0x0001)              PROPERTY: etOnFootDeathAnimation
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	unsigned long                                      m_bRetainMomentum : 1;                            		// 0x000010 (0x0004) [0x00000001] 
};
//0x00000C
//tCarAnimation[0x1DF2D750]
struct FtCarAnimation
{
	class AcAPBVehicleBase*                            m_Vehicle;                                        		// 0x000000 (0x0004)              
	unsigned char                                      m_eVehicleSeat;                                   		// 0x000004 (0x0001)              PROPERTY: etVehiclePositionIndex
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x000005 (0x0001)              PROPERTY: etVehicleInteractionAnimation
	unsigned char                                      _0x000006[0x2];                                   		// 0x000006 (0x0002) MISSED OFFSET
	unsigned long                                      m_bMirror : 1;                                    		// 0x000008 (0x0004) [0x00000001] 
};
//0x00001D
//AnimationRequest[0x1DF2D6E8]
struct FAnimationRequest
{
	class UcAnimationDescriptor*                       m_Animation;                                      		// 0x000000 (0x0004)              
	class AcAnimationDrivenTrigger*                    m_Trigger;                                        		// 0x000004 (0x0004)              
	float                                              m_StartLocationX;                                 		// 0x000008 (0x0004)              
	float                                              m_StartLocationY;                                 		// 0x00000C (0x0004)              
	float                                              m_StartLocationZ;                                 		// 0x000010 (0x0004)              
	unsigned char                                      m_ePhysicsOverride;                               		// 0x000014 (0x0001)              PROPERTY: EPhysics
	unsigned char                                      _0x000015[0x3];                                   		// 0x000015 (0x0003) MISSED OFFSET
	int                                                m_NetworkTag;                                     		// 0x000018 (0x0004)              
	unsigned char                                      m_Action;                                         		// 0x00001C (0x0001)              PROPERTY: 
};
//0x000005
//ErrorCode[0x1DF2D680]
struct FErrorCode
{
	int                                                m_nDummy;                                         		// 0x000000 (0x0004)              
	unsigned char                                      m_eErrorCode;                                     		// 0x000004 (0x0001)              PROPERTY: etErrorCode
};
//0x000050
//InventoryItemType[0x1DF2D618]
struct FInventoryItemType
{
	struct FString                                     m_sCreatorName;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	int                                                m_eHUDImage;                                      		// 0x000018 (0x0004)              
	int                                                m_eInfraCategory;                                 		// 0x00001C (0x0004)              
	int                                                m_eInventoryItemType;                             		// 0x000020 (0x0004)              
	int                                                m_eLease;                                         		// 0x000024 (0x0004)              
	int                                                m_eUnlock;                                        		// 0x000028 (0x0004)              
	int                                                m_nArmasCategoryID;                               		// 0x00002C (0x0004)              
	int                                                m_nArmasProductID;                                		// 0x000030 (0x0004)              
	int                                                m_nArmasSubcategoryID;                            		// 0x000034 (0x0004)              
	int                                                m_nCostAPBCash;                                   		// 0x000038 (0x0004)              
	int                                                m_nCostRewardTokens;                              		// 0x00003C (0x0004)              
	int                                                m_nMinRating;                                     		// 0x000040 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000044 (0x0004)              
	unsigned char                                      m_eOrganisation;                                  		// 0x000048 (0x0001)              PROPERTY: etOrganisation
	unsigned char                                      m_eTrade;                                         		// 0x000049 (0x0001)              PROPERTY: 
	unsigned char                                      _0x00004A[0x2];                                   		// 0x00004A (0x0002) MISSED OFFSET
	unsigned long                                      m_bCanSellback : 1;                               		// 0x00004C (0x0004) [0x00000001] 
	unsigned long                                      m_bCriminal : 1;                                  		// 0x00004C (0x0004) [0x00000002] 
	unsigned long                                      m_bEnforcer : 1;                                  		// 0x00004C (0x0004) [0x00000004] 
	unsigned long                                      m_bGifted : 1;                                    		// 0x00004C (0x0004) [0x00000008] 
	unsigned long                                      m_bIgnoreSddValidation : 1;                       		// 0x00004C (0x0004) [0x00000010] 
	unsigned long                                      m_bIsArmas : 1;                                   		// 0x00004C (0x0004) [0x00000020] 
	unsigned long                                      m_bIsTestItem : 1;                                		// 0x00004C (0x0004) [0x00000040] 
	unsigned long                                      m_bNoDelete : 1;                                  		// 0x00004C (0x0004) [0x00000080] 
	unsigned long                                      m_bRussianOnly : 1;                               		// 0x00004C (0x0004) [0x00000100] 
};
//0x000015
//CapacityItemType[0x1DF2D5B0]
struct FCapacityItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
	int                                                m_nAmount;                                        		// 0x000010 (0x0004)              
	unsigned char                                      m_eInventoryItemCategory;                         		// 0x000014 (0x0001)              PROPERTY: etInventoryItemCategory
};
//0x000028
//ClothingItemType[0x1DF2D548]
struct FClothingItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sResource;                                      		// 0x00000C (0x000C)              
	int                                                m_eGolemPart;                                     		// 0x000018 (0x0004)              
	int                                                m_eInventoryItemType;                             		// 0x00001C (0x0004)              
	int                                                m_nReeditFee;                                     		// 0x000020 (0x0004)              
	unsigned long                                      m_bFemale : 1;                                    		// 0x000024 (0x0004) [0x00000001] 
	unsigned long                                      m_bMale : 1;                                      		// 0x000024 (0x0004) [0x00000002] 
};
//0x000004
//DefaultOutfitItem[0x1DF2D4E0]
struct FDefaultOutfitItem
{
	int                                                m_eClothingItemType;                              		// 0x000000 (0x0004)              
};
//0x000004
//EmoteItemType[0x1DF2D478]
struct FEmoteItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
};
//0x000020
//EquipmentType[0x1DF2D410]
struct FEquipmentType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eEquipmentCategory;                             		// 0x00000C (0x0004)              
	int                                                m_eInventoryItemType;                             		// 0x000010 (0x0004)              
	int                                                m_eItemAttachment;                                		// 0x000014 (0x0004)              
	int                                                m_fDurationOfUse;                                 		// 0x000018 (0x0004)              
	int                                                m_nGradeOrdinal;                                  		// 0x00001C (0x0004)              
};
//0x000008
//BombEquipmentType[0x1DF2D3A8]
struct FBombEquipmentType
{
	int                                                m_eBombLevel;                                     		// 0x000000 (0x0004)              
	int                                                m_eInventoryItemType;                             		// 0x000004 (0x0004)              
};
//0x000010
//EquipmentCategory[0x1DF2D340]
struct FEquipmentCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eEquipmentCategory;                             		// 0x00000C (0x0004)              
};
//0x000020
//ModifierItemType[0x1DF2D2D8]
struct FModifierItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
	int                                                m_eModifierItem;                                  		// 0x000010 (0x0004)              
	int                                                m_nApplicationCost;                               		// 0x000014 (0x0004)              
	int                                                m_nRemovalCost;                                   		// 0x000018 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x00001C (0x0004)              
};
//0x000004
//CharacterModifierItemType[0x1DF2D270]
struct FCharacterModifierItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
};
//0x000004
//VehicleModifierItemType[0x1DF2D208]
struct FVehicleModifierItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
};
//0x000004
//WeaponModifierItemType[0x1DF2D1A0]
struct FWeaponModifierItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
};
//0x000048
//ModifierItem[0x1DF2D138]
struct FModifierItem
{
	struct FString                                     m_sTriggerSFX;                                    		// 0x000000 (0x000C)              
	struct FString                                     m_sTriggerVFX;                                    		// 0x00000C (0x000C)              
	int                                                m_eModifierCategory;                              		// 0x000018 (0x0004)              
	int                                                m_eModifierItem;                                  		// 0x00001C (0x0004)              
	int                                                m_eRulesetExclusion;                              		// 0x000020 (0x0004)              
	float                                              m_fCooldownTimeAtPremiumLevel[0x2];               		// 0x000024 (0x0008)              
	float                                              m_fDurationAtPremiumLevel[0x2];                   		// 0x00002C (0x0008)              
	float                                              m_fIntervalTimeAtPremiumLevel[0x2];               		// 0x000034 (0x0008)              
	int                                                m_nModifierLevel;                                 		// 0x00003C (0x0004)              
	unsigned char                                      m_eGiftBoxTheme;                                  		// 0x000040 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000041[0x3];                                   		// 0x000041 (0x0003) MISSED OFFSET
	unsigned long                                      m_bActivationEndsImmunity : 1;                    		// 0x000044 (0x0004) [0x00000001] 
	unsigned long                                      m_bBroadcastSFX : 1;                              		// 0x000044 (0x0004) [0x00000002] 
	unsigned long                                      m_bUnCancelable : 1;                              		// 0x000044 (0x0004) [0x00000004] 
};
//0x000010
//ModifierCategory[0x1DF2D0D0]
struct FModifierCategory
{
	int                                                m_eModifierCategory;                              		// 0x000000 (0x0004)              
	int                                                m_nSelectableSlot;                                		// 0x000004 (0x0004)              
	unsigned char                                      m_eModifierClass;                                 		// 0x000008 (0x0001)              PROPERTY: etModifierClass
	unsigned char                                      m_eModifierType;                                  		// 0x000009 (0x0001)              PROPERTY: etModifierType
	unsigned char                                      m_eStackingSlot;                                  		// 0x00000A (0x0001)              PROPERTY: etModifierStackingSlot
	unsigned char                                      _0x00000B[0x1];                                   		// 0x00000B (0x0001) MISSED OFFSET
	unsigned long                                      m_bAvailableAsPassenger : 1;                      		// 0x00000C (0x0004) [0x00000001] 
};
//0x000019
//ModifierEffect[0x1DF2D068]
struct FModifierEffect
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eModifierItem;                                  		// 0x00000C (0x0004)              
	float                                              m_fAddToResult;                                   		// 0x000010 (0x0004)              
	float                                              m_fEffectMultiplier;                              		// 0x000014 (0x0004)              
	unsigned char                                      m_eEffectType;                                    		// 0x000018 (0x0001)              PROPERTY: etModifierEffectType
};
//0x000015
//ModifierItemEffect[0x1DF2D000]
struct FModifierItemEffect
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eItem;                                          		// 0x00000C (0x0004)              
	int                                                m_eModifierItem;                                  		// 0x000010 (0x0004)              
	unsigned char                                      m_eEffect;                                        		// 0x000014 (0x0001)              PROPERTY: etModifierItemEffectType
};
//0x000018
//ModifierDeployableEffect[0x1DF2CF98]
struct FModifierDeployableEffect
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eModifierItem;                                  		// 0x00000C (0x0004)              
	int                                                m_eTaskItem;                                      		// 0x000010 (0x0004)              
	unsigned long                                      m_bDeployAtModifierEnd : 1;                       		// 0x000014 (0x0004) [0x00000001] 
};
//0x000010
//GrafittiItemType[0x1DF2CF30]
struct FGrafittiItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
	struct FString                                     m_sResource;                                      		// 0x000004 (0x000C)              
};
//0x000010
//InstrumentItemType[0x1DF2CEC8]
struct FInstrumentItemType
{
	struct FString                                     m_sResource;                                      		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
};
//0x000010
//OutfitItemType[0x1DF2CE60]
struct FOutfitItemType
{
	struct FString                                     m_sResource;                                      		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
};
//0x000010
//SymbolItemType[0x1DF2CDF8]
struct FSymbolItemType
{
	struct FString                                     m_sResource;                                      		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
};
//0x000018
//UnlockItemType[0x1DF2CD90]
struct FUnlockItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
	int                                                m_eUnlockItem;                                    		// 0x000010 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000014 (0x0004)              
};
//0x000008
//UnlockItemInfraCategory[0x1DF2CD28]
struct FUnlockItemInfraCategory
{
	int                                                m_eGameplayEvent;                                 		// 0x000000 (0x0004)              
	int                                                m_eInventoryItemInfraCategory;                    		// 0x000004 (0x0004)              
};
//0x00003C
//RewardPackageItemType[0x1DF2CCC0]
struct FRewardPackageItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sMailBody;                                      		// 0x00000C (0x000C)              
	struct FString                                     m_sMailSubject;                                   		// 0x000018 (0x000C)              
	int                                                m_eCheckUnlock;                                   		// 0x000024 (0x0004)              
	int                                                m_eInventoryItemType;                             		// 0x000028 (0x0004)              
	int                                                m_eRewardPackage;                                 		// 0x00002C (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000030 (0x0004)              
	unsigned char                                      m_eGenderRestriction;                             		// 0x000034 (0x0001)              PROPERTY: etGender
	unsigned char                                      _0x000035[0x3];                                   		// 0x000035 (0x0003) MISSED OFFSET
	unsigned long                                      m_bDescriptionShowsItems : 1;                     		// 0x000038 (0x0004) [0x00000001] 
};
//0x000020
//UsableTokenType[0x1DF2CC58]
struct FUsableTokenType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
	int                                                m_eModifierItem;                                  		// 0x000010 (0x0004)              
	int                                                m_nCharges;                                       		// 0x000014 (0x0004)              
	int                                                m_nMaxCharges;                                    		// 0x000018 (0x0004)              
	int                                                m_nMaxStacks;                                     		// 0x00001C (0x0004)              
};
//0x000028
//VehicleComponentUnlockItemType[0x1DF2CBF0]
struct FVehicleComponentUnlockItemType
{
	struct FString                                     m_sAlternateResource;                             		// 0x000000 (0x000C)              
	struct FString                                     m_sResource;                                      		// 0x00000C (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x000018 (0x0004)              
	int                                                m_eUIComponent;                                   		// 0x00001C (0x0004)              
	int                                                m_nApplicationCost;                               		// 0x000020 (0x0004)              
	int                                                m_nApplicationRating;                             		// 0x000024 (0x0004)              
};
//0x000008
//PrimitiveEntry[0x1DF2CB88]
struct FPrimitiveEntry
{
	int                                                m_ePage;                                          		// 0x000000 (0x0004)              
	int                                                m_ePrimitiveEntry;                                		// 0x000004 (0x0004)              
};
//0x000011
//PrimitivePage[0x1DF2CB20]
struct FPrimitivePage
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	int                                                m_ePrimitivePage;                                 		// 0x00000C (0x0004)              
	unsigned char                                      m_eType;                                          		// 0x000010 (0x0001)              PROPERTY: etPrimitiveType
};
//0x000038
//VehicleItemType[0x1DF2CAB8]
struct FVehicleItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sResource;                                      		// 0x00000C (0x000C)              
	int                                                m_eFnMod[0x4];                                    		// 0x000018 (0x0010)              
	int                                                m_eInventoryItemType;                             		// 0x000028 (0x0004)              
	int                                                m_nReeditFee;                                     		// 0x00002C (0x0004)              
	unsigned char                                      m_eVehicle;                                       		// 0x000030 (0x0001)              PROPERTY: etVehicleSetupType
	unsigned char                                      _0x000031[0x3];                                   		// 0x000031 (0x0003) MISSED OFFSET
	unsigned long                                      m_bPreset : 1;                                    		// 0x000034 (0x0004) [0x00000001] 
};
//0x00002C
//WeaponItemType[0x1DF2CA50]
struct FWeaponItemType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	int                                                m_eActivityMessageIcon;                           		// 0x00000C (0x0004)              
	int                                                m_eFnMod[0x3];                                    		// 0x000010 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00001C (0x0004)              
	int                                                m_eItemAttachment;                                		// 0x000020 (0x0004)              
	int                                                m_eWeaponTypeLink;                                		// 0x000024 (0x0004)              
	unsigned long                                      m_bCausesContagion : 1;                           		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      m_bIsSkinnable : 1;                               		// 0x000028 (0x0004) [0x00000002] 
	unsigned long                                      m_bPreset : 1;                                    		// 0x000028 (0x0004) [0x00000004] 
};
//0x000010
//ThemeItemType[0x1DF2C9E8]
struct FThemeItemType
{
	struct FString                                     m_sResource;                                      		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
};
//0x000008
//TitleUnlockItemType[0x1DF2C980]
struct FTitleUnlockItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
	unsigned long                                      m_bFemale : 1;                                    		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      m_bHideUntilUnlocked : 1;                         		// 0x000004 (0x0004) [0x00000002] 
	unsigned long                                      m_bMale : 1;                                      		// 0x000004 (0x0004) [0x00000004] 
};
//0x000010
//SongItemType[0x1DF2C918]
struct FSongItemType
{
	struct FString                                     m_sResource;                                      		// 0x000000 (0x000C)              
	int                                                m_eInventoryItemType;                             		// 0x00000C (0x0004)              
};
//0x000020
//CameraSeatSetup[0x1DF2C8B0]
struct FCameraSeatSetup
{
	int                                                m_eCameraSeatSetup;                               		// 0x000000 (0x0004)              
	float                                              m_fFOV;                                           		// 0x000004 (0x0004)              
	float                                              m_fIdealLocOffset_X;                              		// 0x000008 (0x0004)              
	float                                              m_fIdealLocOffset_Y;                              		// 0x00000C (0x0004)              
	float                                              m_fIdealLocOffset_Z;                              		// 0x000010 (0x0004)              
	float                                              m_fWorstLocOffset_X;                              		// 0x000014 (0x0004)              
	float                                              m_fWorstLocOffset_Y;                              		// 0x000018 (0x0004)              
	float                                              m_fWorstLocOffset_Z;                              		// 0x00001C (0x0004)              
};
//0x00000A
//VehicleSeatCamera[0x1DF2C848]
struct FVehicleSeatCamera
{
	int                                                m_eLeanOutCamera;                                 		// 0x000000 (0x0004)              
	int                                                m_eSittingCamera;                                 		// 0x000004 (0x0004)              
	unsigned char                                      m_eVehiclePositionIndex;                          		// 0x000008 (0x0001)              PROPERTY: etVehiclePositionIndex
	unsigned char                                      m_eVehicleSetupType;                              		// 0x000009 (0x0001)              PROPERTY: etVehicleSetupType
};
//0x00000D
//WarningPromptGroup[0x1DF2C7E0]
struct FWarningPromptGroup
{
	struct FString                                     m_sWarningPromptGroupName;                        		// 0x000000 (0x000C)              
	unsigned char                                      m_eWarningPromptGroup;                            		// 0x00000C (0x0001)              PROPERTY: etWarningPromptGroup
};
//0x000008
//WeaponSkinUnlockItemType[0x1DF2C778]
struct FWeaponSkinUnlockItemType
{
	int                                                m_eInventoryItemType;                             		// 0x000000 (0x0004)              
	unsigned long                                      m_bHideUntilUnlocked : 1;                         		// 0x000004 (0x0004) [0x00000001] 
};
//0x000040
//InventoryItemCategory[0x1DF2C710]
struct FInventoryItemCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sTableName;                                     		// 0x000018 (0x000C)              
	int                                                m_nByteSize;                                      		// 0x000024 (0x0004)              
	int                                                m_nByteSizeUI;                                    		// 0x000028 (0x0004)              
	int                                                m_nInitialStorageSpace;                           		// 0x00002C (0x0004)              
	int                                                m_nMaxStorageSpace;                               		// 0x000030 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000034 (0x0004)              
	unsigned char                                      m_eInventoryItemCategory;                         		// 0x000038 (0x0001)              PROPERTY: etInventoryItemCategory
	unsigned char                                      _0x000039[0x3];                                   		// 0x000039 (0x0003) MISSED OFFSET
	unsigned long                                      m_bCopyable : 1;                                  		// 0x00003C (0x0004) [0x00000001] 
	unsigned long                                      m_bCreatorWaivesRating : 1;                       		// 0x00003C (0x0004) [0x00000002] 
	unsigned long                                      m_bMarketplaceSearch : 1;                         		// 0x00003C (0x0004) [0x00000004] 
	unsigned long                                      m_bRenamable : 1;                                 		// 0x00003C (0x0004) [0x00000008] 
};
//0x00000C
//InventoryItemLease[0x1DF2C6A8]
struct FInventoryItemLease
{
	int                                                m_eInventoryItemLease;                            		// 0x000000 (0x0004)              
	float                                              m_fCostAPBCashMultiplier;                         		// 0x000004 (0x0004)              
	float                                              m_fExpiryTime;                                    		// 0x000008 (0x0004)              
};
//0x00001E
//InventoryItemSubCategory[0x1DF2C640]
struct FInventoryItemSubCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	int                                                m_nSecondaryKey;                                  		// 0x000018 (0x0004)              
	unsigned char                                      m_eCategory;                                      		// 0x00001C (0x0001)              PROPERTY: etInventoryItemCategory
	unsigned char                                      m_eInventoryItemSubCategory;                      		// 0x00001D (0x0001)              PROPERTY: etInventoryItemSubCategory
};
//0x000050
//InventoryItemInfraCategory[0x1DF2C5D8]
struct FInventoryItemInfraCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sIdentifier;                                    		// 0x000018 (0x000C)              
	struct FString                                     m_sSingularName;                                  		// 0x000024 (0x000C)              
	int                                                m_eInventoryItemInfraCategory;                    		// 0x000030 (0x0004)              
	int                                                m_nInitialAvail;                                  		// 0x000034 (0x0004)              
	int                                                m_nInitialRate;                                   		// 0x000038 (0x0004)              
	int                                                m_nMaxAvail;                                      		// 0x00003C (0x0004)              
	int                                                m_nMaxRate;                                       		// 0x000040 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000044 (0x0004)              
	unsigned char                                      m_eSubCategory;                                   		// 0x000048 (0x0001)              PROPERTY: etInventoryItemSubCategory
	unsigned char                                      _0x000049[0x3];                                   		// 0x000049 (0x0003) MISSED OFFSET
	unsigned long                                      m_bIsPublished : 1;                               		// 0x00004C (0x0004) [0x00000001] 
};
//0x000024
//ShopUIFilterRestriction[0x1DF2C570]
struct FShopUIFilterRestriction
{
	int                                                m_eItemInfraCategory;                             		// 0x000000 (0x0004)              
	int                                                m_eShopUIFilterRestriction;                       		// 0x000004 (0x0004)              
	int                                                m_eUnlockVehicleComponentCategory;                		// 0x000008 (0x0004)              
	int                                                m_eUnlockWeaponType;                              		// 0x00000C (0x0004)              
	int                                                m_eWeaponType;                                    		// 0x000010 (0x0004)              
	unsigned char                                      m_eCustomisable;                                  		// 0x000014 (0x0001)              PROPERTY: etYesNoEither
	unsigned char                                      m_eItemCategory;                                  		// 0x000015 (0x0001)              PROPERTY: etInventoryItemCategory
	unsigned char                                      m_eItemSubCategory;                               		// 0x000016 (0x0001)              PROPERTY: etInventoryItemSubCategory
	unsigned char                                      m_eModifierClass;                                 		// 0x000017 (0x0001)              PROPERTY: etModifierClass
	unsigned char                                      m_eModifierType;                                  		// 0x000018 (0x0001)              PROPERTY: etModifierType
	unsigned char                                      m_eUnlockItemCategory;                            		// 0x000019 (0x0001)              PROPERTY: etInventoryItemCategory
	unsigned char                                      m_eUnlockItemSubCategory;                         		// 0x00001A (0x0001)              PROPERTY: etInventoryItemSubCategory
	unsigned char                                      m_eUnlockModifierClass;                           		// 0x00001B (0x0001)              PROPERTY: etModifierClass
	unsigned char                                      m_eUnlockModifierType;                            		// 0x00001C (0x0001)              PROPERTY: etModifierType
	unsigned char                                      _0x00001D[0x3];                                   		// 0x00001D (0x0003) MISSED OFFSET
	unsigned long                                      m_bEmbeddedItem : 1;                              		// 0x000020 (0x0004) [0x00000001] 
	unsigned long                                      m_bEquipable : 1;                                 		// 0x000020 (0x0004) [0x00000002] 
	unsigned long                                      m_bNotDeployed : 1;                               		// 0x000020 (0x0004) [0x00000004] 
	unsigned long                                      m_bNoTimeLimits : 1;                              		// 0x000020 (0x0004) [0x00000008] 
	unsigned long                                      m_bTrade : 1;                                     		// 0x000020 (0x0004) [0x00000010] 
	unsigned long                                      m_bUnlockCapacity : 1;                            		// 0x000020 (0x0004) [0x00000020] 
	unsigned long                                      m_bUnlockEmote : 1;                               		// 0x000020 (0x0004) [0x00000040] 
	unsigned long                                      m_bUnlockSymbolPrimitive : 1;                     		// 0x000020 (0x0004) [0x00000080] 
	unsigned long                                      m_bUnlockVehicleComponent : 1;                    		// 0x000020 (0x0004) [0x00000100] 
	unsigned long                                      m_bUnused : 1;                                    		// 0x000020 (0x0004) [0x00000200] 
};
//0x00004C
//ShopUIFilter[0x1DF2C508]
struct FShopUIFilter
{
	struct FString                                     m_sName;                                          		// 0x000000 (0x000C)              
	int                                                m_eEnable[0x3];                                   		// 0x00000C (0x000C)              
	int                                                m_eOption[0x4];                                   		// 0x000018 (0x0010)              
	int                                                m_eParent;                                        		// 0x000028 (0x0004)              
	int                                                m_eShop[0x5];                                     		// 0x00002C (0x0014)              
	int                                                m_eShopUIFilter;                                  		// 0x000040 (0x0004)              
	int                                                m_nDefaultWeighting;                              		// 0x000044 (0x0004)              
	unsigned long                                      m_bDevOnly : 1;                                   		// 0x000048 (0x0004) [0x00000001] 
};
//0x000039
//Faction[0x1DF2C4A0]
struct FFaction
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sFactionInfoDescription;                        		// 0x00000C (0x000C)              
	struct FString                                     m_sFactionInfoDisplayName;                        		// 0x000018 (0x000C)              
	struct FString                                     m_sSkinName;                                      		// 0x000024 (0x000C)              
	int                                                m_eSpawnZoneMarker;                               		// 0x000030 (0x0004)              
	int                                                m_eVolumeColour;                                  		// 0x000034 (0x0004)              
	unsigned char                                      m_eFaction;                                       		// 0x000038 (0x0001)              PROPERTY: etFaction
};
//0x000060
//ItemAttachmentVisual[0x1DF2C438]
struct FItemAttachmentVisual
{
	struct FString                                     m_sAnimSetAsset;                                  		// 0x000000 (0x000C)              
	struct FString                                     m_sAnimTreeAsset;                                 		// 0x00000C (0x000C)              
	struct FString                                     m_sAttachmentAsset;                               		// 0x000018 (0x000C)              
	struct FString                                     m_sAttachmentClass;                               		// 0x000024 (0x000C)              
	struct FString                                     m_sAudioType;                                     		// 0x000030 (0x000C)              
	struct FString                                     m_sPhysicsAsset;                                  		// 0x00003C (0x000C)              
	int                                                m_eAnimTreeDecision;                              		// 0x000048 (0x0004)              
	int                                                m_eItemAttachmentVisual;                          		// 0x00004C (0x0004)              
	int                                                m_eUIMeshViewerSetup;                             		// 0x000050 (0x0004)              
	int                                                m_eUIMeshViewerSetup_Inventory;                   		// 0x000054 (0x0004)              
	unsigned char                                      m_eTaskItemAnimationType;                         		// 0x000058 (0x0001)              PROPERTY: etTaskItemAnimationType
	unsigned char                                      _0x000059[0x3];                                   		// 0x000059 (0x0003) MISSED OFFSET
	unsigned long                                      m_bLeftHandIKByDefault : 1;                       		// 0x00005C (0x0004) [0x00000001] 
	unsigned long                                      m_bLeftHandIKWhileAiming : 1;                     		// 0x00005C (0x0004) [0x00000002] 
	unsigned long                                      m_bSuppressRunAnimation : 1;                      		// 0x00005C (0x0004) [0x00000004] 
	unsigned long                                      m_bSuppressSprintAnimation : 1;                   		// 0x00005C (0x0004) [0x00000008] 
};
//0x000041
//WeaponAttachmentVisual[0x1DF2C3D0]
struct FWeaponAttachmentVisual
{
	struct FString                                     m_sImpactVFX;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sMuzzleFlashVFX;                                		// 0x00000C (0x000C)              
	struct FString                                     m_sNonTracerShotVFX;                              		// 0x000018 (0x000C)              
	struct FString                                     m_sTracerVFX;                                     		// 0x000024 (0x000C)              
	struct FString                                     m_sWindupAudioType;                               		// 0x000030 (0x000C)              
	int                                                m_eItemAttachmentVisual;                          		// 0x00003C (0x0004)              
	unsigned char                                      m_eImpactClass;                                   		// 0x000040 (0x0001)              PROPERTY: etWeaponImpactClass
};
//0x00000D
//FireOffset[0x1DF2C368]
struct FFireOffset
{
	float                                              m_fForwards;                                      		// 0x000000 (0x0004)              
	float                                              m_fRight;                                         		// 0x000004 (0x0004)              
	float                                              m_fUp;                                            		// 0x000008 (0x0004)              
	unsigned char                                      m_eFireOffset;                                    		// 0x00000C (0x0001)              PROPERTY: etFireOffset
};
//0x00000C
//Encumbrance[0x1DF2C300]
struct FEncumbrance
{
	int                                                m_nUIEncumbranceLevel;                            		// 0x000000 (0x0004)              
	unsigned char                                      m_eEncumbrance;                                   		// 0x000004 (0x0001)              PROPERTY: etEncumbrance
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	unsigned long                                      m_bCanCrouchMove : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bCanJump : 1;                                   		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      m_bCanRun : 1;                                    		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      m_bCanSprint : 1;                                 		// 0x000008 (0x0004) [0x00000008] 
};
//0x000004
//AnimTreeDecision_EquippedItem[0x1DF2C298]
struct FAnimTreeDecision_EquippedItem
{
	int                                                m_eAnimTreeDecision_EquippedItem;                 		// 0x000000 (0x0004)              
};
//0x000004
//AnimTreeDecision_Vehicle[0x1DF2C230]
struct FAnimTreeDecision_Vehicle
{
	int                                                m_eAnimTreeDecision_Vehicle;                      		// 0x000000 (0x0004)              
};
//0x000005
//PawnHitReaction[0x1DF2C1C8]
struct FPawnHitReaction
{
	int                                                m_ePawnHitReaction;                               		// 0x000000 (0x0004)              
	unsigned char                                      m_eType;                                          		// 0x000004 (0x0001)              PROPERTY: etPawnHitReactionType
};
//0x000058
//PawnHitReaction_BoneList[0x1DF2C160]
struct FPawnHitReaction_BoneList
{
	struct FString                                     m_sValue[0x7];                                    		// 0x000000 (0x0054)              
	int                                                m_ePawnHitReaction;                               		// 0x000054 (0x0004)              
};
//0x00001C
//PawnHitReaction_BoneRemapTable[0x1DF2C0F8]
struct FPawnHitReaction_BoneRemapTable
{
	struct FString                                     m_sBoneFrom;                                      		// 0x000000 (0x000C)              
	struct FString                                     m_sBoneTo;                                        		// 0x00000C (0x000C)              
	int                                                m_ePawnHitReaction;                               		// 0x000018 (0x0004)              
};
//0x000008
//PawnHitReaction_Bool[0x1DF2C090]
struct FPawnHitReaction_Bool
{
	int                                                m_ePawnHitReaction;                               		// 0x000000 (0x0004)              
	unsigned long                                      m_bValue : 1;                                     		// 0x000004 (0x0004) [0x00000001] 
};
//0x000034
//PawnHitReaction_ConstrainedBoneList[0x1DF2C028]
struct FPawnHitReaction_ConstrainedBoneList
{
	struct FString                                     m_sValue[0x4];                                    		// 0x000000 (0x0030)              
	int                                                m_ePawnHitReaction;                               		// 0x000030 (0x0004)              
};
//0x000008
//PawnHitReaction_Float[0x1DF2BFC0]
struct FPawnHitReaction_Float
{
	int                                                m_ePawnHitReaction;                               		// 0x000000 (0x0004)              
	float                                              m_fValue;                                         		// 0x000004 (0x0004)              
};
//0x00001C
//PawnHitReaction_SpringList[0x1DF2BF58]
struct FPawnHitReaction_SpringList
{
	struct FString                                     m_sValue[0x2];                                    		// 0x000000 (0x0018)              
	int                                                m_ePawnHitReaction;                               		// 0x000018 (0x0004)              
};
//0x00000C
//PawnHitReaction_Vector2D[0x1DF2BEF0]
struct FPawnHitReaction_Vector2D
{
	int                                                m_ePawnHitReaction;                               		// 0x000000 (0x0004)              
	float                                              m_fX;                                             		// 0x000004 (0x0004)              
	float                                              m_fY;                                             		// 0x000008 (0x0004)              
};
//0x00005D
//Explosion[0x1DF2BE88]
struct FExplosion
{
	struct FString                                     m_sAudioType;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sVFXAsset;                                      		// 0x00000C (0x000C)              
	struct FString                                     m_sVFXAsset_Airburst;                             		// 0x000018 (0x000C)              
	int                                                m_eCameraShake;                                   		// 0x000024 (0x0004)              
	int                                                m_eExplosion;                                     		// 0x000028 (0x0004)              
	float                                              m_fExplosionRadius;                               		// 0x00002C (0x0004)              
	float                                              m_fGroundZeroRadius;                              		// 0x000030 (0x0004)              
	float                                              m_fHardDamageModifier;                            		// 0x000034 (0x0004)              
	float                                              m_fImpulseZMax;                                   		// 0x000038 (0x0004)              
	float                                              m_fImpulseZMin;                                   		// 0x00003C (0x0004)              
	float                                              m_fLifetimeMaxDamageTime;                         		// 0x000040 (0x0004)              
	float                                              m_fLifetimeMinDamagePercentage;                   		// 0x000044 (0x0004)              
	float                                              m_fMinimumDamagePercentage;                       		// 0x000048 (0x0004)              
	float                                              m_fRagdollRadialImpulse;                          		// 0x00004C (0x0004)              
	float                                              m_fSoftDamageModifier;                            		// 0x000050 (0x0004)              
	int                                                m_nDamage;                                        		// 0x000054 (0x0004)              
	int                                                m_nStunDamage;                                    		// 0x000058 (0x0004)              
	unsigned char                                      m_eNPCWorldEvent;                                 		// 0x00005C (0x0001)              PROPERTY: etNPCWorldEvent
};
//0x000020
//GrenadeWeaponType[0x1DF2BE20]
struct FGrenadeWeaponType
{
	int                                                m_eRecoil;                                        		// 0x000000 (0x0004)              
	int                                                m_eWeaponProjectile;                              		// 0x000004 (0x0004)              
	int                                                m_eWeaponType;                                    		// 0x000008 (0x0004)              
	float                                              m_fFiringSpeed;                                   		// 0x00000C (0x0004)              
	float                                              m_fMaxAngleAdded;                                 		// 0x000010 (0x0004)              
	float                                              m_fPinPullTime;                                   		// 0x000014 (0x0004)              
	float                                              m_fThrowTime;                                     		// 0x000018 (0x0004)              
	unsigned long                                      m_bAffectedByGravity : 1;                         		// 0x00001C (0x0004) [0x00000001] 
};
//0x00000D
//WeaponClass[0x1DF2BDB8]
struct FWeaponClass
{
	struct FString                                     m_sUnrealClassName;                               		// 0x000000 (0x000C)              
	unsigned char                                      m_eWeaponClass;                                   		// 0x00000C (0x0001)              PROPERTY: etWeaponClass
};
//0x000040
//WeaponProjectile[0x1DF2BD50]
struct FWeaponProjectile
{
	struct FString                                     m_sFlightAudioEvent;                              		// 0x000000 (0x000C)              
	struct FString                                     m_sMesh;                                          		// 0x00000C (0x000C)              
	struct FString                                     m_sTrailVFX;                                      		// 0x000018 (0x000C)              
	int                                                m_eExplosion;                                     		// 0x000024 (0x0004)              
	int                                                m_eWeaponProjectile;                              		// 0x000028 (0x0004)              
	float                                              m_fArmingTimer;                                   		// 0x00002C (0x0004)              
	float                                              m_fBounceDamping;                                 		// 0x000030 (0x0004)              
	float                                              m_fFuseDelay;                                     		// 0x000034 (0x0004)              
	float                                              m_fGravityMultiplier;                             		// 0x000038 (0x0004)              
	unsigned long                                      m_bAudioWaitUntilFalling : 1;                     		// 0x00003C (0x0004) [0x00000001] 
	unsigned long                                      m_bImpactDetonated : 1;                           		// 0x00003C (0x0004) [0x00000002] 
	unsigned long                                      m_bTumble : 1;                                    		// 0x00003C (0x0004) [0x00000004] 
};
//0x000064
//AmmoCategory[0x1DF2BCE8]
struct FAmmoCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sName;                                          		// 0x00000C (0x000C)              
	struct FString                                     m_sNameAbbreviated;                               		// 0x000018 (0x000C)              
	struct FString                                     m_sQuantityText;                                  		// 0x000024 (0x000C)              
	int                                                m_eAmmoCategory;                                  		// 0x000030 (0x0004)              
	int                                                m_eRequiresWeaponUnlocked;                        		// 0x000034 (0x0004)              
	int                                                m_nBoxCost;                                       		// 0x000038 (0x0004)              
	int                                                m_nBoxSize;                                       		// 0x00003C (0x0004)              
	int                                                m_nCapacity;                                      		// 0x000040 (0x0004)              
	int                                                m_nGiftedAmount;                                  		// 0x000044 (0x0004)              
	int                                                m_nPresetBoxQuantity[0x4];                        		// 0x000048 (0x0010)              
	int                                                m_nSecondaryKey;                                  		// 0x000058 (0x0004)              
	int                                                m_sHUDImage_Bullet;                               		// 0x00005C (0x0004)              
	unsigned long                                      m_bThrownGrenade : 1;                             		// 0x000060 (0x0004) [0x00000001] 
};
//0x000008
//SpeedModifier[0x1DF2BC80]
struct FSpeedModifier
{
	float                                              m_fMultiplier;                                    		// 0x000000 (0x0004)              
	float                                              m_fValueToAdd;                                    		// 0x000004 (0x0004)              
};
//0x000028
//SpeedModifiers[0x1DF2BC18]
struct FSpeedModifiers
{
	struct FSpeedModifier                              m_Crouch;                                         		// 0x000000 (0x0008)              
	struct FSpeedModifier                              m_Walk;                                           		// 0x000008 (0x0008)              
	struct FSpeedModifier                              m_Run;                                            		// 0x000010 (0x0008)              
	struct FSpeedModifier                              m_Sprint;                                         		// 0x000018 (0x0008)              
	struct FSpeedModifier                              m_Marksmanship;                                   		// 0x000020 (0x0008)              
};
//0x000010
//ModifierItemData[0x1DF2BBB0]
struct FModifierItemData
{
	int                                                nCategory;                                        		// 0x000000 (0x0004)              
	int                                                nModifierItem;                                    		// 0x000004 (0x0004)              
	float                                              m_fIntervalAccumulator;                           		// 0x000008 (0x0004)              
	int                                                m_nRemainingPeriodicCalls;                        		// 0x00000C (0x0004)              
};
//0x0000B0
//WeaponType[0x1DF2BB48]
struct FWeaponType
{
	int                                                m_eAmmoCategory;                                  		// 0x000000 (0x0004)              
	int                                                m_eDisabledRuleSets;                              		// 0x000004 (0x0004)              
	int                                                m_eTagger;                                        		// 0x000008 (0x0004)              
	int                                                m_eWeaponCurve;                                   		// 0x00000C (0x0004)              
	int                                                m_eWeaponProjectile;                              		// 0x000010 (0x0004)              
	int                                                m_eWeaponType;                                    		// 0x000014 (0x0004)              
	float                                              m_fAccuracyCooldown;                              		// 0x000018 (0x0004)              
	float                                              m_fBurstInterval;                                 		// 0x00001C (0x0004)              
	float                                              m_fCrouchSpeed;                                   		// 0x000020 (0x0004)              
	float                                              m_fEquipTime;                                     		// 0x000024 (0x0004)              
	float                                              m_fFireInterval;                                  		// 0x000028 (0x0004)              
	float                                              m_fHardDamageModifier;                            		// 0x00002C (0x0004)              
	float                                              m_fHealthDamage;                                  		// 0x000030 (0x0004)              
	float                                              m_fHolsterTime;                                   		// 0x000034 (0x0004)              
	float                                              m_fJumpZ;                                         		// 0x000038 (0x0004)              
	float                                              m_fMarksmanshipSpeed;                             		// 0x00003C (0x0004)              
	float                                              m_fPingDistance;                                  		// 0x000040 (0x0004)              
	float                                              m_fRagdollImpulseScale;                           		// 0x000044 (0x0004)              
	float                                              m_fReloadEndAnimDuration;                         		// 0x000048 (0x0004)              
	float                                              m_fReloadTime;                                    		// 0x00004C (0x0004)              
	float                                              m_fResupplyDelaySecs;                             		// 0x000050 (0x0004)              
	float                                              m_fRunSpeed;                                      		// 0x000054 (0x0004)              
	float                                              m_fSoftDamageModifier;                            		// 0x000058 (0x0004)              
	float                                              m_fSprintDelay;                                   		// 0x00005C (0x0004)              
	float                                              m_fSprintSpeed;                                   		// 0x000060 (0x0004)              
	float                                              m_fStaminaDamage;                                 		// 0x000064 (0x0004)              
	float                                              m_fTaggerDuration;                                		// 0x000068 (0x0004)              
	float                                              m_fUIHardDamageLevel;                             		// 0x00006C (0x0004)              
	float                                              m_fUIRangeLevel;                                  		// 0x000070 (0x0004)              
	float                                              m_fUIRateOfFire;                                  		// 0x000074 (0x0004)              
	float                                              m_fUISoftDamageLevel;                             		// 0x000078 (0x0004)              
	float                                              m_fUIStunDamageLevel;                             		// 0x00007C (0x0004)              
	float                                              m_fWalkSpeed;                                     		// 0x000080 (0x0004)              
	float                                              m_fWindUpTime;                                    		// 0x000084 (0x0004)              
	int                                                m_nAmmoPoolCapacity;                              		// 0x000088 (0x0004)              
	int                                                m_nBurstShots;                                    		// 0x00008C (0x0004)              
	int                                                m_nImpulseStrength;                               		// 0x000090 (0x0004)              
	int                                                m_nMagazineCapacity;                              		// 0x000094 (0x0004)              
	int                                                m_nMagazineWarningAmount;                         		// 0x000098 (0x0004)              
	int                                                m_nResupplyUnits;                                 		// 0x00009C (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x0000A0 (0x0004)              
	unsigned char                                      m_eClass;                                         		// 0x0000A4 (0x0001)              PROPERTY: etWeaponClass
	unsigned char                                      m_eEncumbrance;                                   		// 0x0000A5 (0x0001)              PROPERTY: etEncumbrance
	unsigned char                                      m_eHUDReticule;                                   		// 0x0000A6 (0x0001)              PROPERTY: etHUDReticule
	unsigned char                                      m_eHUDReticuleMarksmanship;                       		// 0x0000A7 (0x0001)              PROPERTY: etHUDReticule
	unsigned char                                      m_eNPCFiredEvent;                                 		// 0x0000A8 (0x0001)              PROPERTY: etNPCWorldEvent
	unsigned char                                      m_eNPCHitEvent;                                   		// 0x0000A9 (0x0001)              PROPERTY: etNPCWorldEvent
	unsigned char                                      m_eWeaponFiringState;                             		// 0x0000AA (0x0001)              PROPERTY: etWeaponFiringState
	unsigned char                                      _0x0000AB[0x1];                                   		// 0x0000AB (0x0001) MISSED OFFSET
	unsigned long                                      m_bAlwaysPlayReloadEndAnim : 1;                   		// 0x0000AC (0x0004) [0x00000001] 
	unsigned long                                      m_bAutoSingleShotAudio : 1;                       		// 0x0000AC (0x0004) [0x00000002] 
	unsigned long                                      m_bCanSprint : 1;                                 		// 0x0000AC (0x0004) [0x00000004] 
	unsigned long                                      m_bDisallowSwitchInRefireTimer : 1;               		// 0x0000AC (0x0004) [0x00000008] 
	unsigned long                                      m_bDontDrop : 1;                                  		// 0x0000AC (0x0004) [0x00000010] 
	unsigned long                                      m_bEquipInVehicle : 1;                            		// 0x0000AC (0x0004) [0x00000020] 
	unsigned long                                      m_bForceRagdollDeath : 1;                         		// 0x0000AC (0x0004) [0x00000040] 
	unsigned long                                      m_bHasReloadEndAnimation : 1;                     		// 0x0000AC (0x0004) [0x00000080] 
	unsigned long                                      m_bIsResuppliable : 1;                            		// 0x0000AC (0x0004) [0x00000100] 
	unsigned long                                      m_bLessLethal : 1;                                		// 0x0000AC (0x0004) [0x00000200] 
	unsigned long                                      m_bLoopedReload : 1;                              		// 0x0000AC (0x0004) [0x00000400] 
	unsigned long                                      m_bUsesStopAudioEvent : 1;                        		// 0x0000AC (0x0004) [0x00000800] 
	unsigned long                                      m_bWitnessing : 1;                                		// 0x0000AC (0x0004) [0x00001000] 
};
//0x000090
//RangedWeaponType[0x1DF2BAE0]
struct FRangedWeaponType
{
	int                                                m_eExplosionType;                                 		// 0x000000 (0x0004)              
	int                                                m_eRecoil;                                        		// 0x000004 (0x0004)              
	int                                                m_eWeaponType;                                    		// 0x000008 (0x0004)              
	float                                              m_fAccuracyCooldown;                              		// 0x00000C (0x0004)              
	float                                              m_fAccuracyPower;                                 		// 0x000010 (0x0004)              
	float                                              m_fCrouchModifier;                                		// 0x000014 (0x0004)              
	float                                              m_fInVehicleModifier;                             		// 0x000018 (0x0004)              
	float                                              m_fJumpModifier;                                  		// 0x00001C (0x0004)              
	float                                              m_fLeanModifier;                                  		// 0x000020 (0x0004)              
	float                                              m_fMarksmanshipFOV16;                             		// 0x000024 (0x0004)              
	float                                              m_fMarksmanshipFOV4;                              		// 0x000028 (0x0004)              
	float                                              m_fMarksmanshipModifier;                          		// 0x00002C (0x0004)              
	float                                              m_fMaxRange;                                      		// 0x000030 (0x0004)              
	float                                              m_fMaxTimeBetweenShots;                           		// 0x000034 (0x0004)              
	float                                              m_fMinDamageRange;                                		// 0x000038 (0x0004)              
	float                                              m_fMinimumCrosshairWidth;                         		// 0x00003C (0x0004)              
	float                                              m_fMinimumDamagePercentage;                       		// 0x000040 (0x0004)              
	float                                              m_fOverallShotModifierCap;                        		// 0x000044 (0x0004)              
	float                                              m_fPerShotModifier;                               		// 0x000048 (0x0004)              
	float                                              m_fPierceDamageReduction;                         		// 0x00004C (0x0004)              
	float                                              m_fPierceDamageScale;                             		// 0x000050 (0x0004)              
	float                                              m_fRadiusAtTenMetres;                             		// 0x000054 (0x0004)              
	float                                              m_fRampDistance;                                  		// 0x000058 (0x0004)              
	float                                              m_fRaySpreadAtTenMetres;                          		// 0x00005C (0x0004)              
	float                                              m_fRecoveryDelay;                                 		// 0x000060 (0x0004)              
	float                                              m_fRecoveryPerSecond;                             		// 0x000064 (0x0004)              
	float                                              m_fRunModifier;                                   		// 0x000068 (0x0004)              
	float                                              m_fSprintModifier;                                		// 0x00006C (0x0004)              
	float                                              m_fWalkModifier;                                  		// 0x000070 (0x0004)              
	float                                              m_fWeaponSwitchMinAccuracy;                       		// 0x000074 (0x0004)              
	int                                                m_nFreeAmmo;                                      		// 0x000078 (0x0004)              
	int                                                m_nMaxPierceCount;                                		// 0x00007C (0x0004)              
	int                                                m_nMinNumShots;                                   		// 0x000080 (0x0004)              
	int                                                m_nRaysPerShot;                                   		// 0x000084 (0x0004)              
	int                                                m_nTracerFrequency;                               		// 0x000088 (0x0004)              
	unsigned long                                      m_bCanHitOwnVehicle : 1;                          		// 0x00008C (0x0004) [0x00000001] 
};
//0x00004C
//WeaponRecoil[0x1DF2BA78]
struct FWeaponRecoil
{
	int                                                m_eWeaponRecoil;                                  		// 0x000000 (0x0004)              
	float                                              m_fRecoilExp;                                     		// 0x000004 (0x0004)              
	float                                              m_fRecoverExp;                                    		// 0x000008 (0x0004)              
	int                                                m_nMarksmanshipPitchPercentage;                   		// 0x00000C (0x0004)              
	int                                                m_nMarksmanshipYawPercentage;                     		// 0x000010 (0x0004)              
	int                                                m_nPitchMax;                                      		// 0x000014 (0x0004)              
	int                                                m_nPitchMin;                                      		// 0x000018 (0x0004)              
	int                                                m_nPitchRecoveryPercentageMax;                    		// 0x00001C (0x0004)              
	int                                                m_nPitchRecoveryPercentageMin;                    		// 0x000020 (0x0004)              
	int                                                m_nRecoilTime;                                    		// 0x000024 (0x0004)              
	int                                                m_nRecoverTime;                                   		// 0x000028 (0x0004)              
	int                                                m_nYawNegativeMax;                                		// 0x00002C (0x0004)              
	int                                                m_nYawNegativeMin;                                		// 0x000030 (0x0004)              
	int                                                m_nYawNegativeRecoveryPercentageMax;              		// 0x000034 (0x0004)              
	int                                                m_nYawNegativeRecoveryPercentageMin;              		// 0x000038 (0x0004)              
	int                                                m_nYawPositiveMax;                                		// 0x00003C (0x0004)              
	int                                                m_nYawPositiveMin;                                		// 0x000040 (0x0004)              
	int                                                m_nYawPositiveRecoveryPercentageMax;              		// 0x000044 (0x0004)              
	int                                                m_nYawPositiveRecoveryPercentageMin;              		// 0x000048 (0x0004)              
};
//0x0000B4
//WeaponCurve[0x1DF2BA10]
struct FWeaponCurve
{
	struct FString                                     m_sAccuracyRecovery;                              		// 0x000000 (0x000C)              
	struct FString                                     m_sBurstShots;                                    		// 0x00000C (0x000C)              
	struct FString                                     m_sEffectiveRange;                                		// 0x000018 (0x000C)              
	struct FString                                     m_sPerShotModifier;                               		// 0x000024 (0x000C)              
	struct FString                                     m_sPingDistance;                                  		// 0x000030 (0x000C)              
	struct FString                                     m_sPitch;                                         		// 0x00003C (0x000C)              
	struct FString                                     m_sRadiusAtTenMetres;                             		// 0x000048 (0x000C)              
	struct FString                                     m_sRecoveryPerSecond;                             		// 0x000054 (0x000C)              
	struct FString                                     m_sReloadTime;                                    		// 0x000060 (0x000C)              
	struct FString                                     m_sYawNegative;                                   		// 0x00006C (0x000C)              
	struct FString                                     m_sYawPositive;                                   		// 0x000078 (0x000C)              
	int                                                m_eWeaponCurve;                                   		// 0x000084 (0x0004)              
	float                                              m_fBurstShotsInc;                                 		// 0x000088 (0x0004)              
	float                                              m_fGeneralRecoveryDelay;                          		// 0x00008C (0x0004)              
	float                                              m_fGeneralRecoveryScale;                          		// 0x000090 (0x0004)              
	float                                              m_fPerShotModifierInc;                            		// 0x000094 (0x0004)              
	float                                              m_fPingDistanceInc;                               		// 0x000098 (0x0004)              
	float                                              m_fPitchInc;                                      		// 0x00009C (0x0004)              
	float                                              m_fRadiusAtTenMetresInc;                          		// 0x0000A0 (0x0004)              
	float                                              m_fReloadTimeInc;                                 		// 0x0000A4 (0x0004)              
	float                                              m_fYawNegativeInc;                                		// 0x0000A8 (0x0004)              
	float                                              m_fYawPositiveInc;                                		// 0x0000AC (0x0004)              
	unsigned long                                      m_bBurstShotsRecover : 1;                         		// 0x0000B0 (0x0004) [0x00000001] 
	unsigned long                                      m_bPerShotModifierRecover : 1;                    		// 0x0000B0 (0x0004) [0x00000002] 
	unsigned long                                      m_bPingDistanceRecovers : 1;                      		// 0x0000B0 (0x0004) [0x00000004] 
	unsigned long                                      m_bPitchRecover : 1;                              		// 0x0000B0 (0x0004) [0x00000008] 
	unsigned long                                      m_bRadiusAtTenMetresRecover : 1;                  		// 0x0000B0 (0x0004) [0x00000010] 
	unsigned long                                      m_bYawNegativeRecover : 1;                        		// 0x0000B0 (0x0004) [0x00000020] 
	unsigned long                                      m_bYawPositiveRecover : 1;                        		// 0x0000B0 (0x0004) [0x00000040] 
};
//0x000008
//ClampedWeaponCurve_Float[0x1DF2B9A8]
struct FClampedWeaponCurve_Float
{
	class UcDesignerCurve_Float*                       Curve;                                            		// 0x000000 (0x0004)              
	float                                              CurrentTime;                                      		// 0x000004 (0x0004)              
};
//0x00000C
//WeaponAmmoPool[0x1DF2B940]
struct FWeaponAmmoPool
{
	int                                                m_eAmmoCategory;                                  		// 0x000000 (0x0004)              
	int                                                m_nCapacity;                                      		// 0x000004 (0x0004)              
	int                                                m_nAmount;                                        		// 0x000008 (0x0004)              
};
//0x000008
//ShotSeedEntry[0x1DF2B8D8]
struct FShotSeedEntry
{
	int                                                m_nShotID;                                        		// 0x000000 (0x0004)              
	int                                                m_nNumberOfShots;                                 		// 0x000004 (0x0004)              
};
//0x000024
//MagazineStats[0x1DF2B870]
struct FMagazineStats
{
	double                                             m_fFirstFireTime;                                 		// 0x000000 (0x0008)              
	int                                                m_nNumShots;                                      		// 0x000008 (0x0004)              
	int                                                m_nNumHits;                                       		// 0x00000C (0x0004)              
	int                                                m_nNumHitsPlayer;                                 		// 0x000010 (0x0004)              
	int                                                m_nNumHitsVehicle;                                		// 0x000014 (0x0004)              
	int                                                m_nNumKills;                                      		// 0x000018 (0x0004)              
	int                                                m_nSoftDamage;                                    		// 0x00001C (0x0004)              
	int                                                m_nHardDamage;                                    		// 0x000020 (0x0004)              
};
//0x00000C
//PvPFlags[0x1DF2B808]
struct FPvPFlags
{
	int                                                m_nMissionID;                                     		// 0x000000 (0x0004)              
	unsigned char                                      m_nTeamIndex;                                     		// 0x000004 (0x0001)              PROPERTY: 
	unsigned char                                      m_nFriendlyIndices;                               		// 0x000005 (0x0001)              PROPERTY: 
	unsigned char                                      m_nHostileIndices;                                		// 0x000006 (0x0001)              PROPERTY: 
	unsigned char                                      m_ePvPType;                                       		// 0x000007 (0x0001)              PROPERTY: etPvPType
	unsigned long                                      m_bDamageByFriend : 1;                            		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bDamageByEnemy : 1;                             		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      m_bDamageByOwnFaction : 1;                        		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      m_bDamageByOtherFaction : 1;                      		// 0x000008 (0x0004) [0x00000008] 
	unsigned long                                      m_bDamageByOutOfMission : 1;                      		// 0x000008 (0x0004) [0x00000010] 
	unsigned long                                      m_bCollisionDamageInvulnerable : 1;               		// 0x000008 (0x0004) [0x00000020] 
	unsigned long                                      m_bForceFactionFriendlyColours : 1;               		// 0x000008 (0x0004) [0x00000040] 
};
//0x000030
//CompactGolemDescriptor[0x1DF2B7A0]
struct FCompactGolemDescriptor
{
	struct FGuid                                       m_CharacterGuid;                                  		// 0x000000 (0x0010)              
	struct FGuid                                       m_StatueGuid;                                     		// 0x000010 (0x0010)              
	struct FGuid                                       m_AudioGUID;                                      		// 0x000020 (0x0010)              
};
//0x000020
//CompactGolemobileDescriptor[0x1DF2B738]
struct FCompactGolemobileDescriptor
{
	struct FGuid                                       m_VehicleGUID;                                    		// 0x000000 (0x0010)              
	struct FGuid                                       m_AudioGUID;                                      		// 0x000010 (0x0010)              
};
//0x000018
//tIKStrategySetting[0x1DF2B6D0]
struct FtIKStrategySetting
{
	unsigned char                                      Strategy;                                         		// 0x000000 (0x0001)              PROPERTY: etIKStrategy
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       SocketName;                                       		// 0x000004 (0x0008)              
	struct FName                                       FemaleSocketName;                                 		// 0x00000C (0x0008)              
	unsigned char                                      MatchAxis[0x3];                                   		// 0x000014 (0x0003)              PROPERTY: etMatchAxis
	unsigned char                                      EffectorRotation;                                 		// 0x000017 (0x0001)              PROPERTY: etEffectorRotation
};
//0x000005
//HUDMarkerState[0x1DF2B668]
struct FHUDMarkerState
{
	float                                              m_fUpdateDelay;                                   		// 0x000000 (0x0004)              
	unsigned char                                      m_eHUDMarkerState;                                		// 0x000004 (0x0001)              PROPERTY: etHUDMarkerState
};
//0x000020
//HUDMarkerData[0x1DF2B600]
struct FHUDMarkerData
{
	class AActor*                                      pLinkedActor;                                     		// 0x000000 (0x0004)              
	FVector3                                           Location;                                         		// 0x000004 (0x000C)              
	unsigned char                                      eOffsetOverride;                                  		// 0x000010 (0x0001)              PROPERTY: 
	unsigned char                                      eCSAAutoRouteData;                                		// 0x000011 (0x0001)              PROPERTY: 
	unsigned char                                      eType;                                            		// 0x000012 (0x0001)              PROPERTY: 
	unsigned char                                      eState;                                           		// 0x000013 (0x0001)              PROPERTY: etHUDMarkerState
	unsigned long                                      bIsBeingModified : 1;                             		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      bIsCharacterName : 1;                             		// 0x000014 (0x0004) [0x00000002] 
	int                                                nUserData;                                        		// 0x000018 (0x0004)              
	int                                                nUserData2;                                       		// 0x00001C (0x0004)              
};
//0x000008
//HUDMarkerRadarJammer[0x1DF2B598]
struct FHUDMarkerRadarJammer
{
	int                                                m_nCharacterUID;                                  		// 0x000000 (0x0004)              
	float                                              m_nRangeSquared;                                  		// 0x000004 (0x0004)              
};
//0x000005
//APBPawnConstant[0x1DF2B530]
struct FAPBPawnConstant
{
	float                                              m_fValue;                                         		// 0x000000 (0x0004)              
	unsigned char                                      m_eAPBPawnConstant;                               		// 0x000004 (0x0001)              PROPERTY: etAPBPawnConstant
};
//0x000020
//DyingData[0x1DF2B4C8]
struct FDyingData
{
	unsigned char                                      eDyingState;                                      		// 0x000000 (0x0001)              PROPERTY: etDyingState
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	unsigned long                                      bForceRagdoll : 1;                                		// 0x000004 (0x0004) [0x00000001] 
	int                                                nControllerUID;                                   		// 0x000008 (0x0004)              
	float                                              fImpulseScale;                                    		// 0x00000C (0x0004)              
	int                                                nExplosionType;                                   		// 0x000010 (0x0004)              
	FVector3                                           vExplosionLocation;                               		// 0x000014 (0x000C)              
};
//0x000034
//HitReactionInfo[0x1DF2B460]
struct FHitReactionInfo
{
	FVector3                                           HitLocation;                                      		// 0x000000 (0x000C)              
	FVector3                                           Momentum;                                         		// 0x00000C (0x000C)              
	class UClass*                                      DamageType;                                       		// 0x000018 (0x0004)              
	class APawn*                                       InstigatedBy;                                     		// 0x00001C (0x0004)              
	struct FName                                       HitBone;                                          		// 0x000020 (0x0008)              
	class UPhysicalMaterial*                           PhysicalMaterial;                                 		// 0x000028 (0x0004)              
	double                                             HitTime;                                          		// 0x00002C (0x0008)              
};
//0x000010
//HitReactionBoneRemap[0x1DF2B3F8]
struct FHitReactionBoneRemap
{
	struct FName                                       BoneFrom;                                         		// 0x000000 (0x0008)              
	struct FName                                       BoneTo;                                           		// 0x000008 (0x0008)              
};
//0x000028
//CSAData[0x1DF2B390]
struct FCSAData
{
	class AActor*                                      pInteractiveActor;                                		// 0x000000 (0x0004)              
	float                                              fCSATotalDuration;                                		// 0x000004 (0x0004)              
	float                                              fCSATotalProgress;                                		// 0x000008 (0x0004)              
	int                                                nIPIndex;                                         		// 0x00000C (0x0004)              
	int                                                nAnimSeed;                                        		// 0x000010 (0x0004)              
	int                                                eAnimIndex;                                       		// 0x000014 (0x0004)              
	unsigned char                                      eCSA;                                             		// 0x000018 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      _0x000019[0x3];                                   		// 0x000019 (0x0003) MISSED OFFSET
	unsigned long                                      bCSAOutro : 1;                                    		// 0x00001C (0x0004) [0x00000001] 
	unsigned long                                      bSmallTargetVolume : 1;                           		// 0x00001C (0x0004) [0x00000002] 
	unsigned char                                      eInteractiveActorIATState;                        		// 0x000020 (0x0001)              PROPERTY: etCSA_IATState
	unsigned char                                      _0x000021[0x3];                                   		// 0x000021 (0x0003) MISSED OFFSET
	int                                                m_nCSAVFXSuccess_Initial;                         		// 0x000024 (0x0004)              
};
//0x000014
//CSAVFXData[0x1DF2B328]
struct FCSAVFXData
{
	unsigned char                                      eCSA;                                             		// 0x000000 (0x0001)              PROPERTY: etContextSensitiveActionBase
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	class UClass*                                      pVFXEventClass;                                   		// 0x000004 (0x0004)              
	int                                                eVFXEquipmentCSAAnimType;                         		// 0x000008 (0x0004)              
	class AActor*                                      pVFXInteractiveActor;                             		// 0x00000C (0x0004)              
	unsigned long                                      bPlayedCSAOutroVFX : 1;                           		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      bPlayedCSASuccessVFX : 1;                         		// 0x000010 (0x0004) [0x00000002] 
};
//0x000028
//VehicleUseData[0x1DF2B2C0]
struct FVehicleUseData
{
	int                                                m_nVehicleID;                                     		// 0x000000 (0x0004)              
	unsigned char                                      m_nUseID;                                         		// 0x000004 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	unsigned long                                      m_bInsideVehicle : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	unsigned char                                      m_SeatPosition;                                   		// 0x00000C (0x0001)              PROPERTY: etVehiclePositionIndex
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	unsigned long                                      m_bSwitchingToAdjacentSeat : 1;                   		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      m_bTeleportIn : 1;                                		// 0x000010 (0x0004) [0x00000002] 
	unsigned long                                      m_bOpenVehicleDoor : 1;                           		// 0x000010 (0x0004) [0x00000004] 
	unsigned long                                      m_bCloseVehicleDoor : 1;                          		// 0x000010 (0x0004) [0x00000008] 
	unsigned long                                      m_bGetInToVehicle : 1;                            		// 0x000010 (0x0004) [0x00000010] 
	unsigned long                                      m_bGetOutOfVehicle : 1;                           		// 0x000010 (0x0004) [0x00000020] 
	unsigned long                                      m_bBailOut : 1;                                   		// 0x000010 (0x0004) [0x00000040] 
	unsigned long                                      m_bRouteingToVAP : 1;                             		// 0x000010 (0x0004) [0x00000080] 
	unsigned long                                      m_bEnteringVCP : 1;                               		// 0x000010 (0x0004) [0x00000100] 
	unsigned long                                      m_bExitingVCP : 1;                                		// 0x000010 (0x0004) [0x00000200] 
	unsigned long                                      m_bExitingVCPDeath : 1;                           		// 0x000010 (0x0004) [0x00000400] 
	unsigned long                                      m_bDeath : 1;                                     		// 0x000010 (0x0004) [0x00000800] 
	unsigned long                                      m_bLeaningOut : 1;                                		// 0x000010 (0x0004) [0x00001000] 
	unsigned long                                      m_bEjectInitial : 1;                              		// 0x000010 (0x0004) [0x00002000] 
	unsigned long                                      m_bEjectLater : 1;                                		// 0x000010 (0x0004) [0x00004000] 
	unsigned long                                      m_bDoingDriverEjectFromPassengerSide : 1;         		// 0x000010 (0x0004) [0x00008000] 
	unsigned long                                      m_bCloseingDriverDoorFromInside : 1;              		// 0x000010 (0x0004) [0x00010000] 
	unsigned long                                      m_bCanDriveVehicle : 1;                           		// 0x000010 (0x0004) [0x00020000] 
	unsigned long                                      m_bEnforcer : 1;                                  		// 0x000010 (0x0004) [0x00040000] 
	int                                                m_nNPCTypeDriver;                                 		// 0x000014 (0x0004)              
	int                                                m_nDriverAssetIndex;                              		// 0x000018 (0x0004)              
	FVector3                                           m_LeaveVehiclePos;                                		// 0x00001C (0x000C)              
};
//0x000008
//AssistData[0x1DF2B258]
struct FAssistData
{
	int                                                Damage;                                           		// 0x000000 (0x0004)              
	unsigned long                                      bPrimaryHit : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bSecondaryHit : 1;                                		// 0x000004 (0x0004) [0x00000002] 
};
//0x000008
//StrafeFiring[0x1DF2B1F0]
struct FStrafeFiring
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	unsigned long                                      bStrafeFiring : 1;                                		// 0x000004 (0x0004) [0x00000001] 
};
//0x000028
//ItemAttachmentData[0x1DF2B188]
struct FItemAttachmentData
{
	int                                                m_eItemAttachmentVisual;                          		// 0x000000 (0x0004)              
	int                                                m_eEquipedInventoryItemType;                      		// 0x000004 (0x0004)              
	int                                                m_eAttachmentDamageState;                         		// 0x000008 (0x0004)              
	unsigned char                                      m_nSymbolMaterialIndex;                           		// 0x00000C (0x0001)              PROPERTY: 
	unsigned char                                      m_WeaponState;                                    		// 0x00000D (0x0001)              PROPERTY: etWeaponState
	unsigned char                                      _0x00000E[0x2];                                   		// 0x00000E (0x0002) MISSED OFFSET
	float                                              m_fReloadTime;                                    		// 0x000010 (0x0004)              
	float                                              m_fQuickReloadTime;                               		// 0x000014 (0x0004)              
	float                                              m_fEquipTime;                                     		// 0x000018 (0x0004)              
	float                                              m_fFireInterval;                                  		// 0x00001C (0x0004)              
	float                                              m_fProgress;                                      		// 0x000020 (0x0004)              
	unsigned long                                      m_bIsDamagable : 1;                               		// 0x000024 (0x0004) [0x00000001] 
	unsigned long                                      m_bIsActive : 1;                                  		// 0x000024 (0x0004) [0x00000002] 
	unsigned long                                      m_bUseMaterialData : 1;                           		// 0x000024 (0x0004) [0x00000004] 
};
//0x000008
//MissionTeamInfo[0x1DF2B120]
struct FMissionTeamInfo
{
	int                                                m_nMissionUID;                                    		// 0x000000 (0x0004)              
	int                                                m_nTeamID;                                        		// 0x000004 (0x0004)              
};
//0x00003C
//RecoilInfo[0x1DF2B0B8]
struct FRecoilInfo
{
	int                                                m_nCurrentX;                                      		// 0x000000 (0x0004)              
	int                                                m_nCurrentY;                                      		// 0x000004 (0x0004)              
	int                                                m_nFirstTargetX;                                  		// 0x000008 (0x0004)              
	int                                                m_nFirstTargetY;                                  		// 0x00000C (0x0004)              
	int                                                m_nFirstTime;                                     		// 0x000010 (0x0004)              
	int                                                m_nFirstExp;                                      		// 0x000014 (0x0004)              
	int                                                m_nEndTargetX;                                    		// 0x000018 (0x0004)              
	int                                                m_nEndTargetY;                                    		// 0x00001C (0x0004)              
	int                                                m_nEndTime;                                       		// 0x000020 (0x0004)              
	int                                                m_nEndExp;                                        		// 0x000024 (0x0004)              
	DWORD                                              m_WeaponRecoil;                                   		// 0x000028 (0x0004)              
	unsigned char                                      m_eCurrentPart;                                   		// 0x00002C (0x0001)              PROPERTY: etCurrentRecoilPart
	unsigned char                                      _0x00002D[0x3];                                   		// 0x00002D (0x0003) MISSED OFFSET
	float                                              m_fPitchMultiplier;                               		// 0x000030 (0x0004)              
	float                                              m_fYawNegativeMultiplier;                         		// 0x000034 (0x0004)              
	float                                              m_fYawPositiveMultiplier;                         		// 0x000038 (0x0004)              
};
//0x000008
//ModifierFXData[0x1DF2B050]
struct FModifierFXData
{
	int                                                m_ModifierItem;                                   		// 0x000000 (0x0004)              
	int                                                m_ReplicationIndex;                               		// 0x000004 (0x0004)              
};
//0x000010
//AnimationDescriptor[0x1DF2AFE8]
struct FAnimationDescriptor
{
	int                                                m_eAnimationDescriptor;                           		// 0x000000 (0x0004)              
	float                                              m_fStaminaDrain;                                  		// 0x000004 (0x0004)              
	unsigned char                                      m_eRCEType;                                       		// 0x000008 (0x0001)              PROPERTY: etRCEType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	unsigned long                                      m_bFreezeCameraLoc : 1;                           		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      m_bResetLocomotion : 1;                           		// 0x00000C (0x0004) [0x00000002] 
};
//0x000018
//tDecisionChild[0x1DF2AF80]
struct FtDecisionChild
{
	struct FEnumeratedName                             SDDRow;                                           		// 0x000000 (0x0010)              
	class UcAnimConfigureNode*                         ChildNode;                                        		// 0x000010 (0x0004)              
	int                                                m_nDrawY;                                         		// 0x000014 (0x0004)              
};
//0x000014
//tSelectEntry[0x1DF2AF18]
struct FtSelectEntry
{
	int                                                NodeIndex;                                        		// 0x000000 (0x0004)              
	struct FName                                       NodeName;                                         		// 0x000004 (0x0008)              
	struct FName                                       Setting;                                          		// 0x00000C (0x0008)              
};
//0x00003C
//tSelectIKEntry[0x1DF2AEB0]
struct FtSelectIKEntry
{
	int                                                SkelControlIndex;                                 		// 0x000000 (0x0004)              
	struct FName                                       SkelControlName;                                  		// 0x000004 (0x0008)              
	struct FtIKStrategySetting                         IKSetting;                                        		// 0x00000C (0x0018)              
	struct FtIKStrategySetting                         AimedIKSetting;                                   		// 0x000024 (0x0018)              
};
//0x000014
//tSelectConfigureEntry[0x1DF2AE48]
struct FtSelectConfigureEntry
{
	class UcAnimConfigureSelect*                       SelectNode;                                       		// 0x000000 (0x0004)              
	struct FName                                       NodeName;                                         		// 0x000004 (0x0008)              
	struct FName                                       Profile;                                          		// 0x00000C (0x0008)              
};
//0x00002C
//tSelectProfile[0x1DF2ADE0]
struct FtSelectProfile
{
	struct FName                                       ProfileName;                                      		// 0x000000 (0x0008)              
	TArray<struct FtSelectEntry>                       Select;                                           		// 0x000008 (0x000C)              
	TArray<struct FtSelectIKEntry>                     SelectIK;                                         		// 0x000014 (0x000C)              
	TArray<struct FtSelectConfigureEntry>              SelectConfigure;                                  		// 0x000020 (0x000C)              
};
//0x00000C
//tVignetteSequence[0x1DF2AD78]
struct FtVignetteSequence
{
	struct FName                                       m_sSequenceName;                                  		// 0x000000 (0x0008)              
	int                                                m_nRepetitions;                                   		// 0x000008 (0x0004)              
};
//0x000024
//ContactRotationAnim[0x1DF2AD10]
struct FContactRotationAnim
{
	struct FString                                     m_sLeftRotationAnim;                              		// 0x000000 (0x000C)              
	struct FString                                     m_sRightRotationAnim;                             		// 0x00000C (0x000C)              
	int                                                m_eContactRotationAnim;                           		// 0x000018 (0x0004)              
	int                                                m_nAngle;                                         		// 0x00001C (0x0004)              
	int                                                m_nAngleCutoff;                                   		// 0x000020 (0x0004)              
};
//0x000020
//tPerBoneProfile[0x1DF2ACA8]
struct FtPerBoneProfile
{
	struct FName                                       m_sProfileName;                                   		// 0x000000 (0x0008)              
	TArray<struct FName>                               m_asBranchStartBoneNames;                         		// 0x000008 (0x000C)              
	TArray<struct FName>                               m_asIndividualBoneNames;                          		// 0x000014 (0x000C)              
};
//0x000010
//tCombatAnimation[0x1DF2AC40]
struct FtCombatAnimation
{
	struct FName                                       m_sStandSequenceName;                             		// 0x000000 (0x0008)              
	struct FName                                       m_sCrouchSequenceName;                            		// 0x000008 (0x0008)              
};
//0x000038
//tCombatActionProfile[0x1DF2ABD8]
struct FtCombatActionProfile
{
	struct FName                                       m_sProfileName;                                   		// 0x000000 (0x0008)              
	struct FtCombatAnimation                           m_Fire;                                           		// 0x000008 (0x0010)              
	struct FtCombatAnimation                           m_PinPull;                                        		// 0x000018 (0x0010)              
	struct FtCombatAnimation                           m_Throw;                                          		// 0x000028 (0x0010)              
};
//0x000014
//tSelectSequenceOrProfile[0x1DF2AB70]
struct FtSelectSequenceOrProfile
{
	class UAnimNode*                                   m_AnimNode;                                       		// 0x000000 (0x0004)              
	struct FName                                       m_sNodeName;                                      		// 0x000004 (0x0008)              
	struct FName                                       m_sSequenceOrProfileName;                         		// 0x00000C (0x0008)              
};
//0x00003C
//tSelectIKStrategy[0x1DF2AB08]
struct FtSelectIKStrategy
{
	class UcAPBSkelControlLimbStrategy*                m_SkelControl;                                    		// 0x000000 (0x0004)              
	struct FName                                       m_sSkelControlName;                               		// 0x000004 (0x0008)              
	struct FtIKStrategySetting                         m_IKSetting;                                      		// 0x00000C (0x0018)              
	struct FtIKStrategySetting                         m_AimedIKSetting;                                 		// 0x000024 (0x0018)              
};
//0x000020
//tSelectSequencesProfile[0x1DF2AAA0]
struct FtSelectSequencesProfile
{
	struct FName                                       m_sProfileName;                                   		// 0x000000 (0x0008)              
	TArray<struct FtSelectSequenceOrProfile>           m_aSelectSequenceOrProfile;                       		// 0x000008 (0x000C)              
	TArray<struct FtSelectIKStrategy>                  m_aSelectIKStrategy;                              		// 0x000014 (0x000C)              
};
//0x00001C
//tUpperBodyActionWeaponAnimation[0x1DF2AA38]
struct FtUpperBodyActionWeaponAnimation
{
	unsigned char                                      m_eWeaponState;                                   		// 0x000000 (0x0001)              PROPERTY: etWeaponState
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       m_sStandSequenceName;                             		// 0x000004 (0x0008)              
	struct FName                                       m_sCrouchSequenceName;                            		// 0x00000C (0x0008)              
	float                                              m_fTransitionTime;                                		// 0x000014 (0x0004)              
	float                                              m_fTransitionTimeOut;                             		// 0x000018 (0x0004)              
};
//0x000014
//tUpperBodyActionProfile[0x1DF2A9D0]
struct FtUpperBodyActionProfile
{
	struct FName                                       m_sProfileName;                                   		// 0x000000 (0x0008)              
	TArray<struct FtUpperBodyActionWeaponAnimation>    m_aWeaponAnimations;                              		// 0x000008 (0x000C)              
};
//0x000020
//APBVehicleSeat[0x1DF2A968]
struct FAPBVehicleSeat
{
	class AcAPBPlayerController*                       Occupier;                                         		// 0x000000 (0x0004)              
	class AcAPBPawn*                                   OccupierPawn;                                     		// 0x000004 (0x0004)              
	struct FName                                       SeatSocket;                                       		// 0x000008 (0x0008)              
	unsigned char                                      eSeatUseState;                                    		// 0x000010 (0x0001)              PROPERTY: etSeatUseState
	unsigned char                                      _0x000011[0x3];                                   		// 0x000011 (0x0003) MISSED OFFSET
	struct FVehicleSeatCamera                          SeatCamera;                                       		// 0x000014 (0x000C)              
};
//0x000010
//APBVehicleDoor[0x1DF2A900]
struct FAPBVehicleDoor
{
	struct FName                                       CSADoorSocket;                                    		// 0x000000 (0x0008)              
	unsigned char                                      eDoorState;                                       		// 0x000008 (0x0001)              PROPERTY: etDoorState
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	unsigned long                                      bValid : 1;                                       		// 0x00000C (0x0004) [0x00000001] 
};
//0x00000C
//APBVehicleSocket[0x1DF2A898]
struct FAPBVehicleSocket
{
	struct FName                                       SocketName;                                       		// 0x000000 (0x0008)              
	unsigned long                                      bValid : 1;                                       		// 0x000008 (0x0004) [0x00000001] 
};
//0x00001C
//APBVehicleVCP[0x1DF2A830]
struct FAPBVehicleVCP
{
	struct FName                                       VCPSocket;                                        		// 0x000000 (0x0008)              
	float                                              VCPArcDistance;                                   		// 0x000008 (0x0004)              
	float                                              VCPYawDirection;                                  		// 0x00000C (0x0004)              
	float                                              LeanOutAnimTime;                                  		// 0x000010 (0x0004)              
	float                                              LeanInAnimTime;                                   		// 0x000014 (0x0004)              
	unsigned long                                      bValid : 1;                                       		// 0x000018 (0x0004) [0x00000001] 
};
//0x000010
//NPCDriverData[0x1DF2A7C8]
struct FNPCDriverData
{
	int                                                m_nNPCTypeDriver;                                 		// 0x000000 (0x0004)              
	int                                                m_nDriverAssetIndex;                              		// 0x000004 (0x0004)              
	unsigned long                                      m_bDriverPresent : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	int                                                m_nDriverDataID;                                  		// 0x00000C (0x0004)              
};
//0x000008
//cRoutePosition[0x1DF2A760]
struct FcRoutePosition
{
	unsigned char                                      m_nPackedLaneIndexSectionIndex;                   		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      m_nPackedLaneIndexSectionIndex;                   		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	float                                              m_fDistance;                                      		// 0x000004 (0x0004)              
};
//0x000018
//LaneCommand[0x1DF2A6F8]
struct FLaneCommand
{
	unsigned char                                      m_eState;                                         		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      m_eLaneCommandID;                                 		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	struct FcRoutePosition                             m_CurrentPosition;                                		// 0x000004 (0x0008)              
	struct FcRoutePosition                             m_TargetPosition;                                 		// 0x00000C (0x0008)              
	float                                              m_fChangeLaneDistance;                            		// 0x000014 (0x0004)              
};
//0x000004
//SReactionIDReplicated[0x1DF2A690]
struct FSReactionIDReplicated
{
	unsigned char                                      m_eReactionID;                                    		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      m_eWorldEventID;                                  		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      m_eIncrementorToForceReplication;                 		// 0x000002 (0x0001)              PROPERTY: 
	unsigned char                                      m_ePaddingUpToThirtyTwoBits;                      		// 0x000003 (0x0001)              PROPERTY: 
};
//0x000040
//SPedStateReplicated[0x1DF2A628]
struct FSPedStateReplicated
{
	class URWTechNode*                                 m_pStartNode;                                     		// 0x000000 (0x0004)              
	class URWTechNode*                                 m_pTargetSDNode;                                  		// 0x000004 (0x0004)              
	class URWTechNode*                                 m_pVignetteNode;                                  		// 0x000008 (0x0004)              
	FVector3                                           m_vInitialPosition;                               		// 0x00000C (0x000C)              
	int                                                m_nDTRouteIndex;                                  		// 0x000018 (0x0004)              
	float                                              m_fDistanceAlongDTSegment;                        		// 0x00001C (0x0004)              
	FVector3                                           m_vDirection;                                     		// 0x000020 (0x000C)              
	FVector3                                           m_vFirstDTRouteNodeOffset;                        		// 0x00002C (0x000C)              
	float                                              m_fTimeSinceVignetteStarted;                      		// 0x000038 (0x0004)              
	struct FSReactionIDReplicated                      m_ReactionID_Replicated;                          		// 0x00003C (0x0004)              
};
//0x000006
//TTIReactionData[0x1DF2A5C0]
struct FTTIReactionData
{
	float                                              fDuration;                                        		// 0x000000 (0x0004)              
	unsigned char                                      eCSAIndex;                                        		// 0x000004 (0x0001)              PROPERTY: 
	unsigned char                                      eTTIState;                                        		// 0x000005 (0x0001)              PROPERTY: etTTIState
};
//0x00000E
//TTIReactionInProgressData[0x1DF2A558]
struct FTTIReactionInProgressData
{
	float                                              fAnimTimeElapsed;                                 		// 0x000000 (0x0004)              
	struct FTTIReactionData                            TTIData;                                          		// 0x000004 (0x0008)              
	unsigned char                                      eTTIStage;                                        		// 0x00000C (0x0001)              PROPERTY: etTTIStage
	unsigned char                                      eAnimationIndex;                                  		// 0x00000D (0x0001)              PROPERTY: 
};
//0x00000B
//cAPBMultiLaneRouteSection[0x1DF2A4F0]
struct FcAPBMultiLaneRouteSection
{
	class URWTechReachSpec*                            m_aLaneEdges[0x2];                                		// 0x000000 (0x0008)              
	unsigned char                                      nNumLanes;                                        		// 0x000008 (0x0001)              PROPERTY: 
	unsigned char                                      nDefaultLane;                                     		// 0x000009 (0x0001)              PROPERTY: 
	unsigned char                                      eTurnType;                                        		// 0x00000A (0x0001)              PROPERTY: etTurnType
};
//0x00001C
//NPCVehicleSpeed[0x1DF2A488]
struct FNPCVehicleSpeed
{
	int                                                m_eNPCVehicleCategory;                            		// 0x000000 (0x0004)              
	float                                              m_fMaxAcceleration;                               		// 0x000004 (0x0004)              
	float                                              m_fMaxDeceleration;                               		// 0x000008 (0x0004)              
	float                                              m_fMaxTopSpeedRatio;                              		// 0x00000C (0x0004)              
	float                                              m_fMinAcceleration;                               		// 0x000010 (0x0004)              
	float                                              m_fMinDeceleration;                               		// 0x000014 (0x0004)              
	float                                              m_fMinTopSpeedRatio;                              		// 0x000018 (0x0004)              
};
//0x000034
//SymbolLayer[0x1DF2A420]
struct FSymbolLayer
{
	FVector2                                           m_MatRows[0x3];                                   		// 0x000000 (0x0018)              
	struct FLinearColor                                m_HSLColour;                                      		// 0x000018 (0x0010)              
	unsigned char                                      m_nMaterialIndex;                                 		// 0x000028 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000029[0x3];                                   		// 0x000029 (0x0003) MISSED OFFSET
	int                                                m_nPrimitive;                                     		// 0x00002C (0x0004)              
	int                                                m_nGuid;                                          		// 0x000030 (0x0004)              
};
//0x000014
//GolemMorphNodeWithWeight[0x1DF2A3B8]
struct FGolemMorphNodeWithWeight
{
	float                                              Weight;                                           		// 0x000000 (0x0004)              
	struct FString                                     NodeName;                                         		// 0x000004 (0x000C)              
	int                                                Uid;                                              		// 0x000010 (0x0004)              
};
//0x000018
//GolemMakeupInfo[0x1DF2A350]
struct FGolemMakeupInfo
{
	unsigned char                                      Shape;                                            		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              Strength;                                         		// 0x000004 (0x0004)              
	struct FLinearColor                                HSLColour;                                        		// 0x000008 (0x0010)              
};
//0x000008
//ScarsLayer[0x1DF2A2E8]
struct FScarsLayer
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      ScarsPatternIndex;                                		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	float                                              Strength;                                         		// 0x000004 (0x0004)              
};
//0x000008
//PredefinedTattooLayer[0x1DF2A280]
struct FPredefinedTattooLayer
{
	unsigned char                                      TattooIndex;                                      		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              Strength;                                         		// 0x000004 (0x0004)              
};
//0x00001C
//GolemPartExternalData[0x1DF2A218]
struct FGolemPartExternalData
{
	struct FString                                     sName;                                            		// 0x000000 (0x000C)              
	struct FString                                     sGolemPartName;                                   		// 0x00000C (0x000C)              
	unsigned long                                      bEnabled : 1;                                     		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      bLoaded : 1;                                      		// 0x000018 (0x0004) [0x00000002] 
};
//0x000030
//SegmentationDataLOD[0x1DF2A1B0]
struct FSegmentationDataLOD
{
	TArray<struct FString>                             aSegmentNames;                                    		// 0x000000 (0x000C)              
	TArray<int>                                        aSegmentMap;                                      		// 0x00000C (0x000C)              
	TArray<int>                                        aSegmentPerFace;                                  		// 0x000018 (0x000C)              
	TArray<int>                                        aChunkPerFace;                                    		// 0x000024 (0x000C)              
};
//0x000018
//GolemBaseTextureBlock[0x1DF2A148]
struct FGolemBaseTextureBlock
{
	int                                                nX;                                               		// 0x000000 (0x0004)              
	int                                                nY;                                               		// 0x000004 (0x0004)              
	float                                              fPriority;                                        		// 0x000008 (0x0004)              
	TArray<int>                                        aSegments;                                        		// 0x00000C (0x000C)              
};
//0x000008
//GolemBaseSkinTone[0x1DF2A0E0]
struct FGolemBaseSkinTone
{
	class UTexture2D*                                  ColourMap;                                        		// 0x000000 (0x0004)              
	float                                              Threshold;                                        		// 0x000004 (0x0004)              
};
//0x000008
//GolemBaseColourNormalMap[0x1DF2A078]
struct FGolemBaseColourNormalMap
{
	class UTexture2D*                                  ColourMap;                                        		// 0x000000 (0x0004)              
	class UTexture2D*                                  NormalMap;                                        		// 0x000004 (0x0004)              
};
//0x000018
//GolemScar[0x1DF2A010]
struct FGolemScar
{
	class UTexture2D*                                  OldColourMap;                                     		// 0x000000 (0x0004)              
	class UTexture2D*                                  NewColourMap;                                     		// 0x000004 (0x0004)              
	class UTexture2D*                                  NormalMap;                                        		// 0x000008 (0x0004)              
	struct FString                                     LocalisedNameTag;                                 		// 0x00000C (0x000C)              
};
//0x000024
//GolemBaseHairType[0x1DF29FA8]
struct FGolemBaseHairType
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	class UTexture2D*                                  BaseColourTexture;                                		// 0x00000C (0x0004)              
	class UTexture2D*                                  BaseNormalMapTexture;                             		// 0x000010 (0x0004)              
	class UTexture2D*                                  MeshColourTexture;                                		// 0x000014 (0x0004)              
	class UTexture2D*                                  MeshNormalMapTexture;                             		// 0x000018 (0x0004)              
	float                                              SpecularExponent1;                                		// 0x00001C (0x0004)              
	float                                              SpecularExponent2;                                		// 0x000020 (0x0004)              
};
//0x000050
//GolemBaseHairShape[0x1DF29F40]
struct FGolemBaseHairShape
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	class USkeletalMesh*                               SkeletalMesh;                                     		// 0x00000C (0x0004)              
	class UMorphTargetSet*                             BaseBodyMorph;                                    		// 0x000010 (0x0004)              
	TArray<struct FString>                             BodyMorphGroupsToDisable;                         		// 0x000014 (0x000C)              
	class UAnimTree*                                   AnimTree;                                         		// 0x000020 (0x0004)              
	TArray<class UAnimSet*>                            AnimSets;                                         		// 0x000024 (0x000C)              
	TArray<class UMorphTargetSet*>                     MorphSets;                                        		// 0x000030 (0x000C)              
	TArray<struct FGolemBaseHairType>                  Types;                                            		// 0x00003C (0x000C)              
	unsigned long                                      bDisabled : 1;                                    		// 0x000048 (0x0004) [0x00000001] 
	int                                                Guid;                                             		// 0x00004C (0x0004)              
};
//0x000040
//GolemProjectionArea[0x1DF29ED8]
struct FGolemProjectionArea
{
	unsigned char                                      nID;                                              		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     Name;                                             		// 0x000004 (0x000C)              
	class UTexture2D*                                  Mask;                                             		// 0x000010 (0x0004)              
	struct FString                                     Bone;                                             		// 0x000014 (0x000C)              
	float                                              fDefaultRadius;                                   		// 0x000020 (0x0004)              
	float                                              fDefaultHeight;                                   		// 0x000024 (0x0004)              
	FVector3                                           vBonePositionOffset;                              		// 0x000028 (0x000C)              
	FVector3                                           vBoneDirectionOffset;                             		// 0x000034 (0x000C)              
};
//0x000014
//GolemProjectionPose[0x1DF29E70]
struct FGolemProjectionPose
{
	struct FString                                     AnimSeqName;                                      		// 0x000000 (0x000C)              
	unsigned long                                      bStaticPose : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
	float                                              Time;                                             		// 0x000010 (0x0004)              
};
//0x000010
//GolemMakeUpData[0x1DF29E08]
struct FGolemMakeUpData
{
	unsigned long                                      bGrayscale : 1;                                   		// 0x000000 (0x0004) [0x00000001] 
	class UTexture2D*                                  pTexture;                                         		// 0x000004 (0x0004)              
	int                                                nUIPriority;                                      		// 0x000008 (0x0004)              
	int                                                nOriginalIndex;                                   		// 0x00000C (0x0004)              
};
//0x000014
//ConditionalMorph[0x1DF29DA0]
struct FConditionalMorph
{
	class UMorphTargetSet*                             MorphSet;                                         		// 0x000000 (0x0004)              
	class UTexture2D*                                  NormalMap;                                        		// 0x000004 (0x0004)              
	TArray<int>                                        ItemClasses;                                      		// 0x000008 (0x000C)              
};
//0x000008
//VertexMap[0x1DF29D38]
struct FVertexMap
{
	int                                                BaseIndex;                                        		// 0x000000 (0x0004)              
	int                                                ExtraIndex;                                       		// 0x000004 (0x0004)              
};
//0x00000C
//VerticesMapLOD[0x1DF29CD0]
struct FVerticesMapLOD
{
	TArray<struct FVertexMap>                          VerticesMap;                                      		// 0x000000 (0x000C)              
};
//0x000008
//OverlayTextures[0x1DF29C68]
struct FOverlayTextures
{
	class UTexture2D*                                  BaseMeshOverlayMap;                               		// 0x000000 (0x0004)              
	class UTexture2D*                                  ExtraMeshOverlayMap;                              		// 0x000004 (0x0004)              
};
//0x00001C
//BaseExtraTextures[0x1DF29C00]
struct FBaseExtraTextures
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	class UTexture2D*                                  BaseMeshColourMap;                                		// 0x00000C (0x0004)              
	class UTexture2D*                                  BaseMeshNormalMap;                                		// 0x000010 (0x0004)              
	class UTexture2D*                                  ExtraMeshColourMap;                               		// 0x000014 (0x0004)              
	class UTexture2D*                                  ExtraMeshNormalMap;                               		// 0x000018 (0x0004)              
};
//0x000030
//GolemBaseArea[0x1DF29B98]
struct FGolemBaseArea
{
	unsigned char                                      nID;                                              		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     Name;                                             		// 0x000004 (0x000C)              
	class UTexture2D*                                  BaseMeshMask;                                     		// 0x000010 (0x0004)              
	class UTexture2D*                                  ExtraMeshMask;                                    		// 0x000014 (0x0004)              
	unsigned long                                      CustomisableColour : 1;                           		// 0x000018 (0x0004) [0x00000001] 
	struct FLinearColor                                DefaultColour;                                    		// 0x00001C (0x0010)              
	unsigned long                                      AcceptProjection : 1;                             		// 0x00002C (0x0004) [0x00000001] 
};
//0x00000C
//GolemPartTextureBlock[0x1DF29B30]
struct FGolemPartTextureBlock
{
	int                                                nX;                                               		// 0x000000 (0x0004)              
	int                                                nY;                                               		// 0x000004 (0x0004)              
	float                                              fPriority;                                        		// 0x000008 (0x0004)              
};
//0x000018
//PartProjectionArea[0x1DF29AC8]
struct FPartProjectionArea
{
	unsigned char                                      nID;                                              		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     Name;                                             		// 0x000004 (0x000C)              
	float                                              fOverrideRadius;                                  		// 0x000010 (0x0004)              
	float                                              fOverrideHeight;                                  		// 0x000014 (0x0004)              
};
//0x000009
//PurchaseElementInfo[0x1DF29A60]
struct FPurchaseElementInfo
{
	int                                                nPrevArrayNum;                                    		// 0x000000 (0x0004)              
	int                                                nNewArrayNum;                                     		// 0x000004 (0x0004)              
	unsigned char                                      nPurchaseElement;                                 		// 0x000008 (0x0001)              PROPERTY: 
};
//0x000021
//VehicleDistricts[0x1DF299F8]
struct FVehicleDistricts
{
	struct FString                                     m_sHeightfield;                                   		// 0x000000 (0x000C)              
	float                                              m_fWorldOffsetX;                                  		// 0x00000C (0x0004)              
	float                                              m_fWorldOffsetY;                                  		// 0x000010 (0x0004)              
	float                                              m_fWorldOffsetZ;                                  		// 0x000014 (0x0004)              
	float                                              m_fWorldToTextureScaleXY;                         		// 0x000018 (0x0004)              
	float                                              m_fWorldToTextureScaleZ;                          		// 0x00001C (0x0004)              
	unsigned char                                      m_eVehicleDistricts;                              		// 0x000020 (0x0001)              PROPERTY: etVehicleDistricts
};
//0x000030
//GolemobileCommonData[0x1DF29990]
struct FGolemobileCommonData
{
	struct FLinearColor                                BasePaintColour;                                  		// 0x000000 (0x0010)              
	struct FLinearColor                                SecondPaintColour;                                		// 0x000010 (0x0010)              
	unsigned char                                      PaintType;                                        		// 0x000020 (0x0001)              PROPERTY: etPaintType
	unsigned char                                      _0x000021[0x3];                                   		// 0x000021 (0x0003) MISSED OFFSET
	TArray<int>                                        m_aLightPatternIndices;                           		// 0x000024 (0x000C)              
};
//0x000014
//PredefinedDecalLayer[0x1DF29928]
struct FPredefinedDecalLayer
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      Mode;                                             		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      DecalIndex;                                       		// 0x000002 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000003[0x1];                                   		// 0x000003 (0x0001) MISSED OFFSET
	struct FLinearColor                                VinylHSLColour;                                   		// 0x000004 (0x0010)              
};
//0x000009
//TESProjectionInfo[0x1DF298C0]
struct FTESProjectionInfo
{
	float                                              m_fMaxValueAtPremiumLevel[0x2];                   		// 0x000000 (0x0008)              
	unsigned char                                      m_eTESProjectionInfo;                             		// 0x000008 (0x0001)              PROPERTY: etTESProjectionInfo
};
//0x000024
//VehicleDamageHandlingEffect[0x1DF29858]
struct FVehicleDamageHandlingEffect
{
	int                                                m_eVehicleDamageHandlingEffect;                   		// 0x000000 (0x0004)              
	float                                              m_fBrakeEffectiveness;                            		// 0x000004 (0x0004)              
	float                                              m_fEngineTorqueScale;                             		// 0x000008 (0x0004)              
	float                                              m_fFrontLatGrip;                                  		// 0x00000C (0x0004)              
	float                                              m_fFrontLongGrip;                                 		// 0x000010 (0x0004)              
	float                                              m_fMaxSpeedScale;                                 		// 0x000014 (0x0004)              
	float                                              m_fRearLatGrip;                                   		// 0x000018 (0x0004)              
	float                                              m_fRearLongGrip;                                  		// 0x00001C (0x0004)              
	float                                              m_fSteeringSpeed;                                 		// 0x000020 (0x0004)              
};
//0x000030
//tVisualDamageAmounts[0x1DF297F0]
struct FtVisualDamageAmounts
{
	float                                              fDamage_FrontLeft;                                		// 0x000000 (0x0004)              
	float                                              fDamage_FrontRight;                               		// 0x000004 (0x0004)              
	float                                              fDamage_RearLeft;                                 		// 0x000008 (0x0004)              
	float                                              fDamage_RearRight;                                		// 0x00000C (0x0004)              
	float                                              fDamage_SideLeft;                                 		// 0x000010 (0x0004)              
	float                                              fDamage_SideRight;                                		// 0x000014 (0x0004)              
	float                                              fDamage_Top;                                      		// 0x000018 (0x0004)              
	float                                              fExtreme_Front;                                   		// 0x00001C (0x0004)              
	float                                              fExtreme_Rear;                                    		// 0x000020 (0x0004)              
	float                                              fExtreme_SideLeft;                                		// 0x000024 (0x0004)              
	float                                              fExtreme_SideRight;                               		// 0x000028 (0x0004)              
	float                                              fExtreme_Top;                                     		// 0x00002C (0x0004)              
};
//0x000054
//tRepairSession[0x1DF29788]
struct FtRepairSession
{
	class AcAPBVehicleBase*                            m_pVehicle;                                       		// 0x000000 (0x0004)              
	float                                              m_SecondsSinceLastManualRepair;                   		// 0x000004 (0x0004)              
	float                                              m_TimeSinceLastUpdate;                            		// 0x000008 (0x0004)              
	class UiVehicleRepairer*                           m_AutomatedRepairer;                              		// 0x00000C (0x0004)              
	unsigned char                                      _0x000010[0x4];                                   		// 0x000010 (0x0004) ALIGNEMENT
	struct FtVisualDamageAmounts                       m_ReferenceVisualDamage;                          		// 0x000014 (0x0030)              
	int                                                m_nReferenceHealth;                               		// 0x000044 (0x0004)              
	int                                                m_nInitialDamageAmount;                           		// 0x000048 (0x0004)              
	int                                                m_nDamageRepairedThisFrame;                       		// 0x00004C (0x0004)              
	int                                                m_nDamageTakenThisFrame;                          		// 0x000050 (0x0004)              
};
//0x00002C
//PositionAndOrientationInfo[0x1DF29720]
struct FPositionAndOrientationInfo
{
	float                                              RearAxleX;                                        		// 0x000000 (0x0004)              
	float                                              RearAxleY;                                        		// 0x000004 (0x0004)              
	float                                              RearAxleZ;                                        		// 0x000008 (0x0004)              
	struct Fuint                                       Packed_nRouteLUTIndex_DetourRouteLUTIndex;        		// 0x00000C (0x0004)              
	struct Fuint                                       Packed_nDetourRouteLUTIndex_1;                    		// 0x000010 (0x0004)              
	struct FLaneCommand                                LaneInfo;                                         		// 0x000014 (0x0018)              
};
//0x00003C
//SpeedInfo[0x1DF296B8]
struct FSpeedInfo
{
	unsigned char                                      eSpeedState;                                      		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      eSpeedCommandID;                                  		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	float                                              fAcceleration;                                    		// 0x000004 (0x0004)              
	float                                              fTargetSpeed;                                     		// 0x000008 (0x0004)              
	float                                              fSpeed;                                           		// 0x00000C (0x0004)              
	struct FPositionAndOrientationInfo                 PositionInfo;                                     		// 0x000010 (0x002C)              
};
//0x000009
//APBVehicleStateFSM[0x1DF29650]
struct FAPBVehicleStateFSM
{
	struct FName                                       sActorState;                                      		// 0x000000 (0x0008)              
	unsigned char                                      ePseudoKinCompState;                              		// 0x000008 (0x0001)              PROPERTY: EPKCState
};
//0x000020
//VehicleMusicPlaybackInfo[0x1DF295E8]
struct FVehicleMusicPlaybackInfo
{
	int                                                m_nOwnerCharacterUID;                             		// 0x000000 (0x0004)              
	unsigned long                                      m_bMp3Playing : 1;                                		// 0x000004 (0x0004) [0x00000001] 
	struct FGuid                                       m_MusicStudioSongGuid;                            		// 0x000008 (0x0010)              
	int                                                m_nInitialPlaybackServerTime;                     		// 0x000018 (0x0004)              
	int                                                m_nEventIndex;                                    		// 0x00001C (0x0004)              
};
//0x000030
//VehicleMusicNameInfo[0x1DF29580]
struct FVehicleMusicNameInfo
{
	struct FString                                     m_sTrackName;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sArtistName;                                    		// 0x00000C (0x000C)              
	struct FString                                     m_sAlbumName;                                     		// 0x000018 (0x000C)              
	struct FString                                     m_sGenre;                                         		// 0x000024 (0x000C)              
};
//0x000091
//ModifiedVehicleSetupType[0x1DF29518]
struct FModifiedVehicleSetupType
{
	float                                              m_fBreakInCSADuration;                            		// 0x000000 (0x0004)              
	float                                              m_fFrontWheelMeshOffsetHeight;                    		// 0x000004 (0x0004)              
	float                                              m_fRearWheelMeshOffsetHeight;                     		// 0x000008 (0x0004)              
	float                                              m_fFrontWheelBoneOffsetHeight;                    		// 0x00000C (0x0004)              
	float                                              m_fRearWheelBoneOffsetHeight;                     		// 0x000010 (0x0004)              
	float                                              m_fFrontLongFactor;                               		// 0x000014 (0x0004)              
	float                                              m_fRearLongFactor;                                		// 0x000018 (0x0004)              
	float                                              m_fFrontLatFactor;                                		// 0x00001C (0x0004)              
	float                                              m_fRearLatFactor;                                 		// 0x000020 (0x0004)              
	int                                                m_nMainCargoPipCapacity;                          		// 0x000024 (0x0004)              
	float                                              m_fRearHandbrakeLong;                             		// 0x000028 (0x0004)              
	float                                              m_fRearHandbrakeLat;                              		// 0x00002C (0x0004)              
	float                                              m_fFinalDriveRatio;                               		// 0x000030 (0x0004)              
	float                                              m_f500RpmTorque;                                  		// 0x000034 (0x0004)              
	float                                              m_f2500RpmTorque;                                 		// 0x000038 (0x0004)              
	float                                              m_f4500RpmTorque;                                 		// 0x00003C (0x0004)              
	float                                              m_f7000RpmTorque;                                 		// 0x000040 (0x0004)              
	float                                              m_fSuspensionDamping;                             		// 0x000044 (0x0004)              
	float                                              m_fSuspensionStiffness;                           		// 0x000048 (0x0004)              
	float                                              m_fChassisTorqueFactor;                           		// 0x00004C (0x0004)              
	float                                              m_fEngineBrakingFactor;                           		// 0x000050 (0x0004)              
	float                                              m_fMaxBrakeTorque;                                		// 0x000054 (0x0004)              
	float                                              m_fReverseThrottle;                               		// 0x000058 (0x0004)              
	float                                              m_fSteerSpeed;                                    		// 0x00005C (0x0004)              
	float                                              m_f0msSteerAngle;                                 		// 0x000060 (0x0004)              
	float                                              m_f12msSteerAngle;                                		// 0x000064 (0x0004)              
	float                                              m_f22msSteerAngle;                                		// 0x000068 (0x0004)              
	float                                              m_fCOMOffsetX;                                    		// 0x00006C (0x0004)              
	float                                              m_fCOMOffsetZ;                                    		// 0x000070 (0x0004)              
	float                                              m_fCollisionDamage;                               		// 0x000074 (0x0004)              
	float                                              m_fMaxDust;                                       		// 0x000078 (0x0004)              
	float                                              m_fMaxDirt;                                       		// 0x00007C (0x0004)              
	float                                              m_fMaxReverseSpeed;                               		// 0x000080 (0x0004)              
	float                                              m_fMaxSpeed;                                      		// 0x000084 (0x0004)              
	int                                                m_nMaxHealth;                                     		// 0x000088 (0x0004)              
	float                                              m_fMaxRepairTimeSecs;                             		// 0x00008C (0x0004)              
	unsigned char                                      m_eDriveType;                                     		// 0x000090 (0x0001)              PROPERTY: etVehicleDriveType
};
//0x000004
//VehicleSetupTypeSettings[0x1DF294B0]
struct FVehicleSetupTypeSettings
{
	unsigned char                                      eVehicleSetupType;                                		// 0x000000 (0x0001)              PROPERTY: etVehicleSetupType
	unsigned char                                      eReplicationIndex;                                		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      paddingToReachMinStructSize;                      		// 0x000002 (0x0001)              PROPERTY: 
	unsigned char                                      paddingToReachMinStructSize;                      		// 0x000003 (0x0001)              PROPERTY: 
};
//0x000099
//ModifiableVehicleSetupTypeSettings[0x1DF29448]
struct FModifiableVehicleSetupTypeSettings
{
	struct FModifiedVehicleSetupType                   Data;                                             		// 0x000000 (0x0094)              
	struct FVehicleSetupTypeSettings                   Settings;                                         		// 0x000094 (0x0004)              
	unsigned char                                      eReplicationIndex;                                		// 0x000098 (0x0001)              PROPERTY: 
};
//0x00003C
//VehicleStateDelta[0x1DF293E0]
struct FVehicleStateDelta
{
	double                                             fTimeStamp;                                       		// 0x000000 (0x0008)              
	float                                              fTimeDelta;                                       		// 0x000008 (0x0004)              
	FVector3                                           vPosDelta;                                        		// 0x00000C (0x000C)              
	FRotator                                           tRotDelta;                                        		// 0x000018 (0x000C)              
	FVector3                                           vLinVelDelta;                                     		// 0x000024 (0x000C)              
	FVector3                                           vAngVelDelta;                                     		// 0x000030 (0x000C)              
};
//0x000038
//VehicleStateInfo[0x1DF29378]
struct FVehicleStateInfo
{
	double                                             fTimeStamp;                                       		// 0x000000 (0x0008)              
	FVector3                                           vPos;                                             		// 0x000008 (0x000C)              
	FRotator                                           tRot;                                             		// 0x000014 (0x000C)              
	FVector3                                           vLinVel;                                          		// 0x000020 (0x000C)              
	FVector3                                           vAngVel;                                          		// 0x00002C (0x000C)              
};
//0x000014
//tDoor[0x1DF29310]
struct FtDoor
{
	unsigned char                                      m_eVehiclePositionIndex;                          		// 0x000000 (0x0001)              PROPERTY: etVehiclePositionIndex
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       m_sBoneName;                                      		// 0x000004 (0x0008)              
	unsigned char                                      m_eDoorState;                                     		// 0x00000C (0x0001)              PROPERTY: etDoorState
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	unsigned long                                      m_bPlayingDoorAnimation : 1;                      		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      m_bDoorGotToFullyOpen : 1;                        		// 0x000010 (0x0004) [0x00000002] 
};
//0x000004
//CameraShakePresetExported[0x1DF292A8]
struct FCameraShakePresetExported
{
	int                                                m_eCameraShakePreset;                             		// 0x000000 (0x0004)              
};
//0x00003C
//HandyCamSetUpData[0x1DF29240]
struct FHandyCamSetUpData
{
	FRotator                                           m_RotMaximumDeviation;                            		// 0x000000 (0x000C)              
	float                                              m_fInterpToSpeedMin;                              		// 0x00000C (0x0004)              
	float                                              m_fInterpToSpeedMax;                              		// 0x000010 (0x0004)              
	float                                              m_fMovementSpeedMin;                              		// 0x000014 (0x0004)              
	float                                              m_fMovementSpeedMax;                              		// 0x000018 (0x0004)              
	float                                              m_fChangeInMovementSpeedPerSec;                   		// 0x00001C (0x0004)              
	float                                              m_fDelayMin;                                      		// 0x000020 (0x0004)              
	float                                              m_fDelayMax;                                      		// 0x000024 (0x0004)              
	float                                              m_fDuration;                                      		// 0x000028 (0x0004)              
	unsigned long                                      m_bAllowActivation : 1;                           		// 0x00002C (0x0004) [0x00000001] 
	int                                                m_nIDIterpolateTo;                                		// 0x000030 (0x0004)              
	float                                              m_fInterpToDelay;                                 		// 0x000034 (0x0004)              
	int                                                m_nID;                                            		// 0x000038 (0x0004)              
};
//0x00007C
//HandyCamStruct[0x1DF291D8]
struct FHandyCamStruct
{
	int                                                m_nHandyCamSetUpDataID;                           		// 0x000000 (0x0004)              
	struct FHandyCamSetUpData                          m_HandyCamInterpolatedData;                       		// 0x000004 (0x003C)              
	FRotator                                           m_TargetRotationOffset;                           		// 0x000040 (0x000C)              
	FRotator                                           m_MovingRotationOffset;                           		// 0x00004C (0x000C)              
	float                                              m_fCurrentMovementSpeed;                          		// 0x000058 (0x0004)              
	FRotator                                           m_InterpToRotationOffset;                         		// 0x00005C (0x000C)              
	float                                              m_fCurrentInterpToRotationSpeed;                  		// 0x000068 (0x0004)              
	float                                              m_fNextDelay;                                     		// 0x00006C (0x0004)              
	float                                              m_fCurrentDelay;                                  		// 0x000070 (0x0004)              
	float                                              m_fDurationActive;                                		// 0x000074 (0x0004)              
	unsigned long                                      m_bCurrentlyActive : 1;                           		// 0x000078 (0x0004) [0x00000001] 
};
//0x000004
//ShakeParams[0x1DF29170]
struct FShakeParams
{
	unsigned char                                      X;                                                		// 0x000000 (0x0001)              PROPERTY: EShakeParam
	unsigned char                                      Y;                                                		// 0x000001 (0x0001)              PROPERTY: EShakeParam
	unsigned char                                      Z;                                                		// 0x000002 (0x0001)              PROPERTY: EShakeParam
	unsigned char                                      Padding;                                          		// 0x000003 (0x0001)              PROPERTY: 
};
//0x000070
//ScreenShakeStruct[0x1DF29108]
struct FScreenShakeStruct
{
	float                                              TimeToGo;                                         		// 0x000000 (0x0004)              
	float                                              TimeDuration;                                     		// 0x000004 (0x0004)              
	FVector3                                           RotAmplitude;                                     		// 0x000008 (0x000C)              
	FVector3                                           RotFrequency;                                     		// 0x000014 (0x000C)              
	FVector3                                           RotSinOffset;                                     		// 0x000020 (0x000C)              
	struct FShakeParams                                RotParam;                                         		// 0x00002C (0x0004)              
	FVector3                                           LocAmplitude;                                     		// 0x000030 (0x000C)              
	FVector3                                           LocFrequency;                                     		// 0x00003C (0x000C)              
	FVector3                                           LocSinOffset;                                     		// 0x000048 (0x000C)              
	struct FShakeParams                                LocParam;                                         		// 0x000054 (0x0004)              
	float                                              FOVAmplitude;                                     		// 0x000058 (0x0004)              
	float                                              FOVFrequency;                                     		// 0x00005C (0x0004)              
	float                                              FOVSinOffset;                                     		// 0x000060 (0x0004)              
	unsigned char                                      FOVParam;                                         		// 0x000064 (0x0001)              PROPERTY: EShakeParam
	unsigned char                                      _0x000065[0x3];                                   		// 0x000065 (0x0003) MISSED OFFSET
	int                                                ShakeID;                                          		// 0x000068 (0x0004)              
	unsigned long                                      bPlayContinuously : 1;                            		// 0x00006C (0x0004) [0x00000001] 
};
//0x000005
//CameraConstant[0x1DF290A0]
struct FCameraConstant
{
	float                                              m_fValue;                                         		// 0x000000 (0x0004)              
	unsigned char                                      m_eCameraConstant;                                		// 0x000004 (0x0001)              PROPERTY: etCameraConstant
};
//0x00000D
//APBViewportType[0x1DF29038]
struct FAPBViewportType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	unsigned char                                      m_eAPBViewportType;                               		// 0x00000C (0x0001)              PROPERTY: etAPBViewportType
};
//0x000044
//CameraShakePreset[0x1DF28FD0]
struct FCameraShakePreset
{
	int                                                m_eCameraShakePreset;                             		// 0x000000 (0x0004)              
	float                                              m_fDuration;                                      		// 0x000004 (0x0004)              
	float                                              m_fFOVAmplitude;                                  		// 0x000008 (0x0004)              
	float                                              m_fFOVFrequency;                                  		// 0x00000C (0x0004)              
	float                                              m_fLocationAmplitudeX;                            		// 0x000010 (0x0004)              
	float                                              m_fLocationAmplitudeY;                            		// 0x000014 (0x0004)              
	float                                              m_fLocationAmplitudeZ;                            		// 0x000018 (0x0004)              
	float                                              m_fLocationFrequencyX;                            		// 0x00001C (0x0004)              
	float                                              m_fLocationFrequencyY;                            		// 0x000020 (0x0004)              
	float                                              m_fLocationFrequencyZ;                            		// 0x000024 (0x0004)              
	float                                              m_fRotationAmplitudeX;                            		// 0x000028 (0x0004)              
	float                                              m_fRotationAmplitudeY;                            		// 0x00002C (0x0004)              
	float                                              m_fRotationAmplitudeZ;                            		// 0x000030 (0x0004)              
	float                                              m_fRotationFrequencyX;                            		// 0x000034 (0x0004)              
	float                                              m_fRotationFrequencyY;                            		// 0x000038 (0x0004)              
	float                                              m_fRotationFrequencyZ;                            		// 0x00003C (0x0004)              
	unsigned long                                      m_bRandomStartingFOV : 1;                         		// 0x000040 (0x0004) [0x00000001] 
	unsigned long                                      m_bRandomStartingLocationX : 1;                   		// 0x000040 (0x0004) [0x00000002] 
	unsigned long                                      m_bRandomStartingLocationY : 1;                   		// 0x000040 (0x0004) [0x00000004] 
	unsigned long                                      m_bRandomStartingLocationZ : 1;                   		// 0x000040 (0x0004) [0x00000008] 
	unsigned long                                      m_bRandomStartingRotationX : 1;                   		// 0x000040 (0x0004) [0x00000010] 
	unsigned long                                      m_bRandomStartingRotationY : 1;                   		// 0x000040 (0x0004) [0x00000020] 
	unsigned long                                      m_bRandomStartingRotationZ : 1;                   		// 0x000040 (0x0004) [0x00000040] 
};
//0x00003C
//CameraHandyCamPreset[0x1DF28F68]
struct FCameraHandyCamPreset
{
	int                                                m_eCameraHandyCamPreset;                          		// 0x000000 (0x0004)              
	int                                                m_eInterpolateTo;                                 		// 0x000004 (0x0004)              
	float                                              m_fChangeInMovementSpeed;                         		// 0x000008 (0x0004)              
	float                                              m_fDelayMax;                                      		// 0x00000C (0x0004)              
	float                                              m_fDelayMin;                                      		// 0x000010 (0x0004)              
	float                                              m_fDuration;                                      		// 0x000014 (0x0004)              
	float                                              m_fInterpolationSpeedMax;                         		// 0x000018 (0x0004)              
	float                                              m_fInterpolationSpeedMin;                         		// 0x00001C (0x0004)              
	float                                              m_fInterpToDelay;                                 		// 0x000020 (0x0004)              
	float                                              m_fMovementSpeedMax;                              		// 0x000024 (0x0004)              
	float                                              m_fMovementSpeedMin;                              		// 0x000028 (0x0004)              
	int                                                m_nMaxDeviationPitch;                             		// 0x00002C (0x0004)              
	int                                                m_nMaxDeviationRoll;                              		// 0x000030 (0x0004)              
	int                                                m_nMaxDeviationYaw;                               		// 0x000034 (0x0004)              
	unsigned long                                      m_bAllowActivation : 1;                           		// 0x000038 (0x0004) [0x00000001] 
};
//0x000004
//CameraHandyCamPresetExported[0x1DF28F00]
struct FCameraHandyCamPresetExported
{
	int                                                m_eCameraHandyCamPreset;                          		// 0x000000 (0x0004)              
};
//0x000014
//APBViewAdjustmentData[0x1DF28E98]
struct FAPBViewAdjustmentData
{
	float                                              m_fBackAdjust;                                    		// 0x000000 (0x0004)              
	float                                              m_fHeightAdjust;                                  		// 0x000004 (0x0004)              
	float                                              m_fRightAdjust;                                   		// 0x000008 (0x0004)              
	float                                              m_fRightAdjustPitchScalar;                        		// 0x00000C (0x0004)              
	float                                              m_fRoll;                                          		// 0x000010 (0x0004)              
};
//0x000020
//PenetrationAvoidanceFeeler[0x1DF28E30]
struct FPenetrationAvoidanceFeeler
{
	FRotator                                           AdjustmentRot;                                    		// 0x000000 (0x000C)              
	float                                              WorldWeight;                                      		// 0x00000C (0x0004)              
	float                                              PawnWeight;                                       		// 0x000010 (0x0004)              
	FVector3                                           Extent;                                           		// 0x000014 (0x000C)              
};
//0x0000B0
//sTargetTypeSettings[0x1DF28DC8]
struct FsTargetTypeSettings
{
	struct FAPBViewAdjustmentData                      m_APBPrimaryViewAdjustmentsCloseIn[0x2];          		// 0x000000 (0x0028)              
	struct FAPBViewAdjustmentData                      m_APBPrimaryViewAdjustmentsFarOut[0x2];           		// 0x000028 (0x0028)              
	struct FAPBViewAdjustmentData                      m_APBSecondaryViewAdjustmentsCloseIn[0x2];        		// 0x000050 (0x0028)              
	struct FAPBViewAdjustmentData                      m_APBSecondaryViewAdjustmentsFarOut[0x2];         		// 0x000078 (0x0028)              
	unsigned char                                      m_eCurrentCameraPosition;                         		// 0x0000A0 (0x0001)              PROPERTY: etCameraPosition
	unsigned char                                      _0x0000A1[0x3];                                   		// 0x0000A1 (0x0003) MISSED OFFSET
	float                                              m_fViewScalar;                                    		// 0x0000A4 (0x0004)              
	float                                              m_fViewScalarUserDefined;                         		// 0x0000A8 (0x0004)              
	float                                              m_fZoomSpeedPerSec;                               		// 0x0000AC (0x0004)              
};
//0x00007C
//CCameraMode[0x1DF28D60]
struct FCCameraMode
{
	float                                              m_f16_9BackAdjust;                                		// 0x000000 (0x0004)              
	float                                              m_f16_9CrouchBackAdjust;                          		// 0x000004 (0x0004)              
	float                                              m_f16_9CrouchHeightAdjust;                        		// 0x000008 (0x0004)              
	float                                              m_f16_9CrouchRightAdjust;                         		// 0x00000C (0x0004)              
	float                                              m_f16_9CrouchRightAdjustPitchScalar;              		// 0x000010 (0x0004)              
	float                                              m_f16_9FOV;                                       		// 0x000014 (0x0004)              
	float                                              m_f16_9HeightAdjust;                              		// 0x000018 (0x0004)              
	float                                              m_f16_9RightAdjust;                               		// 0x00001C (0x0004)              
	float                                              m_f16_9RightAdjustPitchScalar;                    		// 0x000020 (0x0004)              
	float                                              m_f4_3BackAdjust;                                 		// 0x000024 (0x0004)              
	float                                              m_f4_3CrouchBackAdjust;                           		// 0x000028 (0x0004)              
	float                                              m_f4_3CrouchHeightAdjust;                         		// 0x00002C (0x0004)              
	float                                              m_f4_3CrouchRightAdjust;                          		// 0x000030 (0x0004)              
	float                                              m_f4_3CrouchRightAdjustPitchScalar;               		// 0x000034 (0x0004)              
	float                                              m_f4_3FOV;                                        		// 0x000038 (0x0004)              
	float                                              m_f4_3HeightAdjust;                               		// 0x00003C (0x0004)              
	float                                              m_f4_3RightAdjust;                                		// 0x000040 (0x0004)              
	float                                              m_f4_3RightAdjustPitchScalar;                     		// 0x000044 (0x0004)              
	float                                              m_fAdjustBlendSpeed;                              		// 0x000048 (0x0004)              
	float                                              m_fCameraOriginLagSpeed;                          		// 0x00004C (0x0004)              
	float                                              m_fCameraRollBlendSpeed;                          		// 0x000050 (0x0004)              
	float                                              m_fCameraRollDegrees;                             		// 0x000054 (0x0004)              
	float                                              m_fCrouchSafeLocX;                                		// 0x000058 (0x0004)              
	float                                              m_fCrouchSafeLocY;                                		// 0x00005C (0x0004)              
	float                                              m_fCrouchSafeLocZ;                                		// 0x000060 (0x0004)              
	float                                              m_fFOVBlendSpeed;                                 		// 0x000064 (0x0004)              
	float                                              m_fSafeLocX;                                      		// 0x000068 (0x0004)              
	float                                              m_fSafeLocY;                                      		// 0x00006C (0x0004)              
	float                                              m_fSafeLocZ;                                      		// 0x000070 (0x0004)              
	unsigned char                                      m_eCameraMode;                                    		// 0x000074 (0x0001)              PROPERTY: etCCameraMode
	unsigned char                                      _0x000075[0x3];                                   		// 0x000075 (0x0003) MISSED OFFSET
	unsigned long                                      m_bCanDoLookBehindCam : 1;                        		// 0x000078 (0x0004) [0x00000001] 
	unsigned long                                      m_bCrouchEnabled : 1;                             		// 0x000078 (0x0004) [0x00000002] 
	unsigned long                                      m_bUseDefaultCameraAdjustments : 1;               		// 0x000078 (0x0004) [0x00000004] 
};
//0x00000C
//tViewConeParams[0x1DF28CF8]
struct FtViewConeParams
{
	float                                              nConstViewResetZoneAngle;                         		// 0x000000 (0x0004)              
	float                                              fConstViewResetWaitTime;                          		// 0x000004 (0x0004)              
	float                                              fConstViewResetSpeed;                             		// 0x000008 (0x0004)              
};
//0x000008
//tLookBehindParams[0x1DF28C90]
struct FtLookBehindParams
{
	float                                              fConstViewLookbehindWaitTime;                     		// 0x000000 (0x0004)              
	float                                              fConstReversingMinVel;                            		// 0x000004 (0x0004)              
};
//0x000008
//tAutoRollParams[0x1DF28C28]
struct FtAutoRollParams
{
	float                                              fConstRollMultiplier;                             		// 0x000000 (0x0004)              
	float                                              fConstRollMaximum;                                		// 0x000004 (0x0004)              
};
//0x000008
//tLookBehindState[0x1DF28BC0]
struct FtLookBehindState
{
	unsigned long                                      bDoingLookbehind : 1;                             		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bWasDoingLookbehind : 1;                          		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bDoingAutoLookbehind : 1;                         		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      bWasDoingAutoLookbehind : 1;                      		// 0x000000 (0x0004) [0x00000008] 
	float                                              fCurrentReverseTime;                              		// 0x000004 (0x0004)              
};
//0x000018
//tAutoRollState[0x1DF28B58]
struct FtAutoRollState
{
	FRotator                                           PrevCamRotatorValue;                              		// 0x000000 (0x000C)              
	float                                              fLastCameraYawAngle;                              		// 0x00000C (0x0004)              
	float                                              fTargetCameraRoll;                                		// 0x000010 (0x0004)              
	float                                              fLastCameraRoll;                                  		// 0x000014 (0x0004)              
};
//0x000014
//tDistrictMapState[0x1DF28AF0]
struct FtDistrictMapState
{
	float                                              fDistrictMapVisibleTime;                          		// 0x000000 (0x0004)              
	unsigned long                                      bAutoResetOverride : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	FRotator                                           PrevCamRotationValue;                             		// 0x000008 (0x000C)              
};
//0x00000C
//STickTimesReplicated[0x1DF28A88]
struct FSTickTimesReplicated
{
	float                                              m_fClampedTickTime;                               		// 0x000000 (0x0004)              
	float                                              m_fActualTickTime;                                		// 0x000004 (0x0004)              
	int                                                m_nIncrementorToForceReplication;                 		// 0x000008 (0x0004)              
};
//0x000018
//ChaosScoreboardPlayer[0x1DF28A20]
struct FChaosScoreboardPlayer
{
	struct FString                                     m_PlayerName;                                     		// 0x000000 (0x000C)              
	int                                                m_nCharacterUID;                                  		// 0x00000C (0x0004)              
	unsigned char                                      m_eFaction;                                       		// 0x000010 (0x0001)              PROPERTY: 
	unsigned char                                      m_nPlayerUpdateIndex;                             		// 0x000011 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000012[0x2];                                   		// 0x000012 (0x0002) MISSED OFFSET
	unsigned long                                      m_bSlotAllocated : 1;                             		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bIsFreeRider : 1;                               		// 0x000014 (0x0004) [0x00000002] 
};
//0x000024
//ChaosScoreboardData[0x1DF289B8]
struct FChaosScoreboardData
{
	unsigned char                                      m_PackedData[0x1D];                               		// 0x000000 (0x001D)              PROPERTY: 
	unsigned char                                      m_nPlayerUpdateIndex;                             		// 0x00001D (0x0001)              PROPERTY: 
	unsigned char                                      _0x00001E[0x2];                                   		// 0x00001E (0x0002) MISSED OFFSET
	int                                                m_nCurrentTimeAlive;                              		// 0x000020 (0x0004)              
};
//0x000008
//GrenadeBounceInfo[0x1DF28950]
struct FGrenadeBounceInfo
{
	float                                              m_fSpeed;                                         		// 0x000000 (0x0004)              
	int                                                m_nMaterial;                                      		// 0x000004 (0x0004)              
};
//0x000009
//UserData[0x1DF288E8]
struct FUserData
{
	class AcAPBPlayerController*                       UserController;                                   		// 0x000000 (0x0004)              
	float                                              fDuration;                                        		// 0x000004 (0x0004)              
	unsigned char                                      eCurrentCSA;                                      		// 0x000008 (0x0001)              PROPERTY: etContextSensitiveActionBase
};
//0x000011
//IPData[0x1DF28880]
struct FIPData
{
	TArray<struct FUserData>                           aUsers;                                           		// 0x000000 (0x000C)              
	float                                              fCachedProgress;                                  		// 0x00000C (0x0004)              
	unsigned char                                      eCachedCSA;                                       		// 0x000010 (0x0001)              PROPERTY: etContextSensitiveActionBase
};
//0x000010
//tPlayerDropOffPointsInfo[0x1DF28818]
struct FtPlayerDropOffPointsInfo
{
	int                                                nCharacterUID;                                    		// 0x000000 (0x0004)              
	float                                              fPoints;                                          		// 0x000004 (0x0004)              
	double                                             fPointsSubtractedTimeStamp;                       		// 0x000008 (0x0008)              
};
//0x00001C
//DisplayPointMusicPlaybackInfo[0x1DF287B0]
struct FDisplayPointMusicPlaybackInfo
{
	int                                                m_nOwnerCharacterUID;                             		// 0x000000 (0x0004)              
	struct FGuid                                       m_MusicStudioSongGuid;                            		// 0x000004 (0x0010)              
	int                                                m_nInitialPlaybackServerTime;                     		// 0x000014 (0x0004)              
	unsigned long                                      m_bMp3Playing : 1;                                		// 0x000018 (0x0004) [0x00000001] 
};
//0x000030
//DisplayPointMusicNameInfo[0x1DF28748]
struct FDisplayPointMusicNameInfo
{
	struct FString                                     m_sTrackName;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sArtistName;                                    		// 0x00000C (0x000C)              
	struct FString                                     m_sAlbumName;                                     		// 0x000018 (0x000C)              
	struct FString                                     m_sGenre;                                         		// 0x000024 (0x000C)              
};
//0x00005C
//MissionTemplate[0x1DF286E0]
struct FMissionTemplate
{
	struct FString                                     m_sMissionTitle;                                  		// 0x000000 (0x000C)              
	int                                                m_eMissionTemplate;                               		// 0x00000C (0x0004)              
	int                                                m_eMissionTypeFilter;                             		// 0x000010 (0x0004)              
	int                                                m_eMissionUIOppositionProfile;                    		// 0x000014 (0x0004)              
	int                                                m_eMissionUIOwnerProfile;                         		// 0x000018 (0x0004)              
	int                                                m_ePurpose;                                       		// 0x00001C (0x0004)              
	int                                                m_eRarity;                                        		// 0x000020 (0x0004)              
	int                                                m_eRewardPackage;                                 		// 0x000024 (0x0004)              
	float                                              m_fOwningSideBias;                                		// 0x000028 (0x0004)              
	int                                                m_nComplexity;                                    		// 0x00002C (0x0004)              
	int                                                m_nGroupSizeMax;                                  		// 0x000030 (0x0004)              
	int                                                m_nGroupSizeMin;                                  		// 0x000034 (0x0004)              
	int                                                m_nOpposingSideVIPLives;                          		// 0x000038 (0x0004)              
	int                                                m_nOwningSideVIPLives;                            		// 0x00003C (0x0004)              
	int                                                m_nRespawnTime;                                   		// 0x000040 (0x0004)              
	int                                                m_nRespawnTimeIncrement;                          		// 0x000044 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000048 (0x0004)              
	int                                                m_nSimultaneousCap;                               		// 0x00004C (0x0004)              
	int                                                m_nTakeoutCount;                                  		// 0x000050 (0x0004)              
	unsigned char                                      m_eFaction;                                       		// 0x000054 (0x0001)              PROPERTY: etFaction
	unsigned char                                      m_eTimeOfDayAvailability;                         		// 0x000055 (0x0001)              PROPERTY: etTimeOfDayAvailability
	unsigned char                                      _0x000056[0x2];                                   		// 0x000056 (0x0002) MISSED OFFSET
	unsigned long                                      m_bBountyHunter : 1;                              		// 0x000058 (0x0004) [0x00000001] 
	unsigned long                                      m_bCountArrestsAsTakeouts : 1;                    		// 0x000058 (0x0004) [0x00000002] 
	unsigned long                                      m_bCountArrestsAsVIPTakeouts : 1;                 		// 0x000058 (0x0004) [0x00000004] 
	unsigned long                                      m_bCountKillsAsTakeouts : 1;                      		// 0x000058 (0x0004) [0x00000008] 
	unsigned long                                      m_bCountKillsAsVIPTakeouts : 1;                   		// 0x000058 (0x0004) [0x00000010] 
	unsigned long                                      m_bDisabled : 1;                                  		// 0x000058 (0x0004) [0x00000020] 
	unsigned long                                      m_bNoCriminalOpposition : 1;                      		// 0x000058 (0x0004) [0x00000040] 
	unsigned long                                      m_bOppositionWinOnMaxTakeouts : 1;                		// 0x000058 (0x0004) [0x00000080] 
	unsigned long                                      m_bOwnerWinOnMaxTakeouts : 1;                     		// 0x000058 (0x0004) [0x00000100] 
	unsigned long                                      m_bTest : 1;                                      		// 0x000058 (0x0004) [0x00000200] 
	unsigned long                                      m_bUseTakeoutBar : 1;                             		// 0x000058 (0x0004) [0x00000400] 
};
//0x000050
//TaskObjective[0x1DF28678]
struct FTaskObjective
{
	struct FString                                     m_sDispatchBrief;                                 		// 0x000000 (0x000C)              
	struct FString                                     m_sOwnerBrief;                                    		// 0x00000C (0x000C)              
	int                                                m_eMissionTemplate;                               		// 0x000018 (0x0004)              
	int                                                m_eOperation;                                     		// 0x00001C (0x0004)              
	int                                                m_eTargetAllocation;                              		// 0x000020 (0x0004)              
	int                                                m_eTaskItemVariety;                               		// 0x000024 (0x0004)              
	int                                                m_eTaskObjective;                                 		// 0x000028 (0x0004)              
	int                                                m_eVehicleCategory;                               		// 0x00002C (0x0004)              
	int                                                m_nTargetsRequired;                               		// 0x000030 (0x0004)              
	int                                                m_nTaskItemsAvailable;                            		// 0x000034 (0x0004)              
	int                                                m_nTaskItemsRequired;                             		// 0x000038 (0x0004)              
	int                                                m_nTimeLimit;                                     		// 0x00003C (0x0004)              
	int                                                m_nVehiclesRequired;                              		// 0x000040 (0x0004)              
	unsigned char                                      m_eItemBatch;                                     		// 0x000044 (0x0001)              PROPERTY: etTaskItemBatch
	unsigned char                                      m_eOpposingSideVIPAssignment;                     		// 0x000045 (0x0001)              PROPERTY: etVIPAssignmentMethod
	unsigned char                                      m_eOwningSideVIPAssignment;                       		// 0x000046 (0x0001)              PROPERTY: etVIPAssignmentMethod
	unsigned char                                      m_eStage;                                         		// 0x000047 (0x0001)              PROPERTY: etTaskObjectiveStage
	unsigned char                                      m_eTaskItemSpecificationMethod;                   		// 0x000048 (0x0001)              PROPERTY: etTaskItemSpecificationMethod
	unsigned char                                      m_eVehicleBatch;                                  		// 0x000049 (0x0001)              PROPERTY: etVehicleBatch
	unsigned char                                      _0x00004A[0x2];                                   		// 0x00004A (0x0002) MISSED OFFSET
	unsigned long                                      m_bBonusTime : 1;                                 		// 0x00004C (0x0004) [0x00000001] 
	unsigned long                                      m_bClearOpposingSideVIPTakeoutsOnStart : 1;       		// 0x00004C (0x0004) [0x00000002] 
	unsigned long                                      m_bClearOwningSideVIPTakeoutsOnStart : 1;         		// 0x00004C (0x0004) [0x00000004] 
	unsigned long                                      m_bClearTakeoutsOnStart : 1;                      		// 0x00004C (0x0004) [0x00000008] 
	unsigned long                                      m_bCompletesConcurrentPair : 1;                   		// 0x00004C (0x0004) [0x00000010] 
	unsigned long                                      m_bDisableTakeouts : 1;                           		// 0x00004C (0x0004) [0x00000020] 
	unsigned long                                      m_bDrawOnTimeOut : 1;                             		// 0x00004C (0x0004) [0x00000040] 
	unsigned long                                      m_bEnabledPvP : 1;                                		// 0x00004C (0x0004) [0x00000080] 
	unsigned long                                      m_bEnableOpposingSideVIPTakeouts : 1;             		// 0x00004C (0x0004) [0x00000100] 
	unsigned long                                      m_bEnableOwningSideVIPTakeouts : 1;               		// 0x00004C (0x0004) [0x00000200] 
	unsigned long                                      m_bEndOnlyOnTimeOut : 1;                          		// 0x00004C (0x0004) [0x00000400] 
	unsigned long                                      m_bIsConcurrent : 1;                              		// 0x00004C (0x0004) [0x00000800] 
	unsigned long                                      m_bIsOpposition : 1;                              		// 0x00004C (0x0004) [0x00001000] 
	unsigned long                                      m_bLeaveRemainingTaskItems : 1;                   		// 0x00004C (0x0004) [0x00002000] 
	unsigned long                                      m_bOpenWorldCashPoolItem : 1;                     		// 0x00004C (0x0004) [0x00004000] 
	unsigned long                                      m_bOppositionWinOnTargetDestroyedByOwners : 1;    		// 0x00004C (0x0004) [0x00008000] 
	unsigned long                                      m_bOwnersWinOnTargetDestroyedByOpponent : 1;      		// 0x00004C (0x0004) [0x00010000] 
	unsigned long                                      m_bScorePointOnWin : 1;                           		// 0x00004C (0x0004) [0x00020000] 
	unsigned long                                      m_bSpawnInInventory : 1;                          		// 0x00004C (0x0004) [0x00040000] 
	unsigned long                                      m_bWinOnCompletion : 1;                           		// 0x00004C (0x0004) [0x00080000] 
	unsigned long                                      m_bWinOnUnopposedCompletion : 1;                  		// 0x00004C (0x0004) [0x00100000] 
};
//0x00004C
//TaskOperation[0x1DF28610]
struct FTaskOperation
{
	struct FString                                     m_sCriminalBrief;                                 		// 0x000000 (0x000C)              
	struct FString                                     m_sEnforcerBrief;                                 		// 0x00000C (0x000C)              
	struct FString                                     m_sUIDescription;                                 		// 0x000018 (0x000C)              
	int                                                m_eMissionUIProfile;                              		// 0x000024 (0x0004)              
	int                                                m_eMissionUIProfileOpposition;                    		// 0x000028 (0x0004)              
	int                                                m_eOppositionTargetHUDMarker;                     		// 0x00002C (0x0004)              
	int                                                m_eOutOfMissionTargetHUDMarker;                   		// 0x000030 (0x0004)              
	int                                                m_eTaskOperation;                                 		// 0x000034 (0x0004)              
	int                                                m_eTaskTargetHUDMarker;                           		// 0x000038 (0x0004)              
	int                                                m_nObjectiveHoldPointsTarget;                     		// 0x00003C (0x0004)              
	unsigned char                                      m_eNPCWorldEvent;                                 		// 0x000040 (0x0001)              PROPERTY: etNPCWorldEvent
	unsigned char                                      m_eOppositionItemVisibility;                      		// 0x000041 (0x0001)              PROPERTY: etTaskItemVisibility
	unsigned char                                      m_eOutOfMissionItemVisibility;                    		// 0x000042 (0x0001)              PROPERTY: etTaskItemVisibility
	unsigned char                                      m_eOwnerItemVisibility;                           		// 0x000043 (0x0001)              PROPERTY: etTaskItemVisibility
	unsigned char                                      m_eTaskOperationCategory;                         		// 0x000044 (0x0001)              PROPERTY: etTaskOperationCategory
	unsigned char                                      m_eTaskTargetClass;                               		// 0x000045 (0x0001)              PROPERTY: etTaskTargetClass
	unsigned char                                      _0x000046[0x2];                                   		// 0x000046 (0x0002) MISSED OFFSET
	unsigned long                                      m_bAnySideCanInitiate : 1;                        		// 0x000048 (0x0004) [0x00000001] 
	unsigned long                                      m_bCheckDeliverableProximity : 1;                 		// 0x000048 (0x0004) [0x00000002] 
	unsigned long                                      m_bCheckObjectiveProximity : 1;                   		// 0x000048 (0x0004) [0x00000004] 
	unsigned long                                      m_bHideAllDeliverablesFromOpposition : 1;         		// 0x000048 (0x0004) [0x00000008] 
	unsigned long                                      m_bHideAllDeliverablesFromOwners : 1;             		// 0x000048 (0x0004) [0x00000010] 
	unsigned long                                      m_bOppositionCanCarryTaskItems : 1;               		// 0x000048 (0x0004) [0x00000020] 
	unsigned long                                      m_bOppositionCanInteractWithVehicles : 1;         		// 0x000048 (0x0004) [0x00000040] 
	unsigned long                                      m_bOutOfMissionCanInteract : 1;                   		// 0x000048 (0x0004) [0x00000080] 
	unsigned long                                      m_bOwnersCanCarryTaskItems : 1;                   		// 0x000048 (0x0004) [0x00000100] 
	unsigned long                                      m_bOwnersCanInteractWithVehicles : 1;             		// 0x000048 (0x0004) [0x00000200] 
	unsigned long                                      m_bShowOppositionToTaskGroup : 1;                 		// 0x000048 (0x0004) [0x00000400] 
	unsigned long                                      m_bShowTaskGroupToOpposition : 1;                 		// 0x000048 (0x0004) [0x00000800] 
	unsigned long                                      m_bUseObjectiveHoldPoints : 1;                    		// 0x000048 (0x0004) [0x00001000] 
};
//0x000010
//TaskOperationCategory[0x1DF285A8]
struct FTaskOperationCategory
{
	int                                                m_eReticuleHint;                                  		// 0x000000 (0x0004)              
	float                                              m_fMinTakeoutMultiplier;                          		// 0x000004 (0x0004)              
	unsigned char                                      m_eTaskOperationCategory;                         		// 0x000008 (0x0001)              PROPERTY: etTaskOperationCategory
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	unsigned long                                      m_bAutoInstigateOpposition : 1;                   		// 0x00000C (0x0004) [0x00000001] 
};
//0x000008
//TaskOperationArson[0x1DF28540]
struct FTaskOperationArson
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
};
//0x000018
//TaskOperationBombing[0x1DF284D8]
struct FTaskOperationBombing
{
	int                                                m_eBombLevel;                                     		// 0x000000 (0x0004)              
	int                                                m_eTaskOperation;                                 		// 0x000004 (0x0004)              
	float                                              m_fBombDisposalGuardTime;                         		// 0x000008 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x00000C (0x0004)              
	float                                              m_fFuseTimer;                                     		// 0x000010 (0x0004)              
	unsigned long                                      m_bIsBombDefusable : 1;                           		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bIsBombRearmable : 1;                           		// 0x000014 (0x0004) [0x00000002] 
	unsigned long                                      m_bTriggerOnAllBombsDefused : 1;                  		// 0x000014 (0x0004) [0x00000004] 
};
//0x000014
//TaskOperationBuildingBreakIn[0x1DF28470]
struct FTaskOperationBuildingBreakIn
{
	struct FString                                     m_sUseActionName;                                 		// 0x000000 (0x000C)              
	int                                                m_eTaskOperation;                                 		// 0x00000C (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000010 (0x0004)              
};
//0x00000C
//TaskOperationEscort[0x1DF28408]
struct FTaskOperationEscort
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fTriggerTime;                                   		// 0x000004 (0x0004)              
	unsigned long                                      m_bVIPOpponentCanCapture : 1;                     		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bWinOnTimeout : 1;                              		// 0x000008 (0x0004) [0x00000002] 
};
//0x000020
//TaskOperationEscape[0x1DF283A0]
struct FTaskOperationEscape
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fArrestedPenaltySeconds;                        		// 0x000004 (0x0004)              
	float                                              m_fArrestOpponentPenaltySeconds;                  		// 0x000008 (0x0004)              
	float                                              m_fEscapeBarLimit;                                		// 0x00000C (0x0004)              
	float                                              m_fKilledPenaltySeconds;                          		// 0x000010 (0x0004)              
	float                                              m_fKillOpponentPenaltySeconds;                    		// 0x000014 (0x0004)              
	float                                              m_fTakeDamagePenaltySeconds;                      		// 0x000018 (0x0004)              
	float                                              m_fWeaponFirePenaltySeconds;                      		// 0x00001C (0x0004)              
};
//0x000008
//TaskOperationMovingTarget[0x1DF28338]
struct FTaskOperationMovingTarget
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nPadding;                                       		// 0x000004 (0x0004)              
};
//0x000008
//TaskOperationArmedGuard[0x1DF282D0]
struct FTaskOperationArmedGuard
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fUnused;                                        		// 0x000004 (0x0004)              
};
//0x00000C
//TaskOperationGraffiti[0x1DF28268]
struct FTaskOperationGraffiti
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nSprayDuration;                                 		// 0x000004 (0x0004)              
	unsigned long                                      m_bIsResprayable : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bStartsNeutral : 1;                             		// 0x000008 (0x0004) [0x00000002] 
};
//0x00000C
//TaskOperationItemDelivery[0x1DF28200]
struct FTaskOperationItemDelivery
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fTriggerTime;                                   		// 0x000004 (0x0004)              
	unsigned long                                      m_bDeliverToAllTargets : 1;                       		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bDeliverVehicle : 1;                            		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      m_bDeliverVehicleCargo : 1;                       		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      m_bRemoveDeliverables : 1;                        		// 0x000008 (0x0004) [0x00000008] 
};
//0x000009
//TaskOperationNPC[0x1DF28198]
struct FTaskOperationNPC
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
	unsigned char                                      m_eCSAState;                                      		// 0x000008 (0x0001)              PROPERTY: etCSA_IATState
};
//0x00000C
//TaskOperationPickup[0x1DF28130]
struct FTaskOperationPickup
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nPadding;                                       		// 0x000004 (0x0004)              
	unsigned long                                      m_bIsVehicleDeliverable : 1;                      		// 0x000008 (0x0004) [0x00000001] 
};
//0x000008
//TaskOperationRamRaid[0x1DF280C8]
struct FTaskOperationRamRaid
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nHealthPool;                                    		// 0x000004 (0x0004)              
};
//0x000008
//TaskOperationSurvival[0x1DF28060]
struct FTaskOperationSurvival
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nPadding;                                       		// 0x000004 (0x0004)              
};
//0x000008
//TaskOperationBust[0x1DF27FF8]
struct FTaskOperationBust
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nHealthPool;                                    		// 0x000004 (0x0004)              
};
//0x00000C
//TaskOperationRendezvous[0x1DF27F90]
struct FTaskOperationRendezvous
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fTriggerTime;                                   		// 0x000004 (0x0004)              
	unsigned long                                      m_bAllSideMembers : 1;                            		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bAllSimultaneously : 1;                         		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      m_bIsCoopCheckpoint : 1;                          		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      m_bVehicleRequired : 1;                           		// 0x000008 (0x0004) [0x00000008] 
};
//0x000008
//TaskOperationVandalism[0x1DF27F28]
struct FTaskOperationVandalism
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nHealthPool;                                    		// 0x000004 (0x0004)              
};
//0x00000C
//TaskOperationVehicleLooting[0x1DF27EC0]
struct FTaskOperationVehicleLooting
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
	unsigned long                                      m_bIsVehicleDeliverable : 1;                      		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bVehicleLocked : 1;                             		// 0x000008 (0x0004) [0x00000002] 
};
//0x000010
//TaskOperationVehicleTheft[0x1DF27E58]
struct FTaskOperationVehicleTheft
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
	int                                                m_nPointlessExtraPadding;                         		// 0x000008 (0x0004)              
	unsigned long                                      m_bIsVehicleDeliverable : 1;                      		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      m_bVehicleLocked : 1;                             		// 0x00000C (0x0004) [0x00000002] 
};
//0x00000C
//TaskOperationVehicleCargo[0x1DF27DF0]
struct FTaskOperationVehicleCargo
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
	unsigned long                                      m_bIsVehicleDeliverable : 1;                      		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      m_bVehicleLocked : 1;                             		// 0x000008 (0x0004) [0x00000002] 
};
//0x000008
//TaskOperationDeathmatch[0x1DF27D88]
struct FTaskOperationDeathmatch
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	int                                                m_nPadding;                                       		// 0x000004 (0x0004)              
};
//0x00000C
//TaskOperationTerritoryControl[0x1DF27D20]
struct FTaskOperationTerritoryControl
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCaptureTime;                                   		// 0x000004 (0x0004)              
	float                                              m_fResetTime;                                     		// 0x000008 (0x0004)              
};
//0x000008
//TaskOperationCSI[0x1DF27CB8]
struct FTaskOperationCSI
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
};
//0x000008
//TaskOperationSabotage[0x1DF27C50]
struct FTaskOperationSabotage
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
};
//0x000008
//TaskOperationHacking[0x1DF27BE8]
struct FTaskOperationHacking
{
	int                                                m_eTaskOperation;                                 		// 0x000000 (0x0004)              
	float                                              m_fCSADuration;                                   		// 0x000004 (0x0004)              
};
//0x000040
//MissionUITrackedStateProfile[0x1DF27B80]
struct FMissionUITrackedStateProfile
{
	struct FString                                     m_sArmedIcon;                                     		// 0x000000 (0x000C)              
	struct FString                                     m_sNeutralIcon;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sOppositionClaimed;                             		// 0x000018 (0x000C)              
	struct FString                                     m_sOwnerClaimed;                                  		// 0x000024 (0x000C)              
	struct FString                                     m_sUnarmedIcon;                                   		// 0x000030 (0x000C)              
	int                                                m_eMissionUITrackedStateProfile;                  		// 0x00003C (0x0004)              
};
//0x000008
//MissionUISocket[0x1DF27B18]
struct FMissionUISocket
{
	int                                                m_eMissionUISocket;                               		// 0x000000 (0x0004)              
	int                                                m_nRow;                                           		// 0x000004 (0x0004)              
};
//0x00011C
//TaskOperationUIProfile[0x1DF27AB0]
struct FTaskOperationUIProfile
{
	struct FString                                     m_sCriminalBrief;                                 		// 0x000000 (0x000C)              
	struct FString                                     m_sEnforcerBrief;                                 		// 0x00000C (0x000C)              
	struct FString                                     m_sShortBrief;                                    		// 0x000018 (0x000C)              
	struct FString                                     m_sTrackedValueDescription[0x4];                  		// 0x000024 (0x0030)              
	struct FString                                     m_sTrackedValueImage[0x4];                        		// 0x000054 (0x0030)              
	int                                                m_eTaskOperationUIProfile;                        		// 0x000084 (0x0004)              
	int                                                m_eTrackedStateProfile[0x4];                      		// 0x000088 (0x0010)              
	int                                                m_eTrackedValueBarFgDisabled[0x4];                		// 0x000098 (0x0010)              
	int                                                m_eTrackedValueBg[0x4];                           		// 0x0000A8 (0x0010)              
	int                                                m_eTrackedValueFg[0x4];                           		// 0x0000B8 (0x0010)              
	int                                                m_eTrackedValueSocket[0x4];                       		// 0x0000C8 (0x0010)              
	int                                                m_nTrackedValueStageOffset[0x4];                  		// 0x0000D8 (0x0010)              
	unsigned char                                      m_eTrackedValue[0x4];                             		// 0x0000E8 (0x0004)              PROPERTY: etMissionUITrackedValue
	unsigned char                                      m_eTrackedValueDisplay[0x4];                      		// 0x0000EC (0x0004)              PROPERTY: etMissionUITrackedValueDisplay
	unsigned char                                      m_bFlashWhenChanged[0x4];                         		// 0x0000F0 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideAtMax[0x4];                                		// 0x0000F4 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideNameWhenDisabled[0x4];                     		// 0x0000F8 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOne[0x4];                              		// 0x0000FC (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOppositionVIPTakeoutsDisabled[0x4];    		// 0x000100 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOwnerVIPTakeoutsDisabled[0x4];         		// 0x000104 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenPointsDisabled[0x4];                   		// 0x000108 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenTakeoutsDisabled[0x4];                 		// 0x00010C (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenUnopposed[0x4];                        		// 0x000110 (0x0004)              PROPERTY: 
	unsigned char                                      m_bTrackedValueInOverview[0x4];                   		// 0x000114 (0x0004)              PROPERTY: 
	unsigned char                                      m_bTrackedValueOnHUD[0x4];                        		// 0x000118 (0x0004)              PROPERTY: 
};
//0x0000D8
//MissionTemplateUIProfile[0x1DF27A48]
struct FMissionTemplateUIProfile
{
	struct FString                                     m_sTrackedValueDescription[0x4];                  		// 0x000000 (0x0030)              
	struct FString                                     m_sTrackedValueImage[0x4];                        		// 0x000030 (0x0030)              
	int                                                m_eMissionTemplateUIProfile;                      		// 0x000060 (0x0004)              
	int                                                m_eTrackedValueBarFgDisabled[0x4];                		// 0x000064 (0x0010)              
	int                                                m_eTrackedValueBg[0x4];                           		// 0x000074 (0x0010)              
	int                                                m_eTrackedValueFg[0x4];                           		// 0x000084 (0x0010)              
	int                                                m_eTrackedValueSocket[0x4];                       		// 0x000094 (0x0010)              
	unsigned char                                      m_eTrackedValue[0x4];                             		// 0x0000A4 (0x0004)              PROPERTY: etMissionUITrackedValue
	unsigned char                                      m_eTrackedValueDisplay[0x4];                      		// 0x0000A8 (0x0004)              PROPERTY: etMissionUITrackedValueDisplay
	unsigned char                                      m_bFlashWhenChanged[0x4];                         		// 0x0000AC (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideAtMax[0x4];                                		// 0x0000B0 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOne[0x4];                              		// 0x0000B4 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOppositionVIPTakeoutsDisabled[0x4];    		// 0x0000B8 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenOwnerVIPTakeoutsDisabled[0x4];         		// 0x0000BC (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenPointsDisabled[0x4];                   		// 0x0000C0 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenTakeoutsDisabled[0x4];                 		// 0x0000C4 (0x0004)              PROPERTY: 
	unsigned char                                      m_bHideWhenUnopposed[0x4];                        		// 0x0000C8 (0x0004)              PROPERTY: 
	unsigned char                                      m_bTrackedValueInLocalOverview[0x4];              		// 0x0000CC (0x0004)              PROPERTY: 
	unsigned char                                      m_bTrackedValueInRemoteOverview[0x4];             		// 0x0000D0 (0x0004)              PROPERTY: 
	unsigned char                                      m_bTrackedValueOnHUD[0x4];                        		// 0x0000D4 (0x0004)              PROPERTY: 
};
//0x00003C
//TaskTargetAllocation[0x1DF279E0]
struct FTaskTargetAllocation
{
	int                                                m_eLocationConstraint;                            		// 0x000000 (0x0004)              
	int                                                m_eMissionTemplate;                               		// 0x000004 (0x0004)              
	int                                                m_eTaskTargetAllocation;                          		// 0x000008 (0x0004)              
	int                                                m_eTaskTargetType;                                		// 0x00000C (0x0004)              
	int                                                m_eTheme[0x4];                                    		// 0x000010 (0x0010)              
	int                                                m_eVehicleCategory;                               		// 0x000020 (0x0004)              
	float                                              m_fLocationDistanceMax;                           		// 0x000024 (0x0004)              
	float                                              m_fLocationDistanceMin;                           		// 0x000028 (0x0004)              
	int                                                m_nMaxTargetsPerBlock;                            		// 0x00002C (0x0004)              
	int                                                m_nTargetCount;                                   		// 0x000030 (0x0004)              
	unsigned char                                      m_eTaskTargetSpecificationMethod;                 		// 0x000034 (0x0001)              PROPERTY: etTaskTargetSpecificationMethod
	unsigned char                                      _0x000035[0x3];                                   		// 0x000035 (0x0003) MISSED OFFSET
	unsigned long                                      m_bAllowDifferentBlock : 1;                       		// 0x000038 (0x0004) [0x00000001] 
	unsigned long                                      m_bAllowSameBlock : 1;                            		// 0x000038 (0x0004) [0x00000002] 
	unsigned long                                      m_bUniqueBlock : 1;                               		// 0x000038 (0x0004) [0x00000004] 
};
//0x000008
//TaskTargetClass[0x1DF27978]
struct FTaskTargetClass
{
	unsigned char                                      m_eTaskTargetClass;                               		// 0x000000 (0x0001)              PROPERTY: etTaskTargetClass
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	unsigned long                                      m_bCanBeUsedInDirectedMissions : 1;               		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      m_bLivingCity : 1;                                		// 0x000004 (0x0004) [0x00000002] 
};
//0x000038
//TaskTargetType[0x1DF27910]
struct FTaskTargetType
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	int                                                m_eGameplayObject;                                		// 0x000018 (0x0004)              
	int                                                m_eHUDMarkerOffsetOverride;                       		// 0x00001C (0x0004)              
	int                                                m_eOpenWorldTargetActivity;                       		// 0x000020 (0x0004)              
	int                                                m_eOWAItemSpawnRule;                              		// 0x000024 (0x0004)              
	int                                                m_eTaskTargetType;                                		// 0x000028 (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x00002C (0x0004)              
	unsigned char                                      m_eTaskTargetClass;                               		// 0x000030 (0x0001)              PROPERTY: etTaskTargetClass
	unsigned char                                      m_eTimeOfDayAvailability;                         		// 0x000031 (0x0001)              PROPERTY: etTimeOfDayAvailability
	unsigned char                                      _0x000032[0x2];                                   		// 0x000032 (0x0002) MISSED OFFSET
	unsigned long                                      m_bAllowSimultaneousAllocations : 1;              		// 0x000034 (0x0004) [0x00000001] 
	unsigned long                                      m_bOpenWorldOnly : 1;                             		// 0x000034 (0x0004) [0x00000002] 
};
//0x00000C
//TaskTargetVehicle[0x1DF278A8]
struct FTaskTargetVehicle
{
	int                                                m_eTaskTargetType;                                		// 0x000000 (0x0004)              
	unsigned char                                      m_eVehicleSetupType;                              		// 0x000004 (0x0001)              PROPERTY: etVehicleSetupType
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	int                                                m_nDummy;                                         		// 0x000008 (0x0004)              
};
//0x000008
//TaskTargetBuildingFeature[0x1DF27840]
struct FTaskTargetBuildingFeature
{
	int                                                m_eTaskTargetType;                                		// 0x000000 (0x0004)              
	unsigned long                                      m_bRamRaid : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      m_bArson : 1;                                     		// 0x000004 (0x0004) [0x00000002] 
