
/*
-----------------------------------------------------------------
 - UConst
-----------------------------------------------------------------
*/
#define CONST_PUIH_None                                          0
#define CONST_HUD_MINIGAME_PANEL_COUNT                           4
#define CONST_NUM_FNMODS_CHARACTER                               3
#define CONST_NUM_FNMODS_WEAPON                                  3
#define CONST_NUM_FNMODS_VEHICLE                                 4
#define CONST_MAX_NUM_ROLE_MILESTONES                            200
#define CONST_MAX_NUM_MEDALS                                     90
#define CONST_SCORE_CATEGORY_MAX                                 6
#define CONST_m_nMax_Num_Members                                 30
#define CONST_RC_UI_WORLDSERVER_DISCONN                          1003
#define CONST_RC_UI_INVALID_DISTRICT_LIST_INDEX                  1004
#define CONST_RC_UI_INVALID_DISTRICT_LIST                        1005
#define CONST_RC_UI_INVALID_DISTRICT_ID                          1006
#define CONST_RC_UI_NO_FRIEND_INFO                               1007
#define CONST_RC_UI_NO_SUCH_FRIEND                               1008
#define CONST_RC_UI_NO_TEAM_INFO                                 1009
#define CONST_RC_UI_NO_SUCH_TEAM_MEMBER                          1010
#define CONST_RC_UI_ALREADY_IN_INSTANCE                          1011
#define CONST_RC_UI_SPECIFY_INSTANCE                             1012

	kMSGridScroll_MAX = 3,
};
enum etMSGridDragType
{
	kMSGridDragType_None = 0,
	kMSGridDragType_Cell = 1,
	kMSGridDragType_Border = 2,
	kMSGridDragType_MAX = 3,
};
enum etMSGridCellState
{
	kMSGridCellState_Enabled = 0,
	kMSGridCellState_Disabled = 1,
	kMSGridCellState_Focused = 2,
	kMSGridCellState_Pressed = 3,
	kMSGridCellState_Active = 4,
	kMSGridCellState_MAX = 5,
};
enum etMSAnimatorCellStyle
{
	etMSAnimatorCellStyle_Normal = 0,
	etMSAnimatorCellStyle_Hover = 1,
	etMSAnimatorCellStyle_Held = 2,
	etMSAnimatorCellStyle_MAX = 3,
};
enum etMSNoteEditorNoteImage
{
	kMSNoteEditorNoteImage_Empty = 0,
	kMSNoteEditorNoteImage_Single = 1,
	kMSNoteEditorNoteImage_Left = 2,
	kMSNoteEditorNoteImage_Middle = 3,
	kMSNoteEditorNoteImage_Right = 4,
	kMSNoteEditorNoteImage_Empty_Disabled = 5,
	kMSNoteEditorNoteImage_Single_Disabled = 6,
	kMSNoteEditorNoteImage_Left_Disabled = 7,
	kMSNoteEditorNoteImage_Middle_Disabled = 8,
	kMSNoteEditorNoteImage_Right_Disabled = 9,
	kMSNoteEditorNoteImage_MAX = 10,
};
enum etMSNoteEditorCellStyle
{
	kMSNoteEditorCellStyle_WhiteKey_Normal = 0,
	kMSNoteEditorCellStyle_WhiteKey_Dragging = 1,
	kMSNoteEditorCellStyle_BlackKey_Normal = 2,
	kMSNoteEditorCellStyle_BlackKey_Dragging = 3,
	kMSNoteEditorCellStyle_Max = 4,
};
enum etMSNoteEditorDragType
{
	kMSNoteEditorDragType_None = 0,
	kMSNoteEditorDragType_MoveNote = 1,
	kMSNoteEditorDragType_NewNote = 2,
	kMSNoteEditorDragType_ResizeNote = 3,
	kMSNoteEditorDragType_Selecting = 4,
	kMSNoteEditorDragType_MAX = 5,
};
enum etMSPianoCellStyle
{
	etMSPianoCellStyle_White_Off = 0,
	etMSPianoCellStyle_Black_Off = 1,
	etMSPianoCellStyle_White_On = 2,
	etMSPianoCellStyle_Black_On = 3,
	etMSPianoCellStyle_White_Release = 4,
	etMSPianoCellStyle_Black_Release = 5,
	etMSPianoCellStyle_White_Disabled = 6,
	etMSPianoCellStyle_Black_Disabled = 7,
	etMSPianoCellStyle_MAX = 8,
};
enum etMSPianoKeyState
{
	kMSPianoKeyState_Off = 0,
	kMSPianoKeyState_On = 1,
	kMSPianoKeyState_Release = 2,
	kMSPianoKeyState_MAX = 3,
};
enum etMSSequencerStyle
{
	kMSSequencerStyle_Normal = 0,
	kMSSequencerStyle_Selected = 1,
	kMSSequencerStyle_Normal_SONG = 2,
	kMSSequencerStyle_Selected_SONG = 3,
	kMSSequencerStyle_MAX = 4,
};
enum etMSSequencerHeaderStyle
{
	kMSSequencerHeaderStyle_Normal = 0,
	kMSSequencerHeaderStyle_Selected = 1,
	kMSSequencerHeaderStyle_Selecting = 2,
	kMSSequencerHeaderStyle_MAX = 3,
};
enum etMSTrackPatternStyle
{
	kMSTrackPatternStyle_Normal = 0,
	kMSTrackPatternStyle_Selected = 1,
	kMSTrackPatternStyle_MAX = 2,
};
enum eUISelectableMaskImage_SelectionMode
{
	eUISelectableMaskImage_SelectionMode_None = 0,
	eUISelectableMaskImage_SelectionMode_Single = 1,
	eUISelectableMaskImage_SelectionMode_MultipleToggle = 2,
	eUISelectableMaskImage_SelectionMode_MultipleModifier = 3,
	eUISelectableMaskImage_SelectionMode_MAX = 4,
};

/*
-----------------------------------------------------------------
 - Structs
-----------------------------------------------------------------
*/
//0x000048
//AttributeValue[0x1D093D58]
struct FAttributeValue
{
	struct FUIProviderFieldValue                       FieldValue;                                       		// 0x000000 (0x0044)              
	class UObject*                                     pObjectValue;                                     		// 0x000044 (0x0004)              
};
//0x000018
//AttributesData[0x1D093CF0]
struct FAttributesData
{
	unsigned char                                      eGender;                                          		// 0x000000 (0x0001)              PROPERTY: etGender
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	TArray<class UcAttribute*>                         aAttributes;                                      		// 0x000004 (0x000C)              
	class USkeletalMeshComponent*                      pSkelMeshComponent;                               		// 0x000010 (0x0004)              
	class USkeletalMeshComponent*                      pHairMeshComponent;                               		// 0x000014 (0x0004)              
};
//0x000018
//CharacterCacheEntry[0x1D093C88]
struct FCharacterCacheEntry
{
	int                                                nSlotNum;                                         		// 0x000000 (0x0004)              
	int                                                nListIndex;                                       		// 0x000004 (0x0004)              
	unsigned long                                      bValid : 1;                                       		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bExtendedDataCached : 1;                          		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      bMeshRenderComplete : 1;                          		// 0x000008 (0x0004) [0x00000004] 
	class USkeletalMeshComponent*                      pSMC;                                             		// 0x00000C (0x0004)              
	class UMaterialInstanceConstant*                   pBodyMaterial;                                    		// 0x000010 (0x0004)              
	class UObject*                                     pGolemDescriptor;                                 		// 0x000014 (0x0004)              
};
//0x000038
//UIMeshViewerSetup[0x1D093C20]
struct FUIMeshViewerSetup
{
	struct FString                                     m_nUIMeshViewerSetup;                             		// 0x000000 (0x000C)              
	float                                              m_fCameraFOV;                                     		// 0x00000C (0x0004)              
	float                                              m_fCameraPosX;                                    		// 0x000010 (0x0004)              
	float                                              m_fCameraPosY;                                    		// 0x000014 (0x0004)              
	float                                              m_fCameraPosZ;                                    		// 0x000018 (0x0004)              
	float                                              m_fMeshCentreX;                                   		// 0x00001C (0x0004)              
	float                                              m_fMeshCentreY;                                   		// 0x000020 (0x0004)              
	float                                              m_fMeshCentreZ;                                   		// 0x000024 (0x0004)              
	float                                              m_fMeshOrientationX;                              		// 0x000028 (0x0004)              
	float                                              m_fMeshOrientationY;                              		// 0x00002C (0x0004)              
	float                                              m_fMeshOrientationZ;                              		// 0x000030 (0x0004)              
	float                                              m_fMeshScale;                                     		// 0x000034 (0x0004)              
};
//0x00005C
//tUIMeshImage_Mesh[0x1D093BB8]
struct FtUIMeshImage_Mesh
{
	FVector3                                           Position;                                         		// 0x000000 (0x000C)              
	FVector3                                           Scale;                                            		// 0x00000C (0x000C)              
	FRotator                                           OrientationCorrection;                            		// 0x000018 (0x000C)              
	FRotator                                           Orientation[0x2];                                 		// 0x000024 (0x0018)              
	FRotator                                           OrientationVel[0x2];                              		// 0x00003C (0x0018)              
	float                                              OrientationDampen[0x2];                           		// 0x000054 (0x0008)              
};
//0x000008 (0x000064 - 0x00005C)
//tUIMeshImage_SkeletalMesh[0x1D093B50]
struct FtUIMeshImage_SkeletalMesh : FtUIMeshImage_Mesh
{
	class USkeletalMesh*                               Mesh;                                             		// 0x00005C (0x0004)              
	class USkeletalMeshComponent*                      m_pComponent;                                     		// 0x000060 (0x0004)              
};
//0x000004 (0x000060 - 0x00005C)
//tUIMeshImage_StaticMesh[0x1D093AE8]
struct FtUIMeshImage_StaticMesh : FtUIMeshImage_Mesh
{
	class UStaticMesh*                                 Mesh;                                             		// 0x00005C (0x0004)              
};
//0x000004 (0x000060 - 0x00005C)
//tUIMeshImage_SMC[0x1D093A80]
struct FtUIMeshImage_SMC : FtUIMeshImage_Mesh
{
	class USkeletalMeshComponent*                      Mesh;                                             		// 0x00005C (0x0004)              
};
//0x000014
//tUIMeshImage_Light[0x1D093A18]
struct FtUIMeshImage_Light
{
	DWORD                                              Colour;                                           		// 0x000000 (0x0004)              
	float                                              Brightness;                                       		// 0x000004 (0x0004)              
	FRotator                                           Direction;                                        		// 0x000008 (0x000C)              
};
//0x00000C
//MouseInputProxyBehaviorMapping[0x1D0939B0]
struct FMouseInputProxyBehaviorMapping
{
	struct FName                                       ButtonName;                                       		// 0x000000 (0x0008)              
	class UcGFxMouseInputProxyBehavior*                ProxyBehavior;                                    		// 0x000008 (0x0004)              
};
//0x000018
//ScaleformLayer[0x1D093948]
struct FScaleformLayer
{
	struct FString                                     m_sLayerBackground;                               		// 0x000000 (0x000C)              
	int                                                m_eScaleformLayer;                                		// 0x00000C (0x0004)              
	int                                                m_nSecondaryKey;                                  		// 0x000010 (0x0004)              
	unsigned long                                      m_bBlurWhenActive : 1;                            		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bCaptureInput : 1;                              		// 0x000014 (0x0004) [0x00000002] 
};
//0x000042
//DynamicMenuEntry[0x1D0938E0]
struct FDynamicMenuEntry
{
	struct FString                                     m_sDisplayPicture;                                		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayText;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sListID;                                        		// 0x000018 (0x000C)              
	struct FString                                     m_sRemoteEvent;                                   		// 0x000024 (0x000C)              
	struct FString                                     m_sWwiseSwitch;                                   		// 0x000030 (0x000C)              
	int                                                m_eDynamicMenuEntry;                              		// 0x00003C (0x0004)              
	unsigned char                                      m_eCustomisationMode;                             		// 0x000040 (0x0001)              PROPERTY: etCustomisationMode
	unsigned char                                      m_eGender;                                        		// 0x000041 (0x0001)              PROPERTY: etGender
};
//0x000048
//tUI_S_ItemFilter_Criteria[0x1D093878]
struct FtUI_S_ItemFilter_Criteria
{
	int                                                m_nCategory;                                      		// 0x000000 (0x0004)              
	int                                                m_nSubCategory;                                   		// 0x000004 (0x0004)              
	int                                                m_nWeaponType;                                    		// 0x000008 (0x0004)              
	int                                                m_nModifierClass;                                 		// 0x00000C (0x0004)              
	int                                                m_nModifierType;                                  		// 0x000010 (0x0004)              
	int                                                m_nUnlockItemCategory;                            		// 0x000014 (0x0004)              
	int                                                m_nUnlockItemSubCategory;                         		// 0x000018 (0x0004)              
	int                                                m_nUnlockItemWeaponType;                          		// 0x00001C (0x0004)              
	int                                                m_nUnlockItemModifierClass;                       		// 0x000020 (0x0004)              
	int                                                m_nUnlockItemModifierType;                        		// 0x000024 (0x0004)              
	unsigned long                                      m_bUnlockEmote : 1;                               		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      m_bUnlockPrimitive : 1;                           		// 0x000028 (0x0004) [0x00000002] 
	unsigned long                                      m_bUnlockVehicleComponent : 1;                    		// 0x000028 (0x0004) [0x00000004] 
	int                                                m_nUnlockVehicleComponentCategory;                		// 0x00002C (0x0004)              
	unsigned long                                      m_bUnlockCapacity : 1;                            		// 0x000030 (0x0004) [0x00000001] 
	int                                                m_nContact;                                       		// 0x000034 (0x0004)              
	unsigned long                                      m_bEmbedded : 1;                                  		// 0x000038 (0x0004) [0x00000001] 
	int                                                m_nItemInfraCategory;                             		// 0x00003C (0x0004)              
	int                                                m_eCustomisable;                                  		// 0x000040 (0x0004)              
	unsigned long                                      m_bTradable : 1;                                  		// 0x000044 (0x0004) [0x00000001] 
	unsigned long                                      m_bUnused : 1;                                    		// 0x000044 (0x0004) [0x00000002] 
	unsigned long                                      m_bNotDeployed : 1;                               		// 0x000044 (0x0004) [0x00000004] 
	unsigned long                                      m_bEquipable : 1;                                 		// 0x000044 (0x0004) [0x00000008] 
	unsigned long                                      m_bNotTimeLimited : 1;                            		// 0x000044 (0x0004) [0x00000010] 
};
//0x00003C
//tUI_S_ItemFilter_Expression[0x1D093810]
struct FtUI_S_ItemFilter_Expression
{
	int                                                m_nID;                                            		// 0x000000 (0x0004)              
	int                                                m_nParentID;                                      		// 0x000004 (0x0004)              
	struct FString                                     m_sName;                                          		// 0x000008 (0x000C)              
	TArray<int>                                        m_TargetLists;                                    		// 0x000014 (0x000C)              
	TArray<struct FtUI_S_ItemFilter_Criteria>          m_Options;                                        		// 0x000020 (0x000C)              
	TArray<struct FtUI_S_ItemFilter_Criteria>          m_EnableConditions;                               		// 0x00002C (0x000C)              
	int                                                m_nDefaultWeighting;                              		// 0x000038 (0x0004)              
};
//0x000130
//tUI_CV_Filter_Data[0x1D0937A8]
struct FtUI_CV_Filter_Data
{
	int                                                m_nShop;                                          		// 0x000000 (0x0004)              
	struct FtUI_S_ItemFilter_Expression                m_Category;                                       		// 0x000004 (0x003C)              
	struct FtUI_S_ItemFilter_Expression                m_SubCategory;                                    		// 0x000040 (0x003C)              
	struct FtUI_S_ItemFilter_Expression                m_Contact;                                        		// 0x00007C (0x003C)              
	struct FtUI_S_ItemFilter_Expression                m_Usable;                                         		// 0x0000B8 (0x003C)              
	struct FtUI_S_ItemFilter_Expression                m_Intersection;                                   		// 0x0000F4 (0x003C)              
};
//0x000018
//UIOutfit[0x1D093740]
struct FUIOutfit
{
	TArray<class UcClothingPartInfo*>                  aParts;                                           		// 0x000000 (0x000C)              
	class UObject*                                     pDescriptor;                                      		// 0x00000C (0x0004)              
	DWORD                                              pIRSOutfit;                                       		// 0x000010 (0x0004)              
	unsigned long                                      bAddPairedItems : 1;                              		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      bIsFacialHair : 1;                                		// 0x000014 (0x0004) [0x00000002] 
};
//0x00000C
//CameraPosition[0x1D0936D8]
struct FCameraPosition
{
	float                                              fCameraPosition;                                  		// 0x000000 (0x0004)              
	float                                              fActorRotation;                                   		// 0x000004 (0x0004)              
	float                                              fFOVPosition;                                     		// 0x000008 (0x0004)              
};
//0x000068
//UICamera[0x1D093670]
struct FUICamera
{
	struct FCameraPosition                             Position;                                         		// 0x000000 (0x000C)              
	struct FCameraPosition                             Target;                                           		// 0x00000C (0x000C)              
	struct FName                                       PositionEventName;                                		// 0x000018 (0x0008)              
	TArray<class UcEvent_APBRemoteEvent*>              aPositionEvents;                                  		// 0x000020 (0x000C)              
	struct FName                                       ActorRotationEventName;                           		// 0x00002C (0x0008)              
	TArray<class UcEvent_APBRemoteEvent*>              aActorRotationEvents;                             		// 0x000034 (0x000C)              
	struct FName                                       FOVEventName;                                     		// 0x000040 (0x0008)              
	TArray<class UcEvent_APBRemoteEvent*>              aFOVEvents;                                       		// 0x000048 (0x000C)              
	struct FName                                       ActivateEventName;                                		// 0x000054 (0x0008)              
	TArray<class UcEvent_APBRemoteEvent*>              aActivateEvents;                                  		// 0x00005C (0x000C)              
};
//0x000014
//tUIFileSelector_File[0x1D093608]
struct FtUIFileSelector_File
{
	struct FString                                     m_sName;                                          		// 0x000000 (0x000C)              
	int                                                m_Type;                                           		// 0x00000C (0x0004)              
	unsigned long                                      m_bIsSelectable : 1;                              		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      m_bHasChildDirectories : 1;                       		// 0x000010 (0x0004) [0x00000002] 
};
//0x000004
//SFGAOF[0x1D0935A0]
struct FSFGAOF
{
	int                                                Dummy;                                            		// 0x000000 (0x0004)              
};
//0x000030
//UIFileSystem_File[0x1D093538]
struct FUIFileSystem_File
{
	struct FString                                     sFileName;                                        		// 0x000000 (0x000C)              
	struct FString                                     sFilePath;                                        		// 0x00000C (0x000C)              
	struct FSFGAOF                                     nAttributeFlags;                                  		// 0x000018 (0x0004)              
	struct FSFGAOF                                     nLinkAttributeFlags;                              		// 0x00001C (0x0004)              
	DWORD                                              pRelativeIDList;                                  		// 0x000020 (0x0004)              
	DWORD                                              pParentFolder;                                    		// 0x000024 (0x0004)              
	unsigned char                                      eItemType;                                        		// 0x000028 (0x0001)              PROPERTY: eFSItemType
	unsigned char                                      eSpecialDirectory;                                		// 0x000029 (0x0001)              PROPERTY: eUISpecialDirectory
	unsigned char                                      _0x00002A[0x2];                                   		// 0x00002A (0x0002) MISSED OFFSET
	unsigned long                                      bIsLibrary : 1;                                   		// 0x00002C (0x0004) [0x00000001] 
};
//0x000020
//tCachedGroup[0x1D0934D0]
struct FtCachedGroup
{
	int                                                m_nGroupUID;                                      		// 0x000000 (0x0004)              
	struct FString                                     m_sLeaderName;                                    		// 0x000004 (0x000C)              
	int                                                m_nMembers;                                       		// 0x000010 (0x0004)              
	struct FString                                     m_sMessage;                                       		// 0x000014 (0x000C)              
};
//0x000010
//tCachedGroupPage[0x1D093468]
struct FtCachedGroupPage
{
	TArray<struct FtCachedGroup>                       Entries;                                          		// 0x000000 (0x000C)              
	unsigned long                                      m_bNeedsRefresh : 1;                              		// 0x00000C (0x0004) [0x00000001] 
};
//0x000020
//tCachedGroupInfo[0x1D093400]
struct FtCachedGroupInfo
{
	struct FString                                     sLeaderName;                                      		// 0x000000 (0x000C)              
	unsigned long                                      bHasExtraInfo : 1;                                		// 0x00000C (0x0004) [0x00000001] 
	TArray<struct FString>                             Members;                                          		// 0x000010 (0x000C)              
	unsigned long                                      bNeedsRefresh : 1;                                		// 0x00001C (0x0004) [0x00000001] 
};
//0x00002C
//tCachedTeam[0x1D093398]
struct FtCachedTeam
{
	int                                                m_nTeamUID;                                       		// 0x000000 (0x0004)              
	struct FString                                     m_sTeamName;                                      		// 0x000004 (0x000C)              
	int                                                m_nMembers;                                       		// 0x000010 (0x0004)              
	struct FString                                     m_sMessage;                                       		// 0x000014 (0x000C)              
	int                                                m_nRegisteredYear;                                		// 0x000020 (0x0004)              
	int                                                m_nRegisteredMonth;                               		// 0x000024 (0x0004)              
	int                                                m_nRegisteredDay;                                 		// 0x000028 (0x0004)              
};
//0x000010
//tCachedPage[0x1D093330]
struct FtCachedPage
{
	TArray<struct FtCachedTeam>                        Entries;                                          		// 0x000000 (0x000C)              
	unsigned long                                      m_bNeedsRefresh : 1;                              		// 0x00000C (0x0004) [0x00000001] 
};
//0x00002C
//tCachedTeamInfo[0x1D0932C8]
struct FtCachedTeamInfo
{
	struct FString                                     sName;                                            		// 0x000000 (0x000C)              
	unsigned long                                      bHasExtraInfo : 1;                                		// 0x00000C (0x0004) [0x00000001] 
	struct FString                                     sBio;                                             		// 0x000010 (0x000C)              
	TArray<struct FString>                             Contacts;                                         		// 0x00001C (0x000C)              
	unsigned long                                      bNeedsRefresh : 1;                                		// 0x000028 (0x0004) [0x00000001] 
};
//0x00002C
//CategoryInfo[0x1D093260]
struct FCategoryInfo
{
	unsigned char                                      m_CategoryType;                                   		// 0x000000 (0x0001)              PROPERTY: etChatMessageCategory
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     m_sCategoryName;                                  		// 0x000004 (0x000C)              
	struct FLinearColor                                m_Colour;                                         		// 0x000010 (0x0010)              
	struct FString                                     m_sColourTag;                                     		// 0x000020 (0x000C)              
};
//0x00004C
//ChatMessageCategory[0x1D0931F8]
struct FChatMessageCategory
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sSecondarySlashCommand;                         		// 0x00000C (0x000C)              
	struct FString                                     m_sSlashCommand;                                  		// 0x000018 (0x000C)              
	struct FString                                     m_sSyntaxExample;                                 		// 0x000024 (0x000C)              
	struct FString                                     m_sTag;                                           		// 0x000030 (0x000C)              
	int                                                m_eFilterColour;                                  		// 0x00003C (0x0004)              
	int                                                m_nFunctionOutsideIndex;                          		// 0x000040 (0x0004)              
	unsigned char                                      m_eChatMessageCategory;                           		// 0x000044 (0x0001)              PROPERTY: etChatMessageCategory
	unsigned char                                      m_eWorksFromState;                                		// 0x000045 (0x0001)              PROPERTY: etChatCommandWorksFromState
	unsigned char                                      _0x000046[0x2];                                   		// 0x000046 (0x0002) MISSED OFFSET
	unsigned long                                      m_bDisplayNotification : 1;                       		// 0x000048 (0x0004) [0x00000001] 
	unsigned long                                      m_bHasAudioNotification : 1;                      		// 0x000048 (0x0004) [0x00000002] 
	unsigned long                                      m_bModePersists : 1;                              		// 0x000048 (0x0004) [0x00000004] 
	unsigned long                                      m_bValidCommand : 1;                              		// 0x000048 (0x0004) [0x00000008] 
	unsigned long                                      m_bValidFilter : 1;                               		// 0x000048 (0x0004) [0x00000010] 
};
//0x00002C
//EmoteCommand[0x1D093190]
struct FEmoteCommand
{
	struct FString                                     m_sDisplayName;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sPackageRef;                                    		// 0x00000C (0x000C)              
	struct FString                                     m_sSlashCommand;                                  		// 0x000018 (0x000C)              
	int                                                m_eEmoteCommand;                                  		// 0x000024 (0x0004)              
	unsigned long                                      m_bKickCheckEnabled : 1;                          		// 0x000028 (0x0004) [0x00000001] 
};
//0x000048
//ConsoleCommand[0x1D093128]
struct FConsoleCommand
{
	struct FString                                     m_sDescription;                                   		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayName;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sSlashCommand;                                  		// 0x000018 (0x000C)              
	struct FString                                     m_sSyntaxExample;                                 		// 0x000024 (0x000C)              
	int                                                m_eConsoleCommand;                                		// 0x000030 (0x0004)              
	int                                                m_nFunctionOutsideIndex;                          		// 0x000034 (0x0004)              
	int                                                m_nMaxArgCount;                                   		// 0x000038 (0x0004)              
	int                                                m_nMinArgCount;                                   		// 0x00003C (0x0004)              
	unsigned char                                      m_eCommandType;                                   		// 0x000040 (0x0001)              PROPERTY: etChatCommandType
	unsigned char                                      m_ePermissionRequired;                            		// 0x000041 (0x0001)              PROPERTY: 
	unsigned char                                      m_eWorksFromState;                                		// 0x000042 (0x0001)              PROPERTY: etChatCommandWorksFromState
	unsigned char                                      _0x000043[0x1];                                   		// 0x000043 (0x0001) MISSED OFFSET
	unsigned long                                      m_bEnabled : 1;                                   		// 0x000044 (0x0004) [0x00000001] 
	unsigned long                                      m_bWorksInEditors : 1;                            		// 0x000044 (0x0004) [0x00000002] 
};
//0x00000C
//ProfanityFilterEntry[0x1D0930C0]
struct FProfanityFilterEntry
{
	struct FString                                     m_sProfanityFilterEntry;                          		// 0x000000 (0x000C)              
};
//0x000018
//DistrictMapViewport[0x1D093058]
struct FDistrictMapViewport
{
	FVector2                                           m_Centre;                                         		// 0x000000 (0x0008)              
	FVector2                                           m_CentreTarget;                                   		// 0x000008 (0x0008)              
	float                                              m_fZoom;                                          		// 0x000010 (0x0004)              
	float                                              m_fZoomTarget;                                    		// 0x000014 (0x0004)              
};
//0x00000C
//DistrictMapCharacter[0x1D092FF0]
struct FDistrictMapCharacter
{
	int                                                nCharacterID;                                     		// 0x000000 (0x0004)              
	FVector2                                           vPosition;                                        		// 0x000004 (0x0008)              
};
//0x000016
//ScaleformInterface[0x1D092F88]
struct FScaleformInterface
{
	struct FString                                     m_sScene;                                         		// 0x000000 (0x000C)              
	int                                                m_eLayer;                                         		// 0x00000C (0x0004)              
	int                                                m_nPriority;                                      		// 0x000010 (0x0004)              
	unsigned char                                      m_eLayoutMode;                                    		// 0x000014 (0x0001)              PROPERTY: etScaleformLayoutMode
	unsigned char                                      m_eScaleformInterface;                            		// 0x000015 (0x0001)              PROPERTY: etScaleformInterface
};
//0x000042
//GameFlowDialog[0x1D092F20]
struct FGameFlowDialog
{
	struct FString                                     m_sButton1Label;                                  		// 0x000000 (0x000C)              
	struct FString                                     m_sButton2Label;                                  		// 0x00000C (0x000C)              
	struct FString                                     m_sButton3Label;                                  		// 0x000018 (0x000C)              
	struct FString                                     m_sPlayerClass;                                   		// 0x000024 (0x000C)              
	struct FString                                     m_sTitle;                                         		// 0x000030 (0x000C)              
	unsigned char                                      m_eButton1Result;                                 		// 0x00003C (0x0001)              PROPERTY: etDialogResult
	unsigned char                                      m_eButton2Result;                                 		// 0x00003D (0x0001)              PROPERTY: etDialogResult
	unsigned char                                      m_eButton3Result;                                 		// 0x00003E (0x0001)              PROPERTY: etDialogResult
	unsigned char                                      m_eCancelResult;                                  		// 0x00003F (0x0001)              PROPERTY: etDialogResult
	unsigned char                                      m_eDefaultButton;                                 		// 0x000040 (0x0001)              PROPERTY: etDialogResult
	unsigned char                                      m_eScaleformInterface;                            		// 0x000041 (0x0001)              PROPERTY: etScaleformInterface
};
//0x000038
//GameFlowMessage[0x1D092EB8]
struct FGameFlowMessage
{
	class UcDialogUIController*                        pPlayer;                                          		// 0x000000 (0x0004)              
	unsigned char                                      eDialogType;                                      		// 0x000004 (0x0001)              PROPERTY: etGameFlowDialog
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	struct FString                                     sTitle;                                           		// 0x000008 (0x000C)              
	struct FString                                     sMessage;                                         		// 0x000014 (0x000C)              
	struct FScriptDelegate                             pDialogClosedCallback;                            		// 0x000020 (0x000C)              
	struct FScriptDelegate                             pTextDialogClosedCallback;                        		// 0x00002C (0x000C)              
};
//0x000034
//GroupListRow[0x1D092E50]
struct FGroupListRow
{
	int                                                m_nCharacterUID;                                  		// 0x000000 (0x0004)              
	struct FString                                     m_sName;                                          		// 0x000004 (0x000C)              
	struct FString                                     m_sNameMarkup;                                    		// 0x000010 (0x000C)              
	float                                              m_fTextOpacity;                                   		// 0x00001C (0x0004)              
	float                                              m_fBackgroundOpacity;                             		// 0x000020 (0x0004)              
	int                                                m_nRating;                                        		// 0x000024 (0x0004)              
	unsigned long                                      m_bGroupLeader : 1;                               		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      m_bGroupMember : 1;                               		// 0x000028 (0x0004) [0x00000002] 
	unsigned long                                      m_bTeamLeader : 1;                                		// 0x000028 (0x0004) [0x00000004] 
	unsigned long                                      m_bTeamMember : 1;                                		// 0x000028 (0x0004) [0x00000008] 
	unsigned long                                      m_bValid : 1;                                     		// 0x000028 (0x0004) [0x00000010] 
	unsigned char                                      m_eStatus;                                        		// 0x00002C (0x0001)              PROPERTY: 
	unsigned char                                      m_eVoipStatus;                                    		// 0x00002D (0x0001)              PROPERTY: 
	unsigned char                                      _0x00002E[0x2];                                   		// 0x00002E (0x0002) MISSED OFFSET
	int                                                m_nThreat;                                        		// 0x000030 (0x0004)              
};
//0x000030
//HitIndicator[0x1D092DE8]
struct FHitIndicator
{
	class UUIScene*                                    m_pScene;                                         		// 0x000000 (0x0004)              
	class UUIImage*                                    m_pHitImage;                                      		// 0x000004 (0x0004)              
	class UMaterialInstanceConstant*                   m_pHitMaterial;                                   		// 0x000008 (0x0004)              
	class UUIImage*                                    m_pBloodImage;                                    		// 0x00000C (0x0004)              
	class UMaterialInstanceConstant*                   m_pBloodMaterial;                                 		// 0x000010 (0x0004)              
	double                                             m_fTimeStarted;                                   		// 0x000014 (0x0008)              
	float                                              m_fTimeLength;                                    		// 0x00001C (0x0004)              
	unsigned long                                      m_bActive : 1;                                    		// 0x000020 (0x0004) [0x00000001] 
	FVector3                                           m_vHitOrigin;                                     		// 0x000024 (0x000C)              
};
//0x000018
//LocalizePair[0x1D092D80]
struct FLocalizePair
{
	struct FString                                     m_sToken;                                         		// 0x000000 (0x000C)              
	struct FString                                     m_sReplacementText;                               		// 0x00000C (0x000C)              
};
//0x000024
//HUDMessageData[0x1D092D18]
struct FHUDMessageData
{
	class UUIScene*                                    pScene;                                           		// 0x000000 (0x0004)              
	class UUIPanel*                                    pPositionPanel;                                   		// 0x000004 (0x0004)              
	class UUIImage*                                    pImage;                                           		// 0x000008 (0x0004)              
	class UUILabel*                                    pLabel;                                           		// 0x00000C (0x0004)              
	class UUILabel*                                    pLabelBG;                                         		// 0x000010 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    pRE_ShowMessage;                                  		// 0x000014 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    pRE_HideMessage;                                  		// 0x000018 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    pRE_StartQueueAnim;                               		// 0x00001C (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    pRE_StopQueueAnim;                                		// 0x000020 (0x0004)              
};
//0x000020
//MinigameHUDData[0x1D092CB0]
struct FMinigameHUDData
{
	unsigned char                                      DataType;                                         		// 0x000000 (0x0001)              PROPERTY: etMinigameUIDataType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     DisplayData;                                      		// 0x000004 (0x000C)              
	int                                                nLocalisationIndex;                               		// 0x000010 (0x0004)              
	unsigned long                                      bVisible : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      bNeedsUpdate : 1;                                 		// 0x000014 (0x0004) [0x00000002] 
	class UcUIEvent_APBRemoteEvent*                    ShowPanel;                                        		// 0x000018 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    HidePanel;                                        		// 0x00001C (0x0004)              
};
//0x00004C
//ReticuleScene[0x1D092C48]
struct FReticuleScene
{
	class UUIScene*                                    m_pScene;                                         		// 0x000000 (0x0004)              
	class UUIImage*                                    m_pXImage;                                        		// 0x000004 (0x0004)              
	class UUIImage*                                    m_pDotImage;                                      		// 0x000008 (0x0004)              
	class UUIImage*                                    m_pTopImage;                                      		// 0x00000C (0x0004)              
	class UUIImage*                                    m_pBottomImage;                                   		// 0x000010 (0x0004)              
	class UUIImage*                                    m_pLeftImage;                                     		// 0x000014 (0x0004)              
	class UUIImage*                                    m_pRightImage;                                    		// 0x000018 (0x0004)              
	class UUIImage*                                    m_pHitImage;                                      		// 0x00001C (0x0004)              
	class UUIImage*                                    m_pHighlightImage;                                		// 0x000020 (0x0004)              
	class UUILabel*                                    m_pRangeLabel;                                    		// 0x000024 (0x0004)              
	class UUILabel*                                    m_pRangeLabel_BG;                                 		// 0x000028 (0x0004)              
	class UUILabel*                                    m_pWindupLabel;                                   		// 0x00002C (0x0004)              
	class UUILabel*                                    m_pWindupLabel_BG;                                		// 0x000030 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    m_pRE_RangedReticule;                             		// 0x000034 (0x0004)              
	class USeqAct_Interp*                              m_pMatinee;                                       		// 0x000038 (0x0004)              
	class UcUIEvent_APBRemoteEvent*                    m_pRE_HitSuccess;                                 		// 0x00003C (0x0004)              
	unsigned char                                      m_eReticuleType;                                  		// 0x000040 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000041[0x3];                                   		// 0x000041 (0x0003) MISSED OFFSET
	class UUIImage*                                    m_pLoudnessIcon;                                  		// 0x000044 (0x0004)              
	class UMaterialInstanceConstant*                   m_pLoudnessMaterial;                              		// 0x000048 (0x0004)              
};
//0x000018
//ReticuleHitNotification[0x1D092BE0]
struct FReticuleHitNotification
{
	struct FLinearColor                                Colour;                                           		// 0x000000 (0x0010)              
	int                                                nExpiryTime;                                      		// 0x000010 (0x0004)              
	float                                              fDisplayTime;                                     		// 0x000014 (0x0004)              
};
//0x000014
//SubtitleLine[0x1D092B78]
struct FSubtitleLine
{
	double                                             m_fDisplayUntil;                                  		// 0x000000 (0x0008)              
	struct FString                                     m_sSubtitleLine;                                  		// 0x000008 (0x000C)              
};
//0x00000D
//HUDUsables_DisplaySetting[0x1D092B10]
struct FHUDUsables_DisplaySetting
{
	int                                                m_eIconColour;                                    		// 0x000000 (0x0004)              
	float                                              m_fBackgroundOpacity;                             		// 0x000004 (0x0004)              
	float                                              m_fTextBackgroundOpacity;                         		// 0x000008 (0x0004)              
	unsigned char                                      m_eHUDUsables_DisplaySetting;                     		// 0x00000C (0x0001)              PROPERTY: etHUDUsables_DisplaySetting
};
//0x000005
//tTimeData[0x1D092AA8]
struct FtTimeData
{
	int                                                m_nTime;                                          		// 0x000000 (0x0004)              
	unsigned char                                      m_eDateUnit;                                      		// 0x000004 (0x0001)              PROPERTY: etDateUnit
};
//0x000030
//Usable[0x1D092A40]
struct FUsable
{
	class UUIPanel*                                    pPanel;                                           		// 0x000000 (0x0004)              
	class UUIImage*                                    pImage;                                           		// 0x000004 (0x0004)              
	class UUIImage*                                    pImageBG;                                         		// 0x000008 (0x0004)              
	class UUILabel*                                    pTimerLabel;                                      		// 0x00000C (0x0004)              
	class UUILabel*                                    pCountLabel;                                      		// 0x000010 (0x0004)              
	class UUIImage*                                    pTimerLabelBGImg;                                 		// 0x000014 (0x0004)              
	class UTexture*                                    pIconTexture;                                     		// 0x000018 (0x0004)              
	struct FtTimeData                                  tIconTime;                                        		// 0x00001C (0x0008)              
	int                                                nIconCount;                                       		// 0x000024 (0x0004)              
	unsigned char                                      eDeployedItemState;                               		// 0x000028 (0x0001)              PROPERTY: etHUDUsables_DisplaySetting
	unsigned char                                      _0x000029[0x3];                                   		// 0x000029 (0x0003) MISSED OFFSET
	int                                                nSlot;                                            		// 0x00002C (0x0004)              
};
//0x000014
//tCharacterMeshData[0x1D0929D8]
struct FtCharacterMeshData
{
	class USkeletalMeshComponent*                      m_pSMC;                                           		// 0x000000 (0x0004)              
	class UMaterialInstanceConstant*                   m_pBodyMaterial;                                  		// 0x000004 (0x0004)              
	class UMaterial*                                   m_pParentBodyMaterial;                            		// 0x000008 (0x0004)              
	class UMaterial*                                   m_pParentBodyMaterialCompressedNM;                		// 0x00000C (0x0004)              
	class UObject*                                     m_pGolemDescriptor;                               		// 0x000010 (0x0004)              
};
//0x000048
//MissionSummaryPacket[0x1D092970]
struct FMissionSummaryPacket
{
	int                                                m_nMissionID;                                     		// 0x000000 (0x0004)              
	int                                                m_nMissionTemplateID;                             		// 0x000004 (0x0004)              
	int                                                m_nScoreBreakdown[0x6];                           		// 0x000008 (0x0018)              
	int                                                m_nCashRewarded;                                  		// 0x000020 (0x0004)              
	int                                                m_nCashRewardedAltPremium;                        		// 0x000024 (0x0004)              
	int                                                m_nCashBonus;                                     		// 0x000028 (0x0004)              
	int                                                m_nContactStanding;                               		// 0x00002C (0x0004)              
	int                                                m_nContactStandingAltPremium;                     		// 0x000030 (0x0004)              
	int                                                m_nContactStandingBonus;                          		// 0x000034 (0x0004)              
	int                                                m_eWeightedReward;                                		// 0x000038 (0x0004)              
	unsigned char                                      m_eMissionSystem;                                 		// 0x00003C (0x0001)              PROPERTY: 
	unsigned char                                      m_nNewContactLevel;                               		// 0x00003D (0x0001)              PROPERTY: 
	unsigned char                                      m_ePledgedContact;                                		// 0x00003E (0x0001)              PROPERTY: 
	unsigned char                                      m_eResult;                                        		// 0x00003F (0x0001)              PROPERTY: 
	unsigned char                                      m_eReason;                                        		// 0x000040 (0x0001)              PROPERTY: etMissionResultReason
	unsigned char                                      _0x000041[0x3];                                   		// 0x000041 (0x0003) MISSED OFFSET
	unsigned long                                      m_bWasOwner : 1;                                  		// 0x000044 (0x0004) [0x00000001] 
	unsigned long                                      m_bWasOpposed : 1;                                		// 0x000044 (0x0004) [0x00000002] 
	unsigned long                                      m_bHideContactStanding : 1;                       		// 0x000044 (0x0004) [0x00000004] 
	unsigned long                                      m_bIsFreeRider : 1;                               		// 0x000044 (0x0004) [0x00000008] 
	unsigned long                                      m_bWinner : 1;                                    		// 0x000044 (0x0004) [0x00000010] 
	unsigned long                                      m_bLoser : 1;                                     		// 0x000044 (0x0004) [0x00000020] 
};
//0x0000BC
//ScoreboardData[0x1D092908]
struct FScoreboardData
{
	int                                                nCharacterID;                                     		// 0x000000 (0x0004)              
	int                                                nKills;                                           		// 0x000004 (0x0004)              
	int                                                nAssists;                                         		// 0x000008 (0x0004)              
	int                                                nDeaths;                                          		// 0x00000C (0x0004)              
	int                                                nTargets;                                         		// 0x000010 (0x0004)              
	int                                                nArrests;                                         		// 0x000014 (0x0004)              
	int                                                nArrested;                                        		// 0x000018 (0x0004)              
	int                                                nScoreBreakdown[0x6];                             		// 0x00001C (0x0018)              
	int                                                nCash;                                            		// 0x000034 (0x0004)              
	int                                                nCashAltPremium;                                  		// 0x000038 (0x0004)              
	int                                                nCashBonus;                                       		// 0x00003C (0x0004)              
	int                                                nContactStanding;                                 		// 0x000040 (0x0004)              
	int                                                nContactStandingAltPremium;                       		// 0x000044 (0x0004)              
	int                                                nContactStandingBonus;                            		// 0x000048 (0x0004)              
	int                                                eWeightedReward;                                  		// 0x00004C (0x0004)              
	int                                                nMinutes;                                         		// 0x000050 (0x0004)              
	int                                                nSeconds;                                         		// 0x000054 (0x0004)              
	int                                                nThreat;                                          		// 0x000058 (0x0004)              
	int                                                nRating;                                          		// 0x00005C (0x0004)              
	int                                                m_nPrimaryWeaponID;                               		// 0x000060 (0x0004)              
	int                                                m_aWeaponFnModIDs[0x3];                           		// 0x000064 (0x000C)              
	int                                                m_aCharacterFnModIDs[0x4];                        		// 0x000070 (0x0010)              
	int                                                nBestScore;                                       		// 0x000080 (0x0004)              
	int                                                nBestKills;                                       		// 0x000084 (0x0004)              
	int                                                nBestAssists;                                     		// 0x000088 (0x0004)              
	int                                                nTotalKills;                                      		// 0x00008C (0x0004)              
	int                                                nTotalDeaths;                                     		// 0x000090 (0x0004)              
	float                                              fEstimatedTimeAlive;                              		// 0x000094 (0x0004)              
	TArray<int>                                        anMedals;                                         		// 0x000098 (0x000C)              
	unsigned char                                      eFaction;                                         		// 0x0000A4 (0x0001)              PROPERTY: 
	unsigned char                                      eContact;                                         		// 0x0000A5 (0x0001)              PROPERTY: 
	unsigned char                                      eChaosSlotNum;                                    		// 0x0000A6 (0x0001)              PROPERTY: 
	unsigned char                                      _0x0000A7[0x1];                                   		// 0x0000A7 (0x0001) MISSED OFFSET
	unsigned long                                      bOurSide : 1;                                     		// 0x0000A8 (0x0004) [0x00000001] 
	unsigned long                                      bMVP : 1;                                         		// 0x0000A8 (0x0004) [0x00000002] 
	unsigned long                                      bHideContactStanding : 1;                         		// 0x0000A8 (0x0004) [0x00000004] 
	unsigned long                                      bPlayerOnline : 1;                                		// 0x0000A8 (0x0004) [0x00000008] 
	unsigned long                                      bIsFreeRider : 1;                                 		// 0x0000A8 (0x0004) [0x00000010] 
	unsigned long                                      bIsAlive : 1;                                     		// 0x0000A8 (0x0004) [0x00000020] 
	unsigned long                                      bIsFFATarget : 1;                                 		// 0x0000A8 (0x0004) [0x00000040] 
	struct FString                                     sPlayerName;                                      		// 0x0000AC (0x000C)              
	int                                                nMinigameCustomColumn;                            		// 0x0000B8 (0x0004)              
};
//0x00000C
//LocationBeacon[0x1D0928A0]
struct FLocationBeacon
{
	int                                                m_eLocationBeacon;                                		// 0x000000 (0x0004)              
	float                                              m_fRadius;                                        		// 0x000004 (0x0004)              
	int                                                m_nHeight;                                        		// 0x000008 (0x0004)              
};
//0x000024
//tLocBeacon[0x1D092838]
struct FtLocBeacon
{
	int                                                nType;                                            		// 0x000000 (0x0004)              
	struct FString                                     sName;                                            		// 0x000004 (0x000C)              
	FVector3                                           vPosition;                                        		// 0x000010 (0x000C)              
	float                                              fRadius;                                          		// 0x00001C (0x0004)              
	float                                              fHeight;                                          		// 0x000020 (0x0004)              
};
//0x000018
//tSuppressedMsg[0x1D0927D0]
struct FtSuppressedMsg
{
	unsigned char                                      eType;                                            		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     sLocaleName;                                      		// 0x000004 (0x000C)              
	double                                             fExpiryTime;                                      		// 0x000010 (0x0008)              
};
//0x000008
//tUIDataStore_HUD_MissionTeamData[0x1D092768]
struct FtUIDataStore_HUD_MissionTeamData
{
	int                                                nCurrentObjective;                                		// 0x000000 (0x0004)              
	int                                                nObjectiveCount;                                  		// 0x000004 (0x0004)              
};
//0x000014
//tUIDataStore_HUD_MissionData[0x1D092700]
struct FtUIDataStore_HUD_MissionData
{
	float                                              fTimeRemaining;                                   		// 0x000000 (0x0004)              
	struct FtUIDataStore_HUD_MissionTeamData           LocalTeam;                                        		// 0x000004 (0x0008)              
	struct FtUIDataStore_HUD_MissionTeamData           RemoteTeam;                                       		// 0x00000C (0x0008)              
};
//0x000034
//PopupDialog[0x1D092698]
struct FPopupDialog
{
	struct FString                                     m_sPopupBody;                                     		// 0x000000 (0x000C)              
	int                                                m_eChainedPopup;                                  		// 0x00000C (0x0004)              
	int                                                m_eKnowledgeBaseURL;                              		// 0x000010 (0x0004)              
	int                                                m_eOptionalWaypoint;                              		// 0x000014 (0x0004)              
	int                                                m_ePopupDialog;                                   		// 0x000018 (0x0004)              
	int                                                m_ePosition;                                      		// 0x00001C (0x0004)              
	int                                                m_eUIWidgetHightlight_Aggregation;                		// 0x000020 (0x0004)              
	float                                              m_fDisplayTime;                                   		// 0x000024 (0x0004)              
	int                                                m_nTimesToShow;                                   		// 0x000028 (0x0004)              
	unsigned char                                      m_ePopupCategory;                                 		// 0x00002C (0x0001)              PROPERTY: etPopupDialogCategory
	unsigned char                                      _0x00002D[0x3];                                   		// 0x00002D (0x0003) MISSED OFFSET
	unsigned long                                      m_bDoNotQueue : 1;                                		// 0x000030 (0x0004) [0x00000001] 
	unsigned long                                      m_bFlushQueue : 1;                                		// 0x000030 (0x0004) [0x00000002] 
	unsigned long                                      m_bForceKnowledgebase : 1;                        		// 0x000030 (0x0004) [0x00000004] 
	unsigned long                                      m_bForChat : 1;                                   		// 0x000030 (0x0004) [0x00000008] 
	unsigned long                                      m_bSuppressCriminal : 1;                          		// 0x000030 (0x0004) [0x00000010] 
	unsigned long                                      m_bSuppressEnforcer : 1;                          		// 0x000030 (0x0004) [0x00000020] 
	unsigned long                                      m_bSuppressMain : 1;                              		// 0x000030 (0x0004) [0x00000040] 
};
//0x000005
//PopupDialogCategory[0x1D092630]
struct FPopupDialogCategory
{
	int                                                m_eHighlightColour;                               		// 0x000000 (0x0004)              
	unsigned char                                      m_ePopupDialogCategory;                           		// 0x000004 (0x0001)              PROPERTY: etPopupDialogCategory
};
//0x000008
//PopupDialogTrigger[0x1D0925C8]
struct FPopupDialogTrigger
{
	int                                                m_eDialogShown;                                   		// 0x000000 (0x0004)              
	int                                                m_ePopupDialogTrigger;                            		// 0x000004 (0x0004)              
};
//0x000010
//PopupDialogTriggerSceneOpen[0x1D092560]
struct FPopupDialogTriggerSceneOpen
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_ReticuleOver[0x1D0924F8]
struct FPopupDialogTrigger_ReticuleOver
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_UIEvent_PostOnClick[0x1D092490]
struct FPopupDialogTrigger_UIEvent_PostOnClick
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_Generic[0x1D092428]
struct FPopupDialogTrigger_Generic
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_WorldSpaceZone[0x1D0923C0]
struct FPopupDialogTrigger_WorldSpaceZone
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_GamePlayEvents[0x1D092358]
struct FPopupDialogTrigger_GamePlayEvents
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_CSA_Begin[0x1D0922F0]
struct FPopupDialogTrigger_CSA_Begin
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_CSA_End[0x1D092288]
struct FPopupDialogTrigger_CSA_End
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000010
//PopupDialogTrigger_SceneClose[0x1D092220]
struct FPopupDialogTrigger_SceneClose
{
	struct FString                                     m_sEventName;                                     		// 0x000000 (0x000C)              
	int                                                m_ePopupDialogTrigger;                            		// 0x00000C (0x0004)              
};
//0x000040
//PopupDialogUIHighlightAggregation[0x1D0921B8]
struct FPopupDialogUIHighlightAggregation
{
	struct FString                                     m_sWidget1;                                       		// 0x000000 (0x000C)              
	struct FString                                     m_sWidget2;                                       		// 0x00000C (0x000C)              
	struct FString                                     m_sWidget3;                                       		// 0x000018 (0x000C)              
	struct FString                                     m_sWidget4;                                       		// 0x000024 (0x000C)              
	struct FString                                     m_sWidget5;                                       		// 0x000030 (0x000C)              
	int                                                m_ePopupDialogUIHighlightAggregation;             		// 0x00003C (0x0004)              
};
//0x000024
//tUI_S_Item[0x1D092150]
struct FtUI_S_Item
{
	int                                                m_nItemType;                                      		// 0x000000 (0x0004)              
	struct FGuid                                       m_ItemGUID;                                       		// 0x000004 (0x0010)              
	int                                                m_nItemSubSlot;                                   		// 0x000014 (0x0004)              
	DWORD                                              m_pItem;                                          		// 0x000018 (0x0004)              
	class UObject*                                     m_pItemCustomisation;                             		// 0x00001C (0x0004)              
	DWORD                                              m_pListHandle;                                    		// 0x000020 (0x0004)              
};
//0x00001C
//tPlayerInfo[0x1D0920E8]
struct FtPlayerInfo
{
	int                                                m_nCharacterUID;                                  		// 0x000000 (0x0004)              
	int                                                m_nDistrictUID;                                   		// 0x000004 (0x0004)              
	int                                                m_nInstanceNo;                                    		// 0x000008 (0x0004)              
	int                                                m_nFaction;                                       		// 0x00000C (0x0004)              
	struct FString                                     m_sCharacterName;                                 		// 0x000010 (0x000C)              
};
//0x000008
//tStoInv_InventorySlot[0x1D092080]
struct FtStoInv_InventorySlot
{
	unsigned char                                      m_Category;                                       		// 0x000000 (0x0001)              PROPERTY: eStoInv_Category
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	int                                                m_nSlot;                                          		// 0x000004 (0x0004)              
};
//0x000024
//tStoInv_PlaceholderSlot[0x1D092018]
struct FtStoInv_PlaceholderSlot
{
	struct FGuid                                       m_Guid;                                           		// 0x000000 (0x0010)              
	struct FString                                     m_sItemName;                                      		// 0x000010 (0x000C)              
	int                                                m_nCount;                                         		// 0x00001C (0x0004)              
	int                                                m_nData;                                          		// 0x000020 (0x0004)              
};
//0x00000C
//tStoInv_PlaceholderCategory[0x1D091FB0]
struct FtStoInv_PlaceholderCategory
{
	TArray<struct FtStoInv_PlaceholderSlot>            m_Slots;                                          		// 0x000000 (0x000C)              
};
//0x00000C
//UndoSlot[0x1D091F48]
struct FUndoSlot
{
	TArray<unsigned char>                              m_aData;                                          		// 0x000000 (0x000C)              
};
//0x000030
//TESUndoSlot[0x1D091EE0]
struct FTESUndoSlot
{
	TArray<unsigned char>                              m_aData;                                          		// 0x000000 (0x000C)              
	TArray<unsigned char>                              m_aArea;                                          		// 0x00000C (0x000C)              
	TArray<unsigned char>                              m_aMask;                                          		// 0x000018 (0x000C)              
	TArray<unsigned long>                              m_aMaskFlag;                                      		// 0x000024 (0x000C)              
};
//0x000018
//TooltipRep[0x1D091E78]
struct FTooltipRep
{
	struct FString                                     sWidgetSceneTag;                                  		// 0x000000 (0x000C)              
	struct FString                                     sTooltipText;                                     		// 0x00000C (0x000C)              
};
//0x000024
//TabInfo[0x1D091E10]
struct FTabInfo
{
	struct FString                                     m_sTabName;                                       		// 0x000000 (0x000C)              
	struct FString                                     m_sTrimmedTabName;                                		// 0x00000C (0x000C)              
	TArray<unsigned long>                              m_abVisibleFilters;                               		// 0x000018 (0x000C)              
};
//0x00006C
//tUIInGameQuestionParam[0x1D091DA8]
struct FtUIInGameQuestionParam
{
	struct FString                                     m_sTitle;                                         		// 0x000000 (0x000C)              
	struct FString                                     m_sMessage;                                       		// 0x00000C (0x000C)              
	DWORD                                              m_MessageColor;                                   		// 0x000018 (0x0004)              
	class USurface*                                    m_pMainImage;                                     		// 0x00001C (0x0004)              
	TArray<class USurface*>                            m_pInfoImages;                                    		// 0x000020 (0x000C)              
	unsigned char                                      m_Scene;                                          		// 0x00002C (0x0001)              PROPERTY: eInGameQuestionScene
	unsigned char                                      _0x00002D[0x3];                                   		// 0x00002D (0x0003) MISSED OFFSET
	int                                                m_nTimeOut_Sec;                                   		// 0x000030 (0x0004)              
	struct FScriptDelegate                             m_TimeOutCallback;                                		// 0x000034 (0x000C)              
	unsigned long                                      m_bShowTimeout : 1;                               		// 0x000040 (0x0004) [0x00000001] 
	unsigned long                                      m_bAllowAccept : 1;                               		// 0x000040 (0x0004) [0x00000002] 
	unsigned long                                      m_bAllowDecline : 1;                              		// 0x000040 (0x0004) [0x00000004] 
	unsigned long                                      m_bAllowUnableToDisplay : 1;                      		// 0x000040 (0x0004) [0x00000008] 
	unsigned long                                      m_bAllowUnableToAccept : 1;                       		// 0x000040 (0x0004) [0x00000010] 
	struct FString                                     m_sAcceptDeclinePromptMessage;                    		// 0x000044 (0x000C)              
	struct FScriptDelegate                             m_DisplayedCallback;                              		// 0x000050 (0x000C)              
	struct FScriptDelegate                             m_AnsweredCallback;                               		// 0x00005C (0x000C)              
	unsigned long                                      m_bButtonYesNoType : 1;                           		// 0x000068 (0x0004) [0x00000001] 
};
//0x000078
//tUIInGameQuestionQueueEntry[0x1D091D40]
struct FtUIInGameQuestionQueueEntry
{
	struct FtUIInGameQuestionParam                     m_Params;                                         		// 0x000000 (0x006C)              
	int                                                m_nID;                                            		// 0x00006C (0x0004)              
	float                                              m_fTimeInQueue;                                   		// 0x000070 (0x0004)              
	float                                              m_fTimeVisibleFor;                                		// 0x000074 (0x0004)              
};
//0x000015
//WSCharacterStatus[0x1D091CD8]
struct FWSCharacterStatus
{
	int                                                nRating;                                          		// 0x000000 (0x0004)              
	int                                                nTitleID;                                         		// 0x000004 (0x0004)              
	unsigned long                                      bCanWitnessPlayer : 1;                            		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bUnconscious : 1;                                 		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      bArrested : 1;                                    		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      bShowTitles : 1;                                  		// 0x000008 (0x0004) [0x00000008] 
	unsigned long                                      bIgnored : 1;                                     		// 0x000008 (0x0004) [0x00000010] 
	unsigned long                                      bMissionTitleOverride : 1;                        		// 0x000008 (0x0004) [0x00000020] 
	unsigned char                                      eVoipStatus;                                      		// 0x00000C (0x0001)              PROPERTY: 
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	int                                                nThreat;                                          		// 0x000010 (0x0004)              
	unsigned char                                      eColourProfile;                                   		// 0x000014 (0x0001)              PROPERTY: 
};
//0x000018
//CellToDataStorePair[0x1D091C70]
struct FCellToDataStorePair
{
	struct FString                                     sSrcCellName;                                     		// 0x000000 (0x000C)              
	struct FString                                     sDestDataStoreMarkup;                             		// 0x00000C (0x000C)              
};
//0x000008
//ContextDock[0x1D091C08]
struct FContextDock
{
	unsigned char                                      eDockingFace;                                     		// 0x000000 (0x0001)              PROPERTY: EUIWidgetFace
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	unsigned long                                      bIsDocked : 1;                                    		// 0x000004 (0x0004) [0x00000001] 
};
//0x000008
//HitLayer[0x1D091BA0]
struct FHitLayer
{
	int                                                nIndex;                                           		// 0x000000 (0x0004)              
	float                                              fDistance;                                        		// 0x000004 (0x0004)              
};
//0x000028
//VehicleSoundSettings[0x1D091B38]
struct FVehicleSoundSettings
{
	int                                                nEngineType;                                      		// 0x000000 (0x0004)              
	int                                                nExhaustType;                                     		// 0x000004 (0x0004)              
	int                                                nTurboType;                                       		// 0x000008 (0x0004)              
	int                                                nTransmissionType;                                		// 0x00000C (0x0004)              
	int                                                nDumpValveType;                                   		// 0x000010 (0x0004)              
	int                                                nGearChangeType;                                  		// 0x000014 (0x0004)              
	int                                                nSirenType;                                       		// 0x000018 (0x0004)              
	int                                                nHornType;                                        		// 0x00001C (0x0004)              
	int                                                nAmpType;                                         		// 0x000020 (0x0004)              
	int                                                nSpeakerType;                                     		// 0x000024 (0x0004)              
};
//0x000028
//UIThumbnailListItem[0x1D091AD0]
struct FUIThumbnailListItem
{
	struct FUIListItemDataBinding                      DataSource;                                       		// 0x000000 (0x0014)              
	class UcUIThumbnailList*                           OwnerList;                                        		// 0x000014 (0x0004)              
	class USurface*                                    ValueTexture;                                     		// 0x000018 (0x0004)              
	class UcUIThumbnailListString*                     ValueString;                                      		// 0x00001C (0x0004)              
	unsigned char                                      CellState;                                        		// 0x000020 (0x0001)              PROPERTY: EUIThumnailListItemState
	unsigned char                                      _0x000021[0x3];                                   		// 0x000021 (0x0003) MISSED OFFSET
	unsigned long                                      bDisabled : 1;                                    		// 0x000024 (0x0004) [0x00000001] 
};
//0x000038
//APBSupportPages[0x1D091A68]
struct FAPBSupportPages
{
	struct FString                                     m_sBaseURL;                                       		// 0x000000 (0x000C)              
	struct FString                                     m_sInternalBrowserTitle;                          		// 0x00000C (0x000C)              
	struct FString                                     m_sParameters;                                    		// 0x000018 (0x000C)              
	struct FString                                     m_sRegionDependantURL_INIKey;                     		// 0x000024 (0x000C)              
	int                                                m_eAPBSupportPages;                               		// 0x000030 (0x0004)              
	int                                                m_eURLWipPage;                                    		// 0x000034 (0x0004)              
};
//0x000008
//LoginIntegrationAvailability[0x1D091A00]
struct FLoginIntegrationAvailability
{
	unsigned char                                      LoginType;                                        		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	unsigned long                                      bAvailable : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
};
//0x00001C
//UIIcon[0x1D091998]
struct FUIIcon
{
	int                                                nID;                                              		// 0x000000 (0x0004)              
	struct FString                                     sImageName;                                       		// 0x000004 (0x000C)              
	class USurface*                                    pImage;                                           		// 0x000010 (0x0004)              
	int                                                nWidth;                                           		// 0x000014 (0x0004)              
	int                                                nHeight;                                          		// 0x000018 (0x0004)              
};
//0x000048
//VehicleMenuEntry[0x1D091930]
struct FVehicleMenuEntry
{
	struct FString                                     m_sDisplayPicture;                                		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayText;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sMenuLevel;                                     		// 0x000018 (0x000C)              
	struct FString                                     m_sMenuTag;                                       		// 0x000024 (0x000C)              
	struct FString                                     m_sOptionalScene;                                 		// 0x000030 (0x000C)              
	int                                                m_eCameraAngle;                                   		// 0x00003C (0x0004)              
	int                                                m_eVehicleMenuEntry;                              		// 0x000040 (0x0004)              
	unsigned long                                      m_bEnabled : 1;                                   		// 0x000044 (0x0004) [0x00000001] 
};
//0x000014
//VehicleUICameraAngle[0x1D0918C8]
struct FVehicleUICameraAngle
{
	int                                                m_eVehicleUICameraAngle;                          		// 0x000000 (0x0004)              
	float                                              m_fActorRotation;                                 		// 0x000004 (0x0004)              
	float                                              m_fCameraPosition;                                		// 0x000008 (0x0004)              
	float                                              m_fFOV;                                           		// 0x00000C (0x0004)              
	unsigned long                                      m_bOpenDoors : 1;                                 		// 0x000010 (0x0004) [0x00000001] 
};
//0x00004C
//WardrobeMenuEntry[0x1D091860]
struct FWardrobeMenuEntry
{
	struct FString                                     m_sDisplayImage;                                  		// 0x000000 (0x000C)              
	struct FString                                     m_sDisplayText;                                   		// 0x00000C (0x000C)              
	struct FString                                     m_sMenuLevel;                                     		// 0x000018 (0x000C)              
	struct FString                                     m_sMenuTag;                                       		// 0x000024 (0x000C)              
	struct FString                                     m_sMouseOverText;                                 		// 0x000030 (0x000C)              
	struct FString                                     m_sOptionalScene;                                 		// 0x00003C (0x000C)              
	int                                                m_eWardrobeMenuEntry;                             		// 0x000048 (0x0004)              
};
//0x000038
//ClothingOutfitType[0x1D0917F8]
struct FClothingOutfitType
{
	struct FGuid                                       ItemGuid;                                         		// 0x000000 (0x0010)              
	TArray<struct FGuid>                               aOutfitData;                                      		// 0x000010 (0x000C)              
	TArray<int>                                        aLayerData;                                       		// 0x00001C (0x000C)              
	struct FString                                     sDisplayText;                                     		// 0x000028 (0x000C)              
	class USurface*                                    pDisplayImage;                                    		// 0x000034 (0x0004)              
};
//0x00001C
//VehicleUIComponentPart[0x1D091790]
struct FVehicleUIComponentPart
{
	DWORD                                              pUnlockItemType;                                  		// 0x000000 (0x0004)              
	int                                                nPartIndex;                                       		// 0x000004 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000008 (0x000C)              
	class USurface*                                    pDisplayImage;                                    		// 0x000014 (0x0004)              
	unsigned long                                      bAudioPart : 1;                                   		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      bActive : 1;                                      		// 0x000018 (0x0004) [0x00000002] 
	unsigned long                                      bHasBeenExamined : 1;                             		// 0x000018 (0x0004) [0x00000004] 
	unsigned long                                      bColourCustomisable : 1;                          		// 0x000018 (0x0004) [0x00000008] 
};
//0x00002C
//VehicleUIComponent[0x1D091728]
struct FVehicleUIComponent
{
	DWORD                                              pGolemPartInfo;                                   		// 0x000000 (0x0004)              
	TArray<DWORD>                                      aComponentUnlocks;                                		// 0x000004 (0x000C)              
	struct FString                                     sDisplayText;                                     		// 0x000010 (0x000C)              
	class USurface*                                    pDisplayImage;                                    		// 0x00001C (0x0004)              
	int                                                nCurrentIndex;                                    		// 0x000020 (0x0004)              
	int                                                nCameraAngle;                                     		// 0x000024 (0x0004)              
	int                                                nSortingPriority;                                 		// 0x000028 (0x0004)              
};
//0x000014
//VehiclePaintType[0x1D0916C0]
struct FVehiclePaintType
{
	int                                                nPaintIndex;                                      		// 0x000000 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000004 (0x000C)              
	class USurface*                                    pDisplayImage;                                    		// 0x000010 (0x0004)              
};
//0x000020
//VehicleUIPartPaintInfo[0x1D091658]
struct FVehicleUIPartPaintInfo
{
	struct FString                                     sPartName;                                        		// 0x000000 (0x000C)              
	struct FString                                     sDisplayText;                                     		// 0x00000C (0x000C)              
	DWORD                                              pSDDInfo;                                         		// 0x000018 (0x0004)              
	class UMaterialInstanceConstant*                   m_pThumbnailMaterial;                             		// 0x00001C (0x0004)              
};
//0x000010
//ScarItem[0x1D0915F0]
struct FScarItem
{
	struct FString                                     sDisplayText;                                     		// 0x000000 (0x000C)              
	int                                                nIndex;                                           		// 0x00000C (0x0004)              
};
//0x000018
//HairMorphItem[0x1D091588]
struct FHairMorphItem
{
	struct FString                                     sDisplayText;                                     		// 0x000000 (0x000C)              
	class UcAttribute*                                 pHorizAttribute;                                  		// 0x00000C (0x0004)              
	class UcAttribute*                                 pVertAttribute;                                   		// 0x000010 (0x0004)              
	unsigned long                                      bAllHairMorphs : 1;                               		// 0x000014 (0x0004) [0x00000001] 
};
//0x000010
//ProjectionMask[0x1D091520]
struct FProjectionMask
{
	int                                                nID;                                              		// 0x000000 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000004 (0x000C)              
};
//0x000018
//VinylArea[0x1D0914B8]
struct FVinylArea
{
	int                                                nIndex;                                           		// 0x000000 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000004 (0x000C)              
	DWORD                                              pVinylData;                                       		// 0x000010 (0x0004)              
	class UMaterialInstanceConstant*                   pColourMat;                                       		// 0x000014 (0x0004)              
};
//0x000014
//ColourArea[0x1D091450]
struct FColourArea
{
	int                                                nIndex;                                           		// 0x000000 (0x0004)              
	struct FString                                     sName;                                            		// 0x000004 (0x000C)              
	class UMaterialInstanceConstant*                   pColourMat;                                       		// 0x000010 (0x0004)              
};
//0x000010
//FamousPlayerListItem[0x1D0913E8]
struct FFamousPlayerListItem
{
	int                                                nCharacterID;                                     		// 0x000000 (0x0004)              
	struct FString                                     sName;                                            		// 0x000004 (0x000C)              
};
//0x000018
//LegendListItem[0x1D091380]
struct FLegendListItem
{
	DWORD                                              pDistrictMarkerData;                              		// 0x000000 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000004 (0x000C)              
	class USurface*                                    pMarkerImage;                                     		// 0x000010 (0x0004)              
	unsigned long                                      bEnabled : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
};
//0x000008
//HUDMessageCategoryItem[0x1D091318]
struct FHUDMessageCategoryItem
{
	class USurface*                                    pCategoryImage;                                   		// 0x000000 (0x0004)              
	DWORD                                              pCategory;                                        		// 0x000004 (0x0004)              
};
//0x000008
//DistrictMapMessage[0x1D0912B0]
struct FDistrictMapMessage
{
	class USurface*                                    pCategoryImage;                                   		// 0x000000 (0x0004)              
	class UcUI_HUD_HudMessage*                         pHUDMessage;                                      		// 0x000004 (0x0004)              
};
//0x000014
//DistrictMapMessageListItem[0x1D091248]
struct FDistrictMapMessageListItem
{
	class USurface*                                    pCategoryImage;                                   		// 0x000000 (0x0004)              
	struct FString                                     sDisplayText;                                     		// 0x000004 (0x000C)              
	class UcUI_HUD_HudMessage*                         pHUDMessage;                                      		// 0x000010 (0x0004)              
};
//0x00002C
//ActionMessage[0x1D0911E0]
struct FActionMessage
{
	class UcUI_HUD_HudMessage*                         pHUDMessage;                                      		// 0x000000 (0x0004)              
	struct FString                                     sOriginalText;                                    		// 0x000004 (0x000C)              
	struct FString                                     sDisplayText;                                     		// 0x000010 (0x000C)              
	struct FString                                     sColourTag;                                       		// 0x00001C (0x000C)              
	float                                              fDisplayTime;                                     		// 0x000028 (0x0004)              
};
//0x000014
//UIMSContextOption[0x1D091178]
struct FUIMSContextOption
{
	struct FString                                     sName;                                            		// 0x000000 (0x000C)              
	unsigned long                                      bEnabled : 1;                                     		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      bLocalized : 1;                                   		// 0x00000C (0x0004) [0x00000002] 
	DWORD                                              pUserData;                                        		// 0x000010 (0x0004)              
};
//0x00001C
//PrimitivePageData[0x1D091110]
struct FPrimitivePageData
{
	int                                                nPageIndex;                                       		// 0x000000 (0x0004)              
	TArray<int>                                        aPrimitives;                                      		// 0x000004 (0x000C)              
	TArray<unsigned long>                              aIsUnlocked;                                      		// 0x000010 (0x000C)              
};
//0x000030
//SymbolItem[0x1D0910A8]
struct FSymbolItem
{
	class USurface*                                    pDisplayImage;                                    		// 0x000000 (0x0004)              
	TArray<unsigned char>                              aData;                                            		// 0x000004 (0x000C)              
	struct FString                                     sDisplayText;                                     		// 0x000010 (0x000C)              
	struct FString                                     sItemGUID;                                        		// 0x00001C (0x000C)              
	unsigned long                                      bSelfCreated : 1;                                 		// 0x000028 (0x0004) [0x00000001] 
	DWORD                                              pSymbolItemType;                                  		// 0x00002C (0x0004)              
};
//0x00000C
//ComplexityItem[0x1D091040]
struct FComplexityItem
{
	class UObject*                                     pDescriptor;                                      		// 0x000000 (0x0004)              
	float                                              fRatio;                                           		// 0x000004 (0x0004)              
	DWORD                                              Col;                                              		// 0x000008 (0x0004)              
};
//0x000008
//LayeringSwapItem[0x1D090FD8]
struct FLayeringSwapItem
{
	class UcClothingPartInfo*                          pPart;                                            		// 0x000000 (0x0004)              
	DWORD                                              pPossibleSwap;                                    		// 0x000004 (0x0004)              
};
//0x000064
//tMS_Stats_PlayerData[0x1D090F70]
struct FtMS_Stats_PlayerData
{
	struct FString                                     m_sPlayerName;                                    		// 0x000000 (0x000C)              
	struct FString                                     m_sTeamName;                                      		// 0x00000C (0x000C)              
	unsigned long                                      m_bMVP : 1;                                       		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      m_bOnline : 1;                                    		// 0x000018 (0x0004) [0x00000002] 
	unsigned long                                      m_bCriminal : 1;                                  		// 0x000018 (0x0004) [0x00000004] 
	int                                                m_nKills;                                         		// 0x00001C (0x0004)              
	int                                                m_nAssists;                                       		// 0x000020 (0x0004)              
	int                                                m_nDeaths;                                        		// 0x000024 (0x0004)              
	int                                                m_nTargets;                                       		// 0x000028 (0x0004)              
	int                                                m_nArrests;                                       		// 0x00002C (0x0004)              
	int                                                m_nArrested;                                      		// 0x000030 (0x0004)              
	int                                                m_nCash;                                          		// 0x000034 (0x0004)              
	int                                                m_bHideContactStanding;                           		// 0x000038 (0x0004)              
	int                                                m_nContactStanding;                               		// 0x00003C (0x0004)              
	int                                                m_nTime;                                          		// 0x000040 (0x0004)              
	int                                                m_nThreat;                                        		// 0x000044 (0x0004)              
	int                                                m_MedalsBitfield[0x7];                            		// 0x000048 (0x001C)              
};
//0x000008
//DSPCheckboxOverrides[0x1D090F08]
struct FDSPCheckboxOverrides
{
	float                                              m_nVertOffset;                                    		// 0x000000 (0x0004)              
	float                                              m_nHorzOffset;                                    		// 0x000004 (0x0004)              
};
//0x00000C
//DSPComboOverrides[0x1D090EA0]
struct FDSPComboOverrides
{
	float                                              m_nVertOffset;                                    		// 0x000000 (0x0004)              
	float                                              m_nHorzOffset;                                    		// 0x000004 (0x0004)              
	float                                              m_nWidth;                                         		// 0x000008 (0x0004)              
};
//0x000010
//DSPKnobOverrides[0x1D090E38]
struct FDSPKnobOverrides
{
	class UTexture2D*                                  m_pBGTexture;                                     		// 0x000000 (0x0004)              
	class UTexture2D*                                  m_pKnobTexture;                                   		// 0x000004 (0x0004)              
	int                                                m_nVertOffset;                                    		// 0x000008 (0x0004)              
	int                                                m_nLabelWidth;                                    		// 0x00000C (0x0004)              
};
//0x000010
//UIMSDspParameterBinding[0x1D090DD0]
struct FUIMSDspParameterBinding
{
	int                                                nParameterIndex;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bONParameter : 1;                                 		// 0x000004 (0x0004) [0x00000001] 
	class UUIDataStoreSubscriber*                      pDataSubscriber;                                  		// 0x000008 (0x0004)              
};
//0x000034
//UIMSDspInfo[0x1D090D68]
struct FUIMSDspInfo
{
	class UUIPanel*                                    pMainPanel;                                       		// 0x000000 (0x0004)              
	class UUIComboBox*                                 pDspTypeComboBox;                                 		// 0x000004 (0x0004)              
	class UUIButton*                                   pRemoveBtn;                                       		// 0x000008 (0x0004)              
	class UUIButton*                                   pMoveLeftBtn;                                     		// 0x00000C (0x0004)              
	class UUIButton*                                   pMoveRightBtn;                                    		// 0x000010 (0x0004)              
	class UUICheckbox*                                 pEnableChk;                                       		// 0x000014 (0x0004)              
	class UUIPanel*                                    pWorkPanel;                                       		// 0x000018 (0x0004)              
	class UcUIComp_AutoAlignment*                      pAlignComp;                                       		// 0x00001C (0x0004)              
	TArray<struct FUIMSDspParameterBinding>            aBindings;                                        		// 0x000020 (0x000C)              
	int                                                nDspChainIndex;                                   		// 0x00002C (0x0004)              
	int                                                nCurrDspType;                                     		// 0x000030 (0x0004)              
};
//0x000018
//UIMSGridCoord[0x1D090D00]
struct FUIMSGridCoord
{
	int                                                nRow;                                             		// 0x000000 (0x0004)              
	int                                                nCol;                                             		// 0x000004 (0x0004)              
	FVector2                                           MousePos;                                         		// 0x000008 (0x0008)              
	FVector2                                           MousePosCellPerc;                                 		// 0x000010 (0x0008)              
};
//0x00000C
//UIMSGridCellStyleData[0x1D090C98]
struct FUIMSGridCellStyleData
{
	class UUIStyle_Combo*                              StyleCombo;                                       		// 0x000000 (0x0004)              
	class UUIStyle_Image*                              ImageStyle;                                       		// 0x000004 (0x0004)              
	class UUIStyle_Text*                               TextStyle;                                        		// 0x000008 (0x0004)              
};
//0x000064
//UIMSGridCellStyle[0x1D090C30]
struct FUIMSGridCellStyle
{
	struct FUIMSGridCellStyleData                      aStyleData[0x5];                                  		// 0x000000 (0x003C)              
	class USurface*                                    ValueTexture;                                     		// 0x00003C (0x0004)              
	struct FName                                       MouseCursorName;                                  		// 0x000040 (0x0008)              
	float                                              Alpha;                                            		// 0x000048 (0x0004)              
	struct FLinearColor                                ImageColour;                                      		// 0x00004C (0x0010)              
	int                                                nDefaultState;                                    		// 0x00005C (0x0004)              
	unsigned long                                      bForceStateUse : 1;                               		// 0x000060 (0x0004) [0x00000001] 
	unsigned long                                      bUseLinearColour : 1;                             		// 0x000060 (0x0004) [0x00000002] 
};
//0x000019
//UIMSGridCell[0x1D090BC8]
struct FUIMSGridCell
{
	int                                                Val;                                              		// 0x000000 (0x0004)              
	float                                              Alpha;                                            		// 0x000004 (0x0004)              
	class USurface*                                    ValueTexture;                                     		// 0x000008 (0x0004)              
	class UUIString*                                   ValueString;                                      		// 0x00000C (0x0004)              
	DWORD                                              pCellStyle;                                       		// 0x000010 (0x0004)              
	unsigned long                                      bTextNeedsReformatting : 1;                       		// 0x000014 (0x0004) [0x00000001] 
	unsigned char                                      nState;                                           		// 0x000018 (0x0001)              PROPERTY: etMSGridCellState
};
//0x000034
//UIMSGridCellRenderData[0x1D090B60]
struct FUIMSGridCellRenderData
{
	int                                                nRow;                                             		// 0x000000 (0x0004)              
	int                                                nCol;                                             		// 0x000004 (0x0004)              
	DWORD                                              pCell;                                            		// 0x000008 (0x0004)              
	class USurface*                                    pSurface;                                         		// 0x00000C (0x0004)              
	struct FLinearColor                                ImageColor;                                       		// 0x000010 (0x0010)              
	float                                              Alpha;                                            		// 0x000020 (0x0004)              
	float                                              X;                                                		// 0x000024 (0x0004)              
	float                                              Y;                                                		// 0x000028 (0x0004)              
	float                                              XL;                                               		// 0x00002C (0x0004)              
	float                                              YL;                                               		// 0x000030 (0x0004)              
};
//0x00000C
//UIMSGridRow[0x1D090AF8]
struct FUIMSGridRow
{
	TArray<struct FUIMSGridCell>                       aCells;                                           		// 0x000000 (0x000C)              
};
//0x00000C
//MultiPartProgressBar_Section[0x1D090A90]
struct FMultiPartProgressBar_Section
{
	float                                              fRatio;                                           		// 0x000000 (0x0004)              
	unsigned long                                      bMouseOver : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
	DWORD                                              Col;                                              		// 0x000008 (0x0004)              
};
//0x000018
//tUISelectableMaskImage_Mask[0x1D090A28]
struct FtUISelectableMaskImage_Mask
{
	class UcUITexturePickable*                         Texture;                                          		// 0x000000 (0x0004)              
	int                                                Border[0x4];                                      		// 0x000004 (0x0010)              
	unsigned long                                      m_bIsSelected : 1;                                		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      m_bIsMouseOver : 1;                               		// 0x000014 (0x0004) [0x00000002] 
	unsigned long                                      m_bIsDisabled : 1;                                		// 0x000014 (0x0004) [0x00000004] 
};
//0x00001C
//WWiseAudioThemeMapping[0x1D0909C0]
struct FWWiseAudioThemeMapping
{
	struct FName                                       SoundEventName;                                   		// 0x000000 (0x0008)              
	struct FEnumeratedName                             SoundEvent;                                       		// 0x000008 (0x0010)              
	int                                                SoundEventOrdinal;                                		// 0x000018 (0x0004)              
};
//0x000018
//WWiseComponentThemeMapping[0x1D090958]
struct FWWiseComponentThemeMapping
{
	struct FString                                     ComponentName;                                    		// 0x000000 (0x000C)              
	TArray<struct FWWiseAudioThemeMapping>             Bindings;                                         		// 0x00000C (0x000C)              
};

/*
-----------------------------------------------------------------
 - Classes
-----------------------------------------------------------------
*/
//0x000020 (0x000060 - 0x000040)
//cUIListProvider[0x103DF240]
class UcUIListProvider : public UObject
{
public:
	DWORD                                              VfTable_IUIListElementProvider;                   		// 0x000040 (0x0004)              
	DWORD                                              VfTable_IUIListElementCellProvider;               		// 0x000044 (0x0004)              
	struct FName                                       m_FieldName;                                      		// 0x000048 (0x0008)              
	class UcUIDataStore*                               m_pParentDataStore;                               		// 0x000050 (0x0004)              
	TArray<struct FUIIcon>                             m_aIcons;                                         		// 0x000054 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIListProvider");
		return pClassPointer;
	};
};
UClass* UcUIListProvider::pClassPointer = NULL;

//0x000044 (0x0000F8 - 0x0000B4)
//cUIAction_HostingOp[0x103DAB00]
class UcUIAction_HostingOp : public UUIAction
{
public:
	unsigned long                                      m_bIsDone : 1;                                    		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      m_bSupressProgressScene : 1;                      		// 0x0000B4 (0x0004) [0x00000002] 
	unsigned long                                      m_bMessageResult : 1;                             		// 0x0000B4 (0x0004) [0x00000004] 
	unsigned long                                      m_bConsumeGameInput : 1;                          		// 0x0000B4 (0x0004) [0x00000008] 
	struct FString                                     m_sProgressSceneName;                             		// 0x0000B8 (0x000C)              
	struct FString                                     m_sErrorMessage;                                  		// 0x0000C4 (0x000C)              
	class UUIScene*                                    m_pProgressScene;                                 		// 0x0000D0 (0x0004)              
	struct FName                                       m_ProgressSceneTag;                               		// 0x0000D4 (0x0008)              
	class UUIScene*                                    m_pOpenedScene;                                   		// 0x0000DC (0x0004)              
	struct FString                                     m_sTitleMarkup;                                   		// 0x0000E0 (0x000C)              
	struct FString                                     m_sMessageMarkup;                                 		// 0x0000EC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HostingOp");
		return pClassPointer;
	};

public:
	void ExportErrorMessage();//APBUserInterface.cUIAction_HostingOp.ExportErrorMessage
	bool OnFadeCompleted();//APBUserInterface.cUIAction_HostingOp.OnFadeCompleted
	void SetupScene(class UcUIScene_BaseScene* Scene);//APBUserInterface.cUIAction_HostingOp.SetupScene
	void ResetErrorMessage();//APBUserInterface.cUIAction_HostingOp.ResetErrorMessage
};
UClass* UcUIAction_HostingOp::pClassPointer = NULL;

//0x000010 (0x0000BC - 0x0000AC)
//cAction_SetRotation[0x17D0DBB0]
class UcAction_SetRotation : public USequenceAction
{
public:
	int                                                m_nPitch;                                         		// 0x0000AC (0x0004)              
	int                                                m_nYaw;                                           		// 0x0000B0 (0x0004)              
	int                                                m_nRoll;                                          		// 0x0000B4 (0x0004)              
	unsigned long                                      m_bIncrementRotation : 1;                         		// 0x0000B8 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cAction_SetRotation");
		return pClassPointer;
	};
};
UClass* UcAction_SetRotation::pClassPointer = NULL;

//0x000024 (0x0000F8 - 0x0000D4)
//cEvent_APBRemoteEvent[0x17D0DA80]
class UcEvent_APBRemoteEvent : public USeqEvent_RemoteEvent
{
public:
	TArray<float>                                      m_aFloatValues;                                   		// 0x0000D4 (0x000C)              
	TArray<struct FString>                             m_aStringValues;                                  		// 0x0000E0 (0x000C)              
	TArray<class UObject*>                             m_aObjectValues;                                  		// 0x0000EC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cEvent_APBRemoteEvent");
		return pClassPointer;
	};
};
UClass* UcEvent_APBRemoteEvent::pClassPointer = NULL;

//0x000004 (0x000044 - 0x000040)
//cFlushDataStoresForPIE[0x17D0D950]
class UcFlushDataStoresForPIE : public UObject
{
public:
	DWORD                                              VfTable_FCallbackEventDevice;                     		// 0x000040 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cFlushDataStoresForPIE");
		return pClassPointer;
	};
};
UClass* UcFlushDataStoresForPIE::pClassPointer = NULL;

//0x000008 (0x000100 - 0x0000F8)
//cGammaPreviewTexture[0x17D0D820]
class UcGammaPreviewTexture : public UTextureRenderTarget2D
{
public:
	class UTexture2D*                                  m_pTexture;                                       		// 0x0000F8 (0x0004)              
	float                                              m_fTargetGamma;                                   		// 0x0000FC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cGammaPreviewTexture");
		return pClassPointer;
	};

public:
	void UpdateTexture(float i_fTargetGamma);//APBUserInterface.cGammaPreviewTexture.UpdateTexture
};
UClass* UcGammaPreviewTexture::pClassPointer = NULL;

//0x000004 (0x000044 - 0x000040)
//cInterpTrackInstUIMaterialScalarParam[0x17D0D6F0]
class UcInterpTrackInstUIMaterialScalarParam : public UInterpTrackInst
{
public:
	float                                              ResetParam;                                       		// 0x000040 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIMaterialScalarParam");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIMaterialScalarParam::pClassPointer = NULL;

//0x00000C (0x00004C - 0x000040)
//cInterpTrackInstUIMaterialVectorParam[0x17D0D5C0]
class UcInterpTrackInstUIMaterialVectorParam : public UInterpTrackInst
{
public:
	FVector3                                           ResetVector;                                      		// 0x000040 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIMaterialVectorParam");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIMaterialVectorParam::pClassPointer = NULL;

//0x000004 (0x000044 - 0x000040)
//cInterpTrackInstUIOpacity[0x17D0D490]
class UcInterpTrackInstUIOpacity : public UInterpTrackInst
{
public:
	float                                              ResetOpacity;                                     		// 0x000040 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIOpacity");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIOpacity::pClassPointer = NULL;

//0x000018 (0x000058 - 0x000040)
//cInterpTrackInstUIPosition[0x17D0D360]
class UcInterpTrackInstUIPosition : public UInterpTrackInst
{
public:
	FVector3                                           InitialVector;                                    		// 0x000040 (0x000C)              
	FVector3                                           ResetVector;                                      		// 0x00004C (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIPosition");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIPosition::pClassPointer = NULL;

//0x00000C (0x00004C - 0x000040)
//cInterpTrackInstUIRotation[0x17D0D230]
class UcInterpTrackInstUIRotation : public UInterpTrackInst
{
public:
	FRotator                                           ResetRotation;                                    		// 0x000040 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIRotation");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIRotation::pClassPointer = NULL;

//0x00000C (0x00004C - 0x000040)
//cInterpTrackInstUIScale[0x17D0D100]
class UcInterpTrackInstUIScale : public UInterpTrackInst
{
public:
	FVector3                                           ResetVector;                                      		// 0x000040 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackInstUIScale");
		return pClassPointer;
	};
};
UClass* UcInterpTrackInstUIScale::pClassPointer = NULL;

//0x000008 (0x000078 - 0x000070)
//cInterpTrackUIMaterialScalarParam[0x17D0CFD0]
class UcInterpTrackUIMaterialScalarParam : public UInterpTrackFloatBase
{
public:
	struct FName                                       ParamName;                                        		// 0x000070 (0x0008)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIMaterialScalarParam");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIMaterialScalarParam::pClassPointer = NULL;

//0x000008 (0x000078 - 0x000070)
//cInterpTrackUIMaterialVectorParam[0x17D0CEA0]
class UcInterpTrackUIMaterialVectorParam : public UInterpTrackVectorBase
{
public:
	struct FName                                       ParamName;                                        		// 0x000070 (0x0008)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIMaterialVectorParam");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIMaterialVectorParam::pClassPointer = NULL;

//0x000000 (0x000070 - 0x000070)
//cInterpTrackUIOpacity[0x17D0CD70]
class UcInterpTrackUIOpacity : public UInterpTrackFloatBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIOpacity");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIOpacity::pClassPointer = NULL;

//0x000001 (0x000071 - 0x000070)
//cInterpTrackUIPosition[0x17D0CC40]
class UcInterpTrackUIPosition : public UInterpTrackVectorBase
{
public:
	unsigned char                                      eRelativePosition;                                		// 0x000070 (0x0001)              PROPERTY: EUIRelativePosition

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIPosition");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIPosition::pClassPointer = NULL;

//0x000010 (0x000080 - 0x000070)
//cInterpTrackUIRotation[0x17D0CB10]
class UcInterpTrackUIRotation : public UInterpTrackVectorBase
{
public:
	struct FInterpCurveFloat                           FloatTrack;                                       		// 0x000070 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIRotation");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIRotation::pClassPointer = NULL;

//0x000000 (0x000070 - 0x000070)
//cInterpTrackUIScale[0x17D0C9E0]
class UcInterpTrackUIScale : public UInterpTrackVectorBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cInterpTrackUIScale");
		return pClassPointer;
	};
};
UClass* UcInterpTrackUIScale::pClassPointer = NULL;

//0x000008 (0x00027C - 0x000274)
//cPlaceholderSkeletalMesh[0x17D0C8B0]
class AcPlaceholderSkeletalMesh : public ASkeletalMeshActor
{
public:
	unsigned long                                      m_bKeepAnimations : 1;                            		// 0x000274 (0x0004) [0x00000001] 
	class USkeletalMeshComponent*                      m_pOriginalSkeletalMeshComponent;                 		// 0x000278 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cPlaceholderSkeletalMesh");
		return pClassPointer;
	};

public:
	void OnAssignSelectedCharacterToPlaceholder(class UcSeqAct_AssignSelectedCharacterToPlaceholder* i_pAction);//APBUserInterface.cPlaceholderSkeletalMesh.OnAssignSelectedCharacterToPlaceholder
	void UpdateSkeletalMesh(class USkeletalMeshComponent* NewComponent);//APBUserInterface.cPlaceholderSkeletalMesh.UpdateSkeletalMesh
	bool OnSequenceAction(class USequenceAction* Action);//APBUserInterface.cPlaceholderSkeletalMesh.OnSequenceAction
};
UClass* AcPlaceholderSkeletalMesh::pClassPointer = NULL;

//0x000000 (0x000040 - 0x000040)
//cSDDUI[0x17D0C780]
class UcSDDUI : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSDDUI");
		return pClassPointer;
	};

public:
	unsigned char CastPopupDialogCategory(int I);//APBUserInterface.cSDDUI.CastPopupDialogCategory
	unsigned char CastHUDUsables_DisplaySetting(int I);//APBUserInterface.cSDDUI.CastHUDUsables_DisplaySetting
	unsigned char CastDialogResult(int I);//APBUserInterface.cSDDUI.CastDialogResult
	unsigned char CastChatCommandWorksFromState(int I);//APBUserInterface.cSDDUI.CastChatCommandWorksFromState
	unsigned char CastChatMessageCategory(int I);//APBUserInterface.cSDDUI.CastChatMessageCategory
	unsigned char CastScaleformInterface(int I);//APBUserInterface.cSDDUI.CastScaleformInterface
	unsigned char CastLoginState(int I);//APBUserInterface.cSDDUI.CastLoginState
	unsigned char CastScaleformLayoutMode(int I);//APBUserInterface.cSDDUI.CastScaleformLayoutMode
	unsigned char CastScaleformCriticalTimer(int I);//APBUserInterface.cSDDUI.CastScaleformCriticalTimer
	unsigned char CastGameFlowDialog(int I);//APBUserInterface.cSDDUI.CastGameFlowDialog
	unsigned char CastChatCommandType(int I);//APBUserInterface.cSDDUI.CastChatCommandType
	unsigned char CastPopupDialogArea(int I);//APBUserInterface.cSDDUI.CastPopupDialogArea
};
UClass* UcSDDUI::pClassPointer = NULL;

//0x000004 (0x0000D4 - 0x0000D0)
//cSeqAct_CameraFadeEx[0x17D0C650]
class UcSeqAct_CameraFadeEx : public USeqAct_CameraFade
{
public:
	unsigned long                                      bStartFromCurrentValue : 1;                       		// 0x0000D0 (0x0004) [0x00000001] 
	unsigned long                                      bIsActive : 1;                                    		// 0x0000D0 (0x0004) [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqAct_CameraFadeEx");
		return pClassPointer;
	};
};
UClass* UcSeqAct_CameraFadeEx::pClassPointer = NULL;

//0x000000 (0x0000AC - 0x0000AC)
//cSeqAct_CheckGameFlowStateInterrupt[0x17D0C520]
class UcSeqAct_CheckGameFlowStateInterrupt : public USequenceAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqAct_CheckGameFlowStateInterrupt");
		return pClassPointer;
	};
};
UClass* UcSeqAct_CheckGameFlowStateInterrupt::pClassPointer = NULL;

//0x000000 (0x000134 - 0x000134)
//cSeqAct_InterpEx[0x17D0C3F0]
class UcSeqAct_InterpEx : public USeqAct_Interp
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqAct_InterpEx");
		return pClassPointer;
	};
};
UClass* UcSeqAct_InterpEx::pClassPointer = NULL;

//0x000000 (0x0000AC - 0x0000AC)
//cSeqAction_FinishStateChange[0x17D0C2C0]
class UcSeqAction_FinishStateChange : public USequenceAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqAction_FinishStateChange");
		return pClassPointer;
	};
};
UClass* UcSeqAction_FinishStateChange::pClassPointer = NULL;

//0x00000C (0x0000D4 - 0x0000C8)
//cSeqEvent_GameFlowState[0x17D0C190]
class UcSeqEvent_GameFlowState : public USequenceEvent
{
public:
	unsigned long                                      bWaitUntilFinished : 1;                           		// 0x0000C8 (0x0004) [0x00000001] 
	int                                                m_ePreviousState;                                 		// 0x0000CC (0x0004)              
	int                                                m_ePendingState;                                  		// 0x0000D0 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqEvent_GameFlowState");
		return pClassPointer;
	};
};
UClass* UcSeqEvent_GameFlowState::pClassPointer = NULL;

//0x000000 (0x0000C8 - 0x0000C8)
//cSeqEvent_GameFlowStateChangeInterrupted[0x17D0C060]
class UcSeqEvent_GameFlowStateChangeInterrupted : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqEvent_GameFlowStateChangeInterrupted");
		return pClassPointer;
	};
};
UClass* UcSeqEvent_GameFlowStateChangeInterrupted::pClassPointer = NULL;

//0x000000 (0x000078 - 0x000078)
//cSeqVar_HostingClient[0x17D0BF30]
class UcSeqVar_HostingClient : public USeqVar_Object
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqVar_HostingClient");
		return pClassPointer;
	};
};
UClass* UcSeqVar_HostingClient::pClassPointer = NULL;

//0x000000 (0x000078 - 0x000078)
//cSeqVar_HostingDistrictServer[0x17D0BE00]
class UcSeqVar_HostingDistrictServer : public USeqVar_Object
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqVar_HostingDistrictServer");
		return pClassPointer;
	};
};
UClass* UcSeqVar_HostingDistrictServer::pClassPointer = NULL;

//0x000000 (0x00006C - 0x00006C)
//cSeqVar_Rating[0x17D0BCD0]
class UcSeqVar_Rating : public USeqVar_Int
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSeqVar_Rating");
		return pClassPointer;
	};
};
UClass* UcSeqVar_Rating::pClassPointer = NULL;

//0x000048 (0x000088 - 0x000040)
//cSupportScreenManager[0x17D0BBA0]
class UcSupportScreenManager : public UObject
{
public:
	TArray<class USwfMovie*>                           m_pAlwaysLoadReferences;                          		// 0x000040 (0x000C)              
	class UcBrowserUIController*                       m_pOpenBrowser;                                   		// 0x00004C (0x0004)              
	struct FString                                     m_sFallbackURL;                                   		// 0x000050 (0x000C)              
	struct FEnumeratedName                             m_SSOSupportPage;                                 		// 0x00005C (0x0010)              
	class UcOptionScreenUIController*                  m_pOptionScreen;                                  		// 0x00006C (0x0004)              
	class UcPerformanceUIController*                   m_pPerformanceCounter;                            		// 0x000070 (0x0004)              
	class UcCriticalTimerUIController*                 m_pCriticalTimer;                                 		// 0x000074 (0x0004)              
	class UcTutorialUIController*                      m_pTutorialUIController;                          		// 0x000078 (0x0004)              
	struct FScriptDelegate                             __WebBrowserClosedCallback__Delegate;             		// 0x00007C (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cSupportScreenManager");
		return pClassPointer;
	};

public:
	void CloseOptionScreen(bool i_bForce);//APBUserInterface.cSupportScreenManager.CloseOptionScreen
	void OpenOptionScreen();//APBUserInterface.cSupportScreenManager.OpenOptionScreen
	void OnWebBrowserClosed(class UcBrowserUIController* i_pBrowser);//APBUserInterface.cSupportScreenManager.OnWebBrowserClosed
	bool IsTutorialScreenOpen();//APBUserInterface.cSupportScreenManager.IsTutorialScreenOpen
	void OnOptionsClosed();//APBUserInterface.cSupportScreenManager.OnOptionsClosed
	void ToggleOptionScreen();//APBUserInterface.cSupportScreenManager.ToggleOptionScreen
	void OnCounterClosed();//APBUserInterface.cSupportScreenManager.OnCounterClosed
	void WebBrowserClosedCallback();//APBUserInterface.cSupportScreenManager.WebBrowserClosedCallback
	void OpenSupportPage(struct FName SupportPage,TArray<struct FString> Parameters,bool bInternal);//APBUserInterface.cSupportScreenManager.OpenSupportPage
	bool IsOptionsScreenOpen();//APBUserInterface.cSupportScreenManager.IsOptionsScreenOpen
	void OpenTutorialScreen();//APBUserInterface.cSupportScreenManager.OpenTutorialScreen
	void CloseTutorialScreen();//APBUserInterface.cSupportScreenManager.CloseTutorialScreen
	void ToggleTutorialScreen();//APBUserInterface.cSupportScreenManager.ToggleTutorialScreen
	class UcSupportScreenManager* GetInstance();//APBUserInterface.cSupportScreenManager.GetInstance
	void OnCriticalTimerClosed();//APBUserInterface.cSupportScreenManager.OnCriticalTimerClosed
	void OpenWebBrowser(struct FString URL,struct FString sBrowserTitle,bool bInternal,struct FScriptDelegate BrowserClosedCallback,struct FString sCallbackURL);//APBUserInterface.cSupportScreenManager.OpenWebBrowser
};
UClass* UcSupportScreenManager::pClassPointer = NULL;

//0x000008 (0x000048 - 0x000040)
//cUI_Soc_GroupAccept[0x17D0BA70]
class UcUI_Soc_GroupAccept : public UObject
{
public:
	int                                                m_QuestionHandle;                                 		// 0x000040 (0x0004)              
	unsigned long                                      m_bQuestionAcceptable : 1;                        		// 0x000044 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUI_Soc_GroupAccept");
		return pClassPointer;
	};

public:
	void InviteAccepted(unsigned char Answer);//APBUserInterface.cUI_Soc_GroupAccept.InviteAccepted
	void InviteReceived(struct FString sPlayerName);//APBUserInterface.cUI_Soc_GroupAccept.InviteReceived
};
UClass* UcUI_Soc_GroupAccept::pClassPointer = NULL;

//0x000004 (0x000044 - 0x000040)
//cUI_TM_TeamInviteAccept[0x17D0B940]
class UcUI_TM_TeamInviteAccept : public UObject
{
public:
	int                                                m_QuestionHandle;                                 		// 0x000040 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUI_TM_TeamInviteAccept");
		return pClassPointer;
	};

public:
	void InviteReceived(struct FString sPlayerName,struct FString sTeamName);//APBUserInterface.cUI_TM_TeamInviteAccept.InviteReceived
	void InviteAccepted(unsigned char Answer);//APBUserInterface.cUI_TM_TeamInviteAccept.InviteAccepted
};
UClass* UcUI_TM_TeamInviteAccept::pClassPointer = NULL;

//0x00001C (0x0000D0 - 0x0000B4)
//cUIAction_AutoCompleteEditBoxText[0x17D0B810]
class UcUIAction_AutoCompleteEditBoxText : public UUIAction
{
public:
	class UUIEditBox*                                  m_pEditBox;                                       		// 0x0000B4 (0x0004)              
	struct FString                                     m_sLastAutoCompletion;                            		// 0x0000B8 (0x000C)              
	struct FString                                     m_sOldText;                                       		// 0x0000C4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_AutoCompleteEditBoxText");
		return pClassPointer;
	};
};
UClass* UcUIAction_AutoCompleteEditBoxText::pClassPointer = NULL;

//0x000000 (0x0000D0 - 0x0000D0)
//cUIAction_AutoCompleteEditBoxText_PlayerName[0x17D0B6E0]
class UcUIAction_AutoCompleteEditBoxText_PlayerName : public UcUIAction_AutoCompleteEditBoxText
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_AutoCompleteEditBoxText_PlayerName");
		return pClassPointer;
	};
};
UClass* UcUIAction_AutoCompleteEditBoxText_PlayerName::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_BoolToString[0x17D0B5B0]
class UcUIAction_BoolToString : public UUIAction
{
public:
	unsigned long                                      Value : 1;                                        		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_BoolToString");
		return pClassPointer;
	};
};
UClass* UcUIAction_BoolToString::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_BuildCharacterMesh[0x17D0B480]
class UcUIAction_BuildCharacterMesh : public UUIAction
{
public:
	class UObject*                                     m_pGolemDescriptor;                               		// 0x0000B4 (0x0004)              
	class UObject*                                     m_pMeshComponent;                                 		// 0x0000B8 (0x0004)              
	int                                                m_nState;                                         		// 0x0000BC (0x0004)              
	DWORD                                              m_InstanceHandle;                                 		// 0x0000C0 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_BuildCharacterMesh");
		return pClassPointer;
	};
};
UClass* UcUIAction_BuildCharacterMesh::pClassPointer = NULL;

//0x00003C (0x0000F0 - 0x0000B4)
//cUIAction_BuildClothingPreviewMesh[0x17D0B350]
class UcUIAction_BuildClothingPreviewMesh : public UUIAction
{
public:
	struct FString                                     InventoryItemGUID;                                		// 0x0000B4 (0x000C)              
	int                                                InventoryItemType;                                		// 0x0000C0 (0x0004)              
	struct FString                                     InventoryItemPreviewDataStore;                    		// 0x0000C4 (0x000C)              
	unsigned long                                      ShowSpecifiedItemOnly : 1;                        		// 0x0000D0 (0x0004) [0x00000001] 
	struct FString                                     CharacterTemplate;                                		// 0x0000D4 (0x000C)              
	class UObject*                                     m_pGolemDescriptor;                               		// 0x0000E0 (0x0004)              
	class UObject*                                     m_pMeshComponent;                                 		// 0x0000E4 (0x0004)              
	int                                                m_nState;                                         		// 0x0000E8 (0x0004)              
	DWORD                                              m_InstanceHandle;                                 		// 0x0000EC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_BuildClothingPreviewMesh");
		return pClassPointer;
	};
};
UClass* UcUIAction_BuildClothingPreviewMesh::pClassPointer = NULL;

//0x000030 (0x0000E4 - 0x0000B4)
//cUIAction_BuildVehicleMesh[0x17D0B220]
class UcUIAction_BuildVehicleMesh : public UUIAction
{
public:
	struct FString                                     InventoryItemGUID;                                		// 0x0000B4 (0x000C)              
	int                                                InventoryItemType;                                		// 0x0000C0 (0x0004)              
	struct FString                                     InventoryItemPreviewDataStore;                    		// 0x0000C4 (0x000C)              
	class UObject*                                     m_pGolemDescriptor;                               		// 0x0000D0 (0x0004)              
	class UObject*                                     m_pMeshComponent;                                 		// 0x0000D4 (0x0004)              
	unsigned char                                      m_VehicleType;                                    		// 0x0000D8 (0x0001)              PROPERTY: etVehicleSetupType
	unsigned char                                      _0x0000D9[0x3];                                   		// 0x0000D9 (0x0003) MISSED OFFSET
	int                                                m_nState;                                         		// 0x0000DC (0x0004)              
	DWORD                                              m_InstanceHandle;                                 		// 0x0000E0 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_BuildVehicleMesh");
		return pClassPointer;
	};
};
UClass* UcUIAction_BuildVehicleMesh::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Calculator[0x17D0B0F0]
class UcUIAction_Calculator : public UUIAction
{
public:
	float                                              m_fA;                                             		// 0x0000B4 (0x0004)              
	float                                              m_fB;                                             		// 0x0000B8 (0x0004)              
	unsigned long                                      m_bAdd : 1;                                       		// 0x0000BC (0x0004) [0x00000001] 
	unsigned long                                      m_bSubtract : 1;                                  		// 0x0000BC (0x0004) [0x00000002] 
	unsigned long                                      m_bMultiply : 1;                                  		// 0x0000BC (0x0004) [0x00000004] 
	unsigned long                                      m_bDivide : 1;                                    		// 0x0000BC (0x0004) [0x00000008] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Calculator");
		return pClassPointer;
	};
};
UClass* UcUIAction_Calculator::pClassPointer = NULL;

//0x00001C (0x0000D0 - 0x0000B4)
//cUIAction_ChangeAllRemoteEvents[0x17D0AFC0]
class UcUIAction_ChangeAllRemoteEvents : public UUIAction
{
public:
	struct FString                                     OldEventName;                                     		// 0x0000B4 (0x000C)              
	struct FString                                     NewEventName;                                     		// 0x0000C0 (0x000C)              
	unsigned long                                      bReplaceEventCalls : 1;                           		// 0x0000CC (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ChangeAllRemoteEvents");
		return pClassPointer;
	};
};
UClass* UcUIAction_ChangeAllRemoteEvents::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_CheckDistrictThreat[0x17D0AE90]
class UcUIAction_CheckDistrictThreat : public UUIAction
{
public:
	class UUIList*                                     m_pDistrictList;                                  		// 0x0000B4 (0x0004)              
	struct FString                                     m_sErrorMessage;                                  		// 0x0000B8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CheckDistrictThreat");
		return pClassPointer;
	};
};
UClass* UcUIAction_CheckDistrictThreat::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_CleanupCCStudio[0x17D0AD60]
class UcUIAction_CleanupCCStudio : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CleanupCCStudio");
		return pClassPointer;
	};
};
UClass* UcUIAction_CleanupCCStudio::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_CloseAllMainScenes[0x17D0AC30]
class UcUIAction_CloseAllMainScenes : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CloseAllMainScenes");
		return pClassPointer;
	};
};
UClass* UcUIAction_CloseAllMainScenes::pClassPointer = NULL;

//0x000018 (0x0000CC - 0x0000B4)
//cUIAction_CompareFileDates[0x17D0AB00]
class UcUIAction_CompareFileDates : public UUIAction
{
public:
	struct FString                                     m_sDateA;                                         		// 0x0000B4 (0x000C)              
	struct FString                                     m_sDateB;                                         		// 0x0000C0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CompareFileDates");
		return pClassPointer;
	};
};
UClass* UcUIAction_CompareFileDates::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_CompName[0x17D0A9D0]
class UcUIAction_CompName : public UUIAction
{
public:
	struct FName                                       NameA;                                            		// 0x0000B4 (0x0008)              
	struct FName                                       NameB;                                            		// 0x0000BC (0x0008)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CompName");
		return pClassPointer;
	};
};
UClass* UcUIAction_CompName::pClassPointer = NULL;

//0x000018 (0x0000CC - 0x0000B4)
//cUIAction_CompString[0x17D0A8A0]
class UcUIAction_CompString : public UUIAction
{
public:
	struct FString                                     m_sInput;                                         		// 0x0000B4 (0x000C)              
	TArray<struct FString>                             m_asStrings;                                      		// 0x0000C0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CompString");
		return pClassPointer;
	};

public:
	bool IsValidLevelSequenceObject();//APBUserInterface.cUIAction_CompString.IsValidLevelSequenceObject
	bool HasDynamicOutputLinks();//APBUserInterface.cUIAction_CompString.HasDynamicOutputLinks
};
UClass* UcUIAction_CompString::pClassPointer = NULL;

//0x000018 (0x0000CC - 0x0000B4)
//cUIAction_CompStringLen[0x17D0A770]
class UcUIAction_CompStringLen : public UUIAction
{
public:
	struct FString                                     m_sStringA;                                       		// 0x0000B4 (0x000C)              
	struct FString                                     m_sStringB;                                       		// 0x0000C0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CompStringLen");
		return pClassPointer;
	};
};
UClass* UcUIAction_CompStringLen::pClassPointer = NULL;

//0x00001C (0x0000D0 - 0x0000B4)
//cUIAction_CompStringPair[0x17D0A640]
class UcUIAction_CompStringPair : public UUIAction
{
public:
	struct FString                                     m_sStringA;                                       		// 0x0000B4 (0x000C)              
	struct FString                                     m_sStringB;                                       		// 0x0000C0 (0x000C)              
	unsigned long                                      m_bCaseSensitive : 1;                             		// 0x0000CC (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CompStringPair");
		return pClassPointer;
	};
};
UClass* UcUIAction_CompStringPair::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_ConcatenateString[0x17D0A510]
class UcUIAction_ConcatenateString : public UUIAction
{
public:
	int                                                NumInputs;                                        		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ConcatenateString");
		return pClassPointer;
	};
};
UClass* UcUIAction_ConcatenateString::pClassPointer = NULL;

//0x000035 (0x0000E9 - 0x0000B4)
//cUIAction_DisplayTextEntry[0x17D0A3E0]
class UcUIAction_DisplayTextEntry : public UUIAction
{
public:
	struct FString                                     m_sInitialText;                                   		// 0x0000B4 (0x000C)              
	struct FString                                     m_sTitleMarkup;                                   		// 0x0000C0 (0x000C)              
	struct FString                                     m_sMessageMarkup;                                 		// 0x0000CC (0x000C)              
	unsigned long                                      m_bIsDone : 1;                                    		// 0x0000D8 (0x0004) [0x00000001] 
	unsigned long                                      m_bMessageResult : 1;                             		// 0x0000D8 (0x0004) [0x00000002] 
	class UUIScene*                                    m_pOpenedScene;                                   		// 0x0000DC (0x0004)              
	class UUIScene*                                    m_pTextEntryScene;                                		// 0x0000E0 (0x0004)              
	int                                                m_nMaxCharacters;                                 		// 0x0000E4 (0x0004)              
	unsigned char                                      m_eCharacterRestrictions;                         		// 0x0000E8 (0x0001)              PROPERTY: EEditBoxCharacterSet

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_DisplayTextEntry");
		return pClassPointer;
	};

public:
	void OnBoxClosed(bool bInAcceptOk);//APBUserInterface.cUIAction_DisplayTextEntry.OnBoxClosed
	void SetupScene(class UcUIScene_TextEntry* Scene);//APBUserInterface.cUIAction_DisplayTextEntry.SetupScene
};
UClass* UcUIAction_DisplayTextEntry::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_FileSelectionCanceled[0x17D0A2B0]
class UcUIAction_FileSelectionCanceled : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FileSelectionCanceled");
		return pClassPointer;
	};
};
UClass* UcUIAction_FileSelectionCanceled::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_FileSelectionMade[0x17D0A180]
class UcUIAction_FileSelectionMade : public UUIAction
{
public:
	struct FString                                     SelectedFilePath;                                 		// 0x0000B4 (0x000C)              
	unsigned long                                      IsDone : 1;                                       		// 0x0000C0 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FileSelectionMade");
		return pClassPointer;
	};
};
UClass* UcUIAction_FileSelectionMade::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_FindScene[0x17D0A050]
class UcUIAction_FindScene : public UUIAction
{
public:
	struct FString                                     m_sSceneTag;                                      		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FindScene");
		return pClassPointer;
	};
};
UClass* UcUIAction_FindScene::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_FloatToInt[0x17D09F20]
class UcUIAction_FloatToInt : public UUIAction
{
public:
	float                                              Value;                                            		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FloatToInt");
		return pClassPointer;
	};
};
UClass* UcUIAction_FloatToInt::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_FloatToString[0x17D09DF0]
class UcUIAction_FloatToString : public UUIAction
{
public:
	float                                              m_fValue;                                         		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FloatToString");
		return pClassPointer;
	};
};
UClass* UcUIAction_FloatToString::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Fnd_AddGroup[0x17D09CC0]
class UcUIAction_Fnd_AddGroup : public UUIAction
{
public:
	struct FString                                     m_sMessage;                                       		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_AddGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_AddGroup::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Fnd_AddTeam[0x17D09B90]
class UcUIAction_Fnd_AddTeam : public UUIAction
{
public:
	struct FString                                     m_sMessage;                                       		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_AddTeam");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_AddTeam::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Fnd_EditGroup[0x17D09A60]
class UcUIAction_Fnd_EditGroup : public UUIAction
{
public:
	struct FString                                     m_sMessage;                                       		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_EditGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_EditGroup::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Fnd_EditTeam[0x17D09930]
class UcUIAction_Fnd_EditTeam : public UUIAction
{
public:
	struct FString                                     m_sMessage;                                       		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_EditTeam");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_EditTeam::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Fnd_RefreshGroup[0x17D09800]
class UcUIAction_Fnd_RefreshGroup : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_RefreshGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_RefreshGroup::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Fnd_RefreshTeam[0x17D096D0]
class UcUIAction_Fnd_RefreshTeam : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_RefreshTeam");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_RefreshTeam::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Fnd_RemoveGroup[0x17D095A0]
class UcUIAction_Fnd_RemoveGroup : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_RemoveGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_RemoveGroup::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Fnd_RemoveTeam[0x17D09470]
class UcUIAction_Fnd_RemoveTeam : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_RemoveTeam");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_RemoveTeam::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_Fnd_SetSelectedGroupInfo[0x17D09340]
class UcUIAction_Fnd_SetSelectedGroupInfo : public UUIAction
{
public:
	int                                                m_nGroupUID;                                      		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_SetSelectedGroupInfo");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_SetSelectedGroupInfo::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_Fnd_SetSelectedTeamInfo[0x17D09210]
class UcUIAction_Fnd_SetSelectedTeamInfo : public UUIAction
{
public:
	int                                                m_nTeamUID;                                       		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Fnd_SetSelectedTeamInfo");
		return pClassPointer;
	};
};
UClass* UcUIAction_Fnd_SetSelectedTeamInfo::pClassPointer = NULL;

//0x000000 (0x0000BC - 0x0000BC)
//cUIAction_ForceGC[0x17D090E0]
class UcUIAction_ForceGC : public USeqAct_ForceGarbageCollection
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ForceGC");
		return pClassPointer;
	};

public:
	bool IsValidUISequenceObject(class UUIScreenObject* TargetObject);//APBUserInterface.cUIAction_ForceGC.IsValidUISequenceObject
};
UClass* UcUIAction_ForceGC::pClassPointer = NULL;

//0x000030 (0x0000E4 - 0x0000B4)
//cUIAction_FullScreenMoviePlayer[0x17D08FB0]
class UcUIAction_FullScreenMoviePlayer : public UUIAction
{
public:
	int                                                m_nPlayMode;                                      		// 0x0000B4 (0x0004)              
	struct FString                                     m_sMovieName;                                     		// 0x0000B8 (0x000C)              
	unsigned long                                      m_bIsSkipable : 1;                                		// 0x0000C4 (0x0004) [0x00000001] 
	struct FName                                       m_CapturedKey;                                    		// 0x0000C8 (0x0008)              
	float                                              m_fTimeActive;                                    		// 0x0000D0 (0x0004)              
	unsigned char                                      m_CapturedInputEvent;                             		// 0x0000D4 (0x0001)              PROPERTY: EInputEvent
	unsigned char                                      _0x0000D5[0x3];                                   		// 0x0000D5 (0x0003) MISSED OFFSET
	TArray<struct FName>                               Exceptions;                                       		// 0x0000D8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_FullScreenMoviePlayer");
		return pClassPointer;
	};

public:
	bool InputKey(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad);//APBUserInterface.cUIAction_FullScreenMoviePlayer.InputKey
};
UClass* UcUIAction_FullScreenMoviePlayer::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_GetAspectRatio[0x17D08E80]
class UcUIAction_GetAspectRatio : public UUIAction
{
public:
	int                                                m_nHorSize;                                       		// 0x0000B4 (0x0004)              
	int                                                m_nVertSize;                                      		// 0x0000B8 (0x0004)              
	float                                              m_nAspectRatio;                                   		// 0x0000BC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetAspectRatio");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetAspectRatio::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_GetCharacterFaction[0x17D08D50]
class UcUIAction_GetCharacterFaction : public UUIAction
{
public:
	struct FString                                     m_sSlotNumber;                                    		// 0x0000B4 (0x000C)              
	int                                                m_nSlotNum;                                       		// 0x0000C0 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetCharacterFaction");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetCharacterFaction::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetCheckboxState[0x17D08C20]
class UcUIAction_GetCheckboxState : public UUIAction_GetValue
{
public:
	class UUICheckbox*                                 m_pCheckbox;                                      		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetCheckboxState");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetCheckboxState::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetColourChooserColour[0x17D08AF0]
class UcUIAction_GetColourChooserColour : public UUIAction
{
public:
	int                                                m_nColourIndex;                                   		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetColourChooserColour");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetColourChooserColour::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetDistrict[0x17D089C0]
class UcUIAction_GetDistrict : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetDistrict");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetDistrict::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetDistrictType[0x17D08890]
class UcUIAction_GetDistrictType : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetDistrictType");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetDistrictType::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetEditBoxText[0x17D08760]
class UcUIAction_GetEditBoxText : public UUIAction_GetValue
{
public:
	class UUIEditBox*                                  m_pEditBox;                                       		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetEditBoxText");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetEditBoxText::pClassPointer = NULL;

//0x00000D (0x0000C1 - 0x0000B4)
//cUIAction_GetFileDate[0x17D08630]
class UcUIAction_GetFileDate : public UUIAction
{
public:
	struct FString                                     m_sFilename;                                      		// 0x0000B4 (0x000C)              
	unsigned char                                      m_eFileParameter;                                 		// 0x0000C0 (0x0001)              PROPERTY: GFD_FileProperty

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetFileDate");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetFileDate::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetGroupLeaderInfo[0x17D08500]
class UcUIAction_GetGroupLeaderInfo : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetGroupLeaderInfo");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetGroupLeaderInfo::pClassPointer = NULL;

//0x000048 (0x0000FC - 0x0000B4)
//cUIAction_GetKeyPress[0x17D083D0]
class UcUIAction_GetKeyPress : public UUIAction
{
public:
	struct FName                                       m_CapturedKey;                                    		// 0x0000B4 (0x0008)              
	float                                              m_fTimeActive;                                    		// 0x0000BC (0x0004)              
	float                                              m_fRefireDelay;                                   		// 0x0000C0 (0x0004)              
	unsigned long                                      bIncludeCommonMouseInput : 1;                     		// 0x0000C4 (0x0004) [0x00000001] 
	unsigned long                                      ConsumeInput : 1;                                 		// 0x0000C4 (0x0004) [0x00000002] 
	unsigned long                                      OnlyTriggerOnce : 1;                              		// 0x0000C4 (0x0004) [0x00000004] 
	TArray<struct FName>                               Exceptions;                                       		// 0x0000C8 (0x000C)              
	TArray<struct FName>                               Inclusions;                                       		// 0x0000D4 (0x000C)              
	class UUIScreenObject*                             Widget;                                           		// 0x0000E0 (0x0004)              
	struct FScriptDelegate                             __OldInputKeyDelegate_Global__Delegate;           		// 0x0000E4 (0x000C)              
	struct FScriptDelegate                             __OldInputKeyDelegate_UIWidget__Delegate;         		// 0x0000F0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetKeyPress");
		return pClassPointer;
	};

public:
	bool InputKey_Global(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad);//APBUserInterface.cUIAction_GetKeyPress.InputKey_Global
	bool OldInputKeyDelegate_Global(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad);//APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_Global
	bool InputKey_UIWidget(struct FInputEventParameters* EventParms);//APBUserInterface.cUIAction_GetKeyPress.InputKey_UIWidget
	bool OldInputKeyDelegate_UIWidget(struct FInputEventParameters* EventParms);//APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_UIWidget
};
UClass* UcUIAction_GetKeyPress::pClassPointer = NULL;

//0x000008 (0x0000BC - 0x0000B4)
//cUIAction_GetKeyState[0x17D082A0]
class UcUIAction_GetKeyState : public UUIAction
{
public:
	struct FName                                       Key;                                              		// 0x0000B4 (0x0008)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetKeyState");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetKeyState::pClassPointer = NULL;

//0x000034 (0x0000E8 - 0x0000B4)
//cUIAction_GetListCell[0x17D08170]
class UcUIAction_GetListCell : public UUIAction
{
public:
	class UUIList*                                     m_pList;                                          		// 0x0000B4 (0x0004)              
	int                                                m_nColumnIndex;                                   		// 0x0000B8 (0x0004)              
	struct FString                                     m_sColumnName;                                    		// 0x0000BC (0x000C)              
	int                                                m_nRow;                                           		// 0x0000C8 (0x0004)              
	unsigned long                                      AllowMultipleResults : 1;                         		// 0x0000CC (0x0004) [0x00000001] 
	TArray<int>                                        m_PendingOutputLink;                              		// 0x0000D0 (0x000C)              
	TArray<struct FString>                             m_sPendingValue;                                  		// 0x0000DC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetListCell");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetListCell::pClassPointer = NULL;

//0x000014 (0x0000C8 - 0x0000B4)
//cUIAction_GetObjectFromListRow[0x17D08040]
class UcUIAction_GetObjectFromListRow : public UUIAction
{
public:
	int                                                m_nRowIndex;                                      		// 0x0000B4 (0x0004)              
	struct FName                                       m_CellFieldName;                                  		// 0x0000B8 (0x0008)              
	unsigned long                                      m_bSortedIndices : 1;                             		// 0x0000C0 (0x0004) [0x00000001] 
	class UObject*                                     m_ObjectValue;                                    		// 0x0000C4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetObjectFromListRow");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetObjectFromListRow::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetPlayerCharacterName[0x17D07F10]
class UcUIAction_GetPlayerCharacterName : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetPlayerCharacterName");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetPlayerCharacterName::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetScrollbarPosition[0x17D07DE0]
class UcUIAction_GetScrollbarPosition : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetScrollbarPosition");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetScrollbarPosition::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetSelectedImageMaskIndex[0x17D07CB0]
class UcUIAction_GetSelectedImageMaskIndex : public UUIAction
{
public:
	class UcUISelectableMaskImage*                     m_pWidget;                                        		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetSelectedImageMaskIndex");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetSelectedImageMaskIndex::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetSelectedListItems[0x17D07B80]
class UcUIAction_GetSelectedListItems : public UUIAction
{
public:
	unsigned long                                      bSortedIndices : 1;                               		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetSelectedListItems");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetSelectedListItems::pClassPointer = NULL;

//0x000038 (0x0000EC - 0x0000B4)
//cUIAction_GetSliderCanvasBindings[0x17D07A50]
class UcUIAction_GetSliderCanvasBindings : public UUIAction
{
public:
	struct FString                                     m_sHorizDataStoreMarkupString;                    		// 0x0000B4 (0x000C)              
	struct FString                                     m_sVertDataStoreMarkupString;                     		// 0x0000C0 (0x000C)              
	struct FString                                     m_sHorizDataStoreFieldName;                       		// 0x0000CC (0x000C)              
	struct FString                                     m_sVertDataStoreFieldName;                        		// 0x0000D8 (0x000C)              
	float                                              m_fHorizValue;                                    		// 0x0000E4 (0x0004)              
	float                                              m_fVertValue;                                     		// 0x0000E8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetSliderCanvasBindings");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetSliderCanvasBindings::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetThumbnailListItem[0x17D07920]
class UcUIAction_GetThumbnailListItem : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetThumbnailListItem");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetThumbnailListItem::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_GetThumbnailListPage[0x17D077F0]
class UcUIAction_GetThumbnailListPage : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetThumbnailListPage");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetThumbnailListPage::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetWidgetPosition[0x17D076C0]
class UcUIAction_GetWidgetPosition : public UUIAction
{
public:
	class UObject*                                     m_pWidget;                                        		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetWidgetPosition");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetWidgetPosition::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_GetWorldIDFromList[0x17D07590]
class UcUIAction_GetWorldIDFromList : public UUIAction
{
public:
	class UUIList*                                     m_pWorldList;                                     		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetWorldIDFromList");
		return pClassPointer;
	};
};
UClass* UcUIAction_GetWorldIDFromList::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_HasTutorialBeenPlayed[0x17D07460]
class UcUIAction_HasTutorialBeenPlayed : public UUIAction
{
public:
	struct FEnumeratedName                             m_TutorialMessage;                                		// 0x0000B4 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HasTutorialBeenPlayed");
		return pClassPointer;
	};

public:
	int GetObjClassVersion();//APBUserInterface.cUIAction_HasTutorialBeenPlayed.GetObjClassVersion
};
UClass* UcUIAction_HasTutorialBeenPlayed::pClassPointer = NULL;

//0x000010 (0x000108 - 0x0000F8)
//cUIAction_CharacterInfo[0x17D07330]
class UcUIAction_CharacterInfo : public UcUIAction_HostingOp
{
public:
	struct FString                                     m_sSlotNumber;                                    		// 0x0000F8 (0x000C)              
	int                                                m_nSlotNum;                                       		// 0x000104 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CharacterInfo");
		return pClassPointer;
	};

public:
	void OnCharacterInfoSuccess();//APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoSuccess
	void OnCharacterInfoFailed(int nError);//APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoFailed
};
UClass* UcUIAction_CharacterInfo::pClassPointer = NULL;

//0x000014 (0x00010C - 0x0000F8)
//cUIAction_CharacterNameCheck[0x17D07200]
class UcUIAction_CharacterNameCheck : public UcUIAction_HostingOp
{
public:
	struct FString                                     m_sName;                                          		// 0x0000F8 (0x000C)              
	int                                                m_nWorldUID;                                      		// 0x000104 (0x0004)              
	unsigned long                                      m_bPremiumOnly : 1;                               		// 0x000108 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_CharacterNameCheck");
		return pClassPointer;
	};

public:
	void OnNameCheckFailed(int nError);//APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckFailed
	void OnNameCheckSuccess();//APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckSuccess
};
UClass* UcUIAction_CharacterNameCheck::pClassPointer = NULL;

//0x000068 (0x000160 - 0x0000F8)
//cUIAction_DistrictEnter[0x17D070D0]
class UcUIAction_DistrictEnter : public UcUIAction_HostingOp
{
public:
	int                                                m_nDistrictUID;                                   		// 0x0000F8 (0x0004)              
	int                                                m_nInstanceNo;                                    		// 0x0000FC (0x0004)              
	int                                                m_nCharacterUID;                                  		// 0x000100 (0x0004)              
	int                                                m_nRequestedDistrictUID;                          		// 0x000104 (0x0004)              
	int                                                m_nRequestedInstanceNo;                           		// 0x000108 (0x0004)              
	class UUIList*                                     m_pDistrictList;                                  		// 0x00010C (0x0004)              
	struct FString                                     m_sDistrictName;                                  		// 0x000110 (0x000C)              
	struct FString                                     m_sFriendName;                                    		// 0x00011C (0x000C)              
	struct FString                                     m_sTeamMemberName;                                		// 0x000128 (0x000C)              
	struct FString                                     m_sGroupMemberName;                               		// 0x000134 (0x000C)              
	unsigned long                                      m_bJoinAsGroup : 1;                               		// 0x000140 (0x0004) [0x00000001] 
	unsigned long                                      m_bIgnoreThreat : 1;                              		// 0x000140 (0x0004) [0x00000002] 
	unsigned long                                      m_bHasInappropriateThreat : 1;                    		// 0x000140 (0x0004) [0x00000004] 
	unsigned char                                      m_LinkActivated;                                  		// 0x000144 (0x0001)              PROPERTY: eDistrictEnterType
	unsigned char                                      m_eUpdateOnTick;                                  		// 0x000145 (0x0001)              PROPERTY: eDistrictEnterState
	unsigned char                                      m_SceneInputMode;                                 		// 0x000146 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000147[0x1];                                   		// 0x000147 (0x0001) MISSED OFFSET
	struct FString                                     m_sFactionPlayerName;                             		// 0x000148 (0x000C)              
	struct FString                                     m_sInappropriateThreatMessage;                    		// 0x000154 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_DistrictEnter");
		return pClassPointer;
	};

public:
	void OnDistrictReserveFailed(int nError,int nDistrictUID,int nInstanceNo,bool bGroup);//APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveFailed
	void DistrictReserve();//APBUserInterface.cUIAction_DistrictEnter.DistrictReserve
	void OnDistrictEnterSuccess();//APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterSuccess
	void CharacterGetInfoSuccess(int nCharacterUID,int nDistrictUID,int nInstanceNo,unsigned char eFaction,struct FString sCharacterName,int nInstanceThreat);//APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoSuccess
	void ShowLoadingScreen(bool bShow);//APBUserInterface.cUIAction_DistrictEnter.ShowLoadingScreen
	void OnDistrictEnterFailed(int nError);//APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterFailed
	void JoinPlayer(struct FString sPlayerName);//APBUserInterface.cUIAction_DistrictEnter.JoinPlayer
	void OnDistrictReserveSuccess();//APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveSuccess
	void CharacterGetInfoFailure(int nError,struct FString sCharacterName);//APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoFailure
	void OnWorldServerDisconnect();//APBUserInterface.cUIAction_DistrictEnter.OnWorldServerDisconnect
};
UClass* UcUIAction_DistrictEnter::pClassPointer = NULL;

//0x000010 (0x000108 - 0x0000F8)
//cUIAction_DM_HandleInput[0x17D06FA0]
class UcUIAction_DM_HandleInput : public UcUIAction_HostingOp
{
public:
	float                                              m_fInputX;                                        		// 0x0000F8 (0x0004)              
	float                                              m_fInputY;                                        		// 0x0000FC (0x0004)              
	int                                                m_nStreamingStartDelay;                           		// 0x000100 (0x0004)              
	int                                                m_nStreamingStartTimer;                           		// 0x000104 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_DM_HandleInput");
		return pClassPointer;
	};

public:
	void OnPlayerSpawnTimerExpired();//APBUserInterface.cUIAction_DM_HandleInput.OnPlayerSpawnTimerExpired
};
UClass* UcUIAction_DM_HandleInput::pClassPointer = NULL;

//0x000001 (0x0000F9 - 0x0000F8)
//cUIAction_GetInstanceList[0x17D06E70]
class UcUIAction_GetInstanceList : public UcUIAction_HostingOp
{
public:
	unsigned char                                      m_eUpdateOnTick;                                  		// 0x0000F8 (0x0001)              PROPERTY: eGetInstanceListState

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_GetInstanceList");
		return pClassPointer;
	};

public:
	void OnGetInstanceListSuccess();//APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListSuccess
	void OnGetInstanceListFailed(int nError);//APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListFailed
};
UClass* UcUIAction_GetInstanceList::pClassPointer = NULL;

//0x000004 (0x0000FC - 0x0000F8)
//cUIAction_LaunchGameFlowScene[0x17D06D40]
class UcUIAction_LaunchGameFlowScene : public UcUIAction_HostingOp
{
public:
	unsigned long                                      m_bProcessCompleted : 1;                          		// 0x0000F8 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_LaunchGameFlowScene");
		return pClassPointer;
	};

public:
	void OnFastLoginFailed(int nError,struct FString sCountryCode);//APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginFailed
	void ClientInvokeCityMap();//APBUserInterface.cUIAction_LaunchGameFlowScene.ClientInvokeCityMap
	void OnFastLoginSuccess();//APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginSuccess
	void ClientNotReturningToLobby();//APBUserInterface.cUIAction_LaunchGameFlowScene.ClientNotReturningToLobby
};
UClass* UcUIAction_LaunchGameFlowScene::pClassPointer = NULL;

//0x000004 (0x0000FC - 0x0000F8)
//cUIAction_Logout[0x17D06C10]
class UcUIAction_Logout : public UcUIAction_HostingOp
{
public:
	unsigned long                                      m_bLogoutStatus : 1;                              		// 0x0000F8 (0x0004) [0x00000001] 
	unsigned long                                      m_bFastLogin : 1;                                 		// 0x0000F8 (0x0004) [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Logout");
		return pClassPointer;
	};

public:
	void OnDisconnected();//APBUserInterface.cUIAction_Logout.OnDisconnected
};
UClass* UcUIAction_Logout::pClassPointer = NULL;

//0x000058 (0x000150 - 0x0000F8)
//cUIAction_ReportBug[0x17D06AE0]
class UcUIAction_ReportBug : public UcUIAction_HostingOp
{
public:
	struct FString                                     Summary;                                          		// 0x0000F8 (0x000C)              
	struct FString                                     Description;                                      		// 0x000104 (0x000C)              
	struct FString                                     m_sPlayerInfoFileName;                            		// 0x000110 (0x000C)              
	struct FString                                     m_sScreenShotFileName;                            		// 0x00011C (0x000C)              
	TArray<DWORD>                                      m_ScreenShotData;                                 		// 0x000128 (0x000C)              
	TArray<unsigned char>                              m_ScreenShotCompressedData;                       		// 0x000134 (0x000C)              
	int                                                m_nScreenShotSizeX;                               		// 0x000140 (0x0004)              
	int                                                m_nScreenShotSizeY;                               		// 0x000144 (0x0004)              
	unsigned long                                      m_bScreenShotDone : 1;                            		// 0x000148 (0x0004) [0x00000001] 
	DWORD                                              m_nThreadHandle;                                  		// 0x00014C (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ReportBug");
		return pClassPointer;
	};
};
UClass* UcUIAction_ReportBug::pClassPointer = NULL;

//0x000000 (0x0000F8 - 0x0000F8)
//cUIAction_WaitUntilWorldEnter[0x17D069B0]
class UcUIAction_WaitUntilWorldEnter : public UcUIAction_HostingOp
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_WaitUntilWorldEnter");
		return pClassPointer;
	};
};
UClass* UcUIAction_WaitUntilWorldEnter::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_HUD_CloseScene[0x17D06880]
class UcUIAction_HUD_CloseScene : public UUIAction
{
public:
	class UUIScene*                                    Scene;                                            		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_CloseScene");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_CloseScene::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_HUD_HudMessageFinished[0x17D06750]
class UcUIAction_HUD_HudMessageFinished : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_HudMessageFinished");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_HudMessageFinished::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_HUD_PopUpIcon[0x17D06620]
class UcUIAction_HUD_PopUpIcon : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_PopUpIcon");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_PopUpIcon::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_HUD_PopUpMenuSelection[0x17D064F0]
class UcUIAction_HUD_PopUpMenuSelection : public UUIAction
{
public:
	int                                                m_nListIndex;                                     		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_PopUpMenuSelection");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_PopUpMenuSelection::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_HUD_RunHudMessage[0x17D063C0]
class UcUIAction_HUD_RunHudMessage : public UUIAction
{
public:
	struct FEnumeratedName                             m_HUDMessage;                                     		// 0x0000B4 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_RunHudMessage");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_RunHudMessage::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_HUD_TriggerHelpPopup[0x17D06290]
class UcUIAction_HUD_TriggerHelpPopup : public UUIAction
{
public:
	struct FEnumeratedName                             m_ePopupDialog;                                   		// 0x0000B4 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_HUD_TriggerHelpPopup");
		return pClassPointer;
	};
};
UClass* UcUIAction_HUD_TriggerHelpPopup::pClassPointer = NULL;

//0x000014 (0x0000DC - 0x0000C8)
//cUIAction_IncrementDataStoreValue[0x17D06160]
class UcUIAction_IncrementDataStoreValue : public UUIAction_DataStoreField
{
public:
	unsigned long                                      m_bIntRange : 1;                                  		// 0x0000C8 (0x0004) [0x00000001] 
	unsigned long                                      m_bLoop : 1;                                      		// 0x0000C8 (0x0004) [0x00000002] 
	float                                              m_fIncrementValue;                                		// 0x0000CC (0x0004)              
	float                                              m_fMax;                                           		// 0x0000D0 (0x0004)              
	float                                              m_fMin;                                           		// 0x0000D4 (0x0004)              
	int                                                m_nArrayIndex;                                    		// 0x0000D8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_IncrementDataStoreValue");
		return pClassPointer;
	};
};
UClass* UcUIAction_IncrementDataStoreValue::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_IntToString[0x17D06030]
class UcUIAction_IntToString : public UUIAction
{
public:
	int                                                m_nValue;                                         		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_IntToString");
		return pClassPointer;
	};
};
UClass* UcUIAction_IntToString::pClassPointer = NULL;

//0x00002C (0x0000E0 - 0x0000B4)
//cUIAction_InvokeWebBrowser[0x17D05F00]
class UcUIAction_InvokeWebBrowser : public UUIAction
{
public:
	struct FString                                     m_sRequestedURL;                                  		// 0x0000B4 (0x000C)              
	struct FEnumeratedName                             m_eAPBSupportPage;                                		// 0x0000C0 (0x0010)              
	TArray<struct FString>                             m_aParameters;                                    		// 0x0000D0 (0x000C)              
	unsigned long                                      m_bInternal : 1;                                  		// 0x0000DC (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_InvokeWebBrowser");
		return pClassPointer;
	};
};
UClass* UcUIAction_InvokeWebBrowser::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_IsHostingClient[0x17D05DD0]
class UcUIAction_IsHostingClient : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_IsHostingClient");
		return pClassPointer;
	};
};
UClass* UcUIAction_IsHostingClient::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_IsMainSceneOpen[0x17D05CA0]
class UcUIAction_IsMainSceneOpen : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_IsMainSceneOpen");
		return pClassPointer;
	};
};
UClass* UcUIAction_IsMainSceneOpen::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_IsVisible[0x17D05B70]
class UcUIAction_IsVisible : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_IsVisible");
		return pClassPointer;
	};
};
UClass* UcUIAction_IsVisible::pClassPointer = NULL;

//0x000008 (0x0000BC - 0x0000B4)
//cUIAction_LastPlayedCharacter[0x17D05A40]
class UcUIAction_LastPlayedCharacter : public UUIAction
{
public:
	unsigned long                                      m_bSetPlayerName : 1;                             		// 0x0000B4 (0x0004) [0x00000001] 
	int                                                m_nSlotNumber;                                    		// 0x0000B8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_LastPlayedCharacter");
		return pClassPointer;
	};
};
UClass* UcUIAction_LastPlayedCharacter::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_MenuExclusiveOp[0x17D05910]
class UcUIAction_MenuExclusiveOp : public UUIAction
{
public:
	unsigned long                                      bIsExclusive : 1;                                 		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      bFlushKeyboard : 1;                               		// 0x0000B4 (0x0004) [0x00000002] 
	unsigned long                                      bFlushMouse : 1;                                  		// 0x0000B4 (0x0004) [0x00000004] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_MenuExclusiveOp");
		return pClassPointer;
	};
};
UClass* UcUIAction_MenuExclusiveOp::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Modulus[0x17D057E0]
class UcUIAction_Modulus : public UUIAction
{
public:
	int                                                ValueA;                                           		// 0x0000B4 (0x0004)              
	int                                                ValueB;                                           		// 0x0000B8 (0x0004)              
	int                                                IntResult;                                        		// 0x0000BC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Modulus");
		return pClassPointer;
	};
};
UClass* UcUIAction_Modulus::pClassPointer = NULL;

//0x000048 (0x0000FC - 0x0000B4)
//cUIAction_OpenFileSelector[0x17D056B0]
class UcUIAction_OpenFileSelector : public UUIAction
{
public:
	struct FString                                     Title;                                            		// 0x0000B4 (0x000C)              
	struct FString                                     Prompt;                                           		// 0x0000C0 (0x000C)              
	unsigned char                                      FileTypeFilter;                                   		// 0x0000CC (0x0001)              PROPERTY: eUIFileSelector_FileType
	unsigned char                                      m_SpecialStartingPath;                            		// 0x0000CD (0x0001)              PROPERTY: eUISpecialDirectory
	unsigned char                                      _0x0000CE[0x2];                                   		// 0x0000CE (0x0002) MISSED OFFSET
	struct FString                                     FileNameFilter;                                   		// 0x0000D0 (0x000C)              
	struct FString                                     InitialDirectory;                                 		// 0x0000DC (0x000C)              
	unsigned long                                      AllowMultipleResults : 1;                         		// 0x0000E8 (0x0004) [0x00000001] 
	int                                                m_State;                                          		// 0x0000EC (0x0004)              
	struct FString                                     m_sSelectedPath;                                  		// 0x0000F0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_OpenFileSelector");
		return pClassPointer;
	};

public:
	void SelectionDone();//APBUserInterface.cUIAction_OpenFileSelector.SelectionDone
	void SelectionCanceled();//APBUserInterface.cUIAction_OpenFileSelector.SelectionCanceled
	void SelectionMade(struct FString sSelectedPath);//APBUserInterface.cUIAction_OpenFileSelector.SelectionMade
};
UClass* UcUIAction_OpenFileSelector::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_PlaySound[0x17D05580]
class UcUIAction_PlaySound : public UUIAction
{
public:
	struct FEnumeratedName                             SoundCue;                                         		// 0x0000B4 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_PlaySound");
		return pClassPointer;
	};
};
UClass* UcUIAction_PlaySound::pClassPointer = NULL;

//0x000008 (0x0000BC - 0x0000B4)
//cUIAction_Pulse[0x17D05450]
class UcUIAction_Pulse : public UUIAction
{
public:
	int                                                m_nPulseTime;                                     		// 0x0000B4 (0x0004)              
	float                                              m_fCurrentTime;                                   		// 0x0000B8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Pulse");
		return pClassPointer;
	};
};
UClass* UcUIAction_Pulse::pClassPointer = NULL;

//0x000024 (0x0000D8 - 0x0000B4)
//cUIAction_ResolveFromIniFile[0x17D05320]
class UcUIAction_ResolveFromIniFile : public UUIAction
{
public:
	struct FString                                     m_sKey;                                           		// 0x0000B4 (0x000C)              
	struct FString                                     m_sSection;                                       		// 0x0000C0 (0x000C)              
	struct FString                                     m_sIniFileName;                                   		// 0x0000CC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ResolveFromIniFile");
		return pClassPointer;
	};
};
UClass* UcUIAction_ResolveFromIniFile::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_ScrollEditBox[0x17D051F0]
class UcUIAction_ScrollEditBox : public UUIAction
{
public:
	int                                                m_nLines;                                         		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_ScrollEditBox");
		return pClassPointer;
	};
};
UClass* UcUIAction_ScrollEditBox::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SE_AddLayer[0x17D050C0]
class UcUIAction_SE_AddLayer : public UUIAction
{
public:
	int                                                m_nInsertIndex;                                   		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_AddLayer");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_AddLayer::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_DeleteLayers[0x17D04F90]
class UcUIAction_SE_DeleteLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_DeleteLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_DeleteLayers::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_DuplicateLayers[0x17D04E60]
class UcUIAction_SE_DuplicateLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_DuplicateLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_DuplicateLayers::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_FlashHighlightLayers[0x17D04D30]
class UcUIAction_SE_FlashHighlightLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_FlashHighlightLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_FlashHighlightLayers::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_SE_FlipLayers[0x17D04C00]
class UcUIAction_SE_FlipLayers : public UUIAction
{
public:
	struct FString                                     m_Layers;                                         		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bFlipHoriz : 1;                                 		// 0x0000C0 (0x0004) [0x00000001] 
	unsigned long                                      m_bFlipVert : 1;                                  		// 0x0000C0 (0x0004) [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_FlipLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_FlipLayers::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_GetAbsoluteMaxNumLayers[0x17D04AD0]
class UcUIAction_SE_GetAbsoluteMaxNumLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_GetAbsoluteMaxNumLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_GetAbsoluteMaxNumLayers::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_GetCurrentLayerType[0x17D049A0]
class UcUIAction_SE_GetCurrentLayerType : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_GetCurrentLayerType");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_GetCurrentLayerType::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_GetMaxNumLayers[0x17D04870]
class UcUIAction_SE_GetMaxNumLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_GetMaxNumLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_GetMaxNumLayers::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_GetNumLayers[0x17D04740]
class UcUIAction_SE_GetNumLayers : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_GetNumLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_GetNumLayers::pClassPointer = NULL;

//0x000014 (0x0000C8 - 0x0000B4)
//cUIAction_SE_HandleInput[0x17D04610]
class UcUIAction_SE_HandleInput : public UUIAction
{
public:
	float                                              m_fInputX;                                        		// 0x0000B4 (0x0004)              
	float                                              m_fInputY;                                        		// 0x0000B8 (0x0004)              
	struct FString                                     m_Layers;                                         		// 0x0000BC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_HandleInput");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_HandleInput::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_SE_HighlightLayers[0x17D044E0]
class UcUIAction_SE_HighlightLayers : public UUIAction
{
public:
	struct FString                                     m_Layers;                                         		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_HighlightLayers");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_HighlightLayers::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_SE_LoadFile[0x17D043B0]
class UcUIAction_SE_LoadFile : public UUIAction
{
public:
	struct FString                                     m_FileName;                                       		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bLoadAsGraffiti : 1;                            		// 0x0000C0 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_LoadFile");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_LoadFile::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SE_ReleaseAssets[0x17D04280]
class UcUIAction_SE_ReleaseAssets : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_ReleaseAssets");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_ReleaseAssets::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_SE_ResetTransforms[0x17D04150]
class UcUIAction_SE_ResetTransforms : public UUIAction
{
public:
	struct FString                                     m_Layers;                                         		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_ResetTransforms");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_ResetTransforms::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_SE_SaveFile[0x17D04020]
class UcUIAction_SE_SaveFile : public UUIAction
{
public:
	struct FString                                     m_FileName;                                       		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bSaveAsGraffiti : 1;                            		// 0x0000C0 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_SaveFile");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_SaveFile::pClassPointer = NULL;

//0x000020 (0x0000D4 - 0x0000B4)
//cUIAction_SE_SetColour[0x17D03EF0]
class UcUIAction_SE_SetColour : public UUIAction
{
public:
	struct FString                                     m_Layers;                                         		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bSetColourIndex : 1;                            		// 0x0000C0 (0x0004) [0x00000001] 
	unsigned long                                      m_bSetAlpha : 1;                                  		// 0x0000C0 (0x0004) [0x00000002] 
	struct FString                                     m_sColour;                                        		// 0x0000C4 (0x000C)              
	int                                                m_nAlpha;                                         		// 0x0000D0 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SE_SetColour");
		return pClassPointer;
	};
};
UClass* UcUIAction_SE_SetColour::pClassPointer = NULL;

//0x000034 (0x0000E8 - 0x0000B4)
//cUIAction_SetAllDataStoreBindings[0x17D03DC0]
class UcUIAction_SetAllDataStoreBindings : public UUIAction
{
public:
	struct FString                                     OldDataStoreName;                                 		// 0x0000B4 (0x000C)              
	struct FString                                     NewDataStoreName;                                 		// 0x0000C0 (0x000C)              
	struct FString                                     OldDataStoreValueName;                            		// 0x0000CC (0x000C)              
	struct FString                                     NewDataStoreValueName;                            		// 0x0000D8 (0x000C)              
	unsigned long                                      ChangeWidgetValue : 1;                            		// 0x0000E4 (0x0004) [0x00000001] 
	unsigned long                                      ChangeWidgetTooltip : 1;                          		// 0x0000E4 (0x0004) [0x00000002] 
	unsigned long                                      ChangeKismetGetDataFieldValue : 1;                		// 0x0000E4 (0x0004) [0x00000004] 
	unsigned long                                      ChangeKismetSetDataFieldValue : 1;                		// 0x0000E4 (0x0004) [0x00000008] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetAllDataStoreBindings");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetAllDataStoreBindings::pClassPointer = NULL;

//0x00001C (0x0000D0 - 0x0000B4)
//cUIAction_SetColour[0x17D03C90]
class UcUIAction_SetColour : public UUIAction
{
public:
	unsigned char                                      ColourSlot;                                       		// 0x0000B4 (0x0001)              PROPERTY: eUISetColour_Slot
	unsigned char                                      _0x0000B5[0x3];                                   		// 0x0000B5 (0x0003) MISSED OFFSET
	int                                                ColourR;                                          		// 0x0000B8 (0x0004)              
	int                                                ColourG;                                          		// 0x0000BC (0x0004)              
	int                                                ColourB;                                          		// 0x0000C0 (0x0004)              
	struct FString                                     TextColour;                                       		// 0x0000C4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetColour");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetColour::pClassPointer = NULL;

//0x000008 (0x0000D0 - 0x0000C8)
//cUIAction_SetDataStoreValue[0x17D03B60]
class UcUIAction_SetDataStoreValue : public UUIAction_DataStoreField
{
public:
	float                                              m_fNewValue;                                      		// 0x0000C8 (0x0004)              
	int                                                m_nArrayIndex;                                    		// 0x0000CC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetDataStoreValue");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetDataStoreValue::pClassPointer = NULL;

//0x000018 (0x0000CC - 0x0000B4)
//cUIAction_SetEnabledImageMask[0x17D03A30]
class UcUIAction_SetEnabledImageMask : public UUIAction
{
public:
	class UcUISelectableMaskImage*                     m_pWidget;                                        		// 0x0000B4 (0x0004)              
	int                                                MaskIndex;                                        		// 0x0000B8 (0x0004)              
	unsigned long                                      Enable : 1;                                       		// 0x0000BC (0x0004) [0x00000001] 
	struct FString                                     EnableGroup;                                      		// 0x0000C0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetEnabledImageMask");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetEnabledImageMask::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetInputEnabled[0x17D03900]
class UcUIAction_SetInputEnabled : public UUIAction
{
public:
	unsigned long                                      bDisableInput : 1;                                		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetInputEnabled");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetInputEnabled::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetListMultiSelect[0x17D037D0]
class UcUIAction_SetListMultiSelect : public UUIAction
{
public:
	unsigned long                                      MultiSelect : 1;                                  		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetListMultiSelect");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetListMultiSelect::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_SetListOrdering[0x17D036A0]
class UcUIAction_SetListOrdering : public UUIAction
{
public:
	class UUIList*                                     m_pList;                                          		// 0x0000B4 (0x0004)              
	struct FString                                     m_Ordering;                                       		// 0x0000B8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetListOrdering");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetListOrdering::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_SetListPage[0x17D03570]
class UcUIAction_SetListPage : public UUIAction
{
public:
	class UUIList*                                     m_pList;                                          		// 0x0000B4 (0x0004)              
	int                                                m_nAbsolutePage;                                  		// 0x0000B8 (0x0004)              
	int                                                m_nDeltaPage;                                     		// 0x0000BC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetListPage");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetListPage::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetMatineeEnd[0x17D03440]
class UcUIAction_SetMatineeEnd : public UUIAction
{
public:
	float                                              m_fEndPosition;                                   		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetMatineeEnd");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetMatineeEnd::pClassPointer = NULL;

//0x000028 (0x0000DC - 0x0000B4)
//cUIAction_SetMeshImageMesh[0x17D03310]
class UcUIAction_SetMeshImageMesh : public UUIAction
{
public:
	struct FString                                     MeshName;                                         		// 0x0000B4 (0x000C)              
	class UObject*                                     MeshComponent;                                    		// 0x0000C0 (0x0004)              
	class UcUIMeshImage*                               Control;                                          		// 0x0000C4 (0x0004)              
	int                                                ControlMeshSlot;                                  		// 0x0000C8 (0x0004)              
	struct FString                                     EnvironmentProfile;                               		// 0x0000CC (0x000C)              
	unsigned long                                      PreserveRotation : 1;                             		// 0x0000D8 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetMeshImageMesh");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetMeshImageMesh::pClassPointer = NULL;

//0x00004C (0x000100 - 0x0000B4)
//cUIAction_SetMeshImageOrientation[0x17D031E0]
class UcUIAction_SetMeshImageOrientation : public UUIAction
{
public:
	class UcUIMeshImage*                               Control;                                          		// 0x0000B4 (0x0004)              
	int                                                ControlMeshSlot;                                  		// 0x0000B8 (0x0004)              
	unsigned char                                      m_eMeshType;                                      		// 0x0000BC (0x0001)              PROPERTY: eUIMeshType
	unsigned char                                      _0x0000BD[0x3];                                   		// 0x0000BD (0x0003) MISSED OFFSET
	FVector3                                           OrientationAIncAxis;                              		// 0x0000C0 (0x000C)              
	float                                              OrientationAIncAngle;                             		// 0x0000CC (0x0004)              
	FVector3                                           OrientationBIncAxis;                              		// 0x0000D0 (0x000C)              
	float                                              OrientationBIncAngle;                             		// 0x0000DC (0x0004)              
	FRotator                                           OrientationAVelocity;                             		// 0x0000E0 (0x000C)              
	FRotator                                           OrientationBVelocity;                             		// 0x0000EC (0x000C)              
	float                                              OrientationADampen;                               		// 0x0000F8 (0x0004)              
	float                                              OrientationBDampen;                               		// 0x0000FC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetMeshImageOrientation");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetMeshImageOrientation::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetMultiGPUCompatibility[0x17D030B0]
class UcUIAction_SetMultiGPUCompatibility : public UUIAction
{
public:
	unsigned long                                      bCompatibility : 1;                               		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetMultiGPUCompatibility");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetMultiGPUCompatibility::pClassPointer = NULL;

//0x00001C (0x0000D0 - 0x0000B4)
//cUIAction_SetProperty[0x17D02F80]
class UcUIAction_SetProperty : public UUIAction
{
public:
	struct FString                                     PropertyName;                                     		// 0x0000B4 (0x000C)              
	unsigned long                                      BoolValue : 1;                                    		// 0x0000C0 (0x0004) [0x00000001] 
	struct FString                                     StringValue;                                      		// 0x0000C4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetProperty");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetProperty::pClassPointer = NULL;

//0x000005 (0x0000B9 - 0x0000B4)
//cUIAction_SetSceneInputMode[0x17D02E50]
class UcUIAction_SetSceneInputMode : public UUIAction
{
public:
	class UUIScene*                                    Scene;                                            		// 0x0000B4 (0x0004)              
	unsigned char                                      InputMode;                                        		// 0x0000B8 (0x0001)              PROPERTY: EScreenInputMode

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetSceneInputMode");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetSceneInputMode::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_SetSceneLayer[0x17D02D20]
class UcUIAction_SetSceneLayer : public UUIAction
{
public:
	struct FEnumeratedName                             SceneLayer;                                       		// 0x0000B4 (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetSceneLayer");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetSceneLayer::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetScrollbarPosition[0x17D02BF0]
class UcUIAction_SetScrollbarPosition : public UUIAction
{
public:
	float                                              Position;                                         		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetScrollbarPosition");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetScrollbarPosition::pClassPointer = NULL;

//0x000008 (0x0000BC - 0x0000B4)
//cUIAction_SetSelectedImageMaskIndex[0x17D02AC0]
class UcUIAction_SetSelectedImageMaskIndex : public UUIAction
{
public:
	class UcUISelectableMaskImage*                     m_pWidget;                                        		// 0x0000B4 (0x0004)              
	int                                                SelectedMaskIndex;                                		// 0x0000B8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetSelectedImageMaskIndex");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetSelectedImageMaskIndex::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_SetSelectedListElements[0x17D02990]
class UcUIAction_SetSelectedListElements : public UUIAction
{
public:
	TArray<int>                                        Selection;                                        		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetSelectedListElements");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetSelectedListElements::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetSelectedListIndex[0x17D02860]
class UcUIAction_SetSelectedListIndex : public UUIAction
{
public:
	int                                                Selection;                                        		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetSelectedListIndex");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetSelectedListIndex::pClassPointer = NULL;

//0x000014 (0x0000C8 - 0x0000B4)
//cUIAction_SetStyle[0x17D02730]
class UcUIAction_SetStyle : public UUIAction
{
public:
	struct FString                                     Style;                                            		// 0x0000B4 (0x000C)              
	struct FName                                       StyleSlot;                                        		// 0x0000C0 (0x0008)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetStyle");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetStyle::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_SetThumbnailListItem[0x17D02600]
class UcUIAction_SetThumbnailListItem : public UUIAction
{
public:
	int                                                m_nNewItem;                                       		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetThumbnailListItem");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetThumbnailListItem::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_SetVisibleBullets[0x17D024D0]
class UcUIAction_SetVisibleBullets : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetVisibleBullets");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetVisibleBullets::pClassPointer = NULL;

//0x000014 (0x0000C8 - 0x0000B4)
//cUIAction_SetWidgetDockingOffsets[0x17D023A0]
class UcUIAction_SetWidgetDockingOffsets : public UUIAction
{
public:
	unsigned long                                      ChangeLeft : 1;                                   		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      ChangeTop : 1;                                    		// 0x0000B4 (0x0004) [0x00000002] 
	unsigned long                                      ChangeRight : 1;                                  		// 0x0000B4 (0x0004) [0x00000004] 
	unsigned long                                      ChangeBottom : 1;                                 		// 0x0000B4 (0x0004) [0x00000008] 
	unsigned long                                      PreserveSize : 1;                                 		// 0x0000B4 (0x0004) [0x00000010] 
	float                                              Left;                                             		// 0x0000B8 (0x0004)              
	float                                              Top;                                              		// 0x0000BC (0x0004)              
	float                                              Right;                                            		// 0x0000C0 (0x0004)              
	float                                              Bottom;                                           		// 0x0000C4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetWidgetDockingOffsets");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetWidgetDockingOffsets::pClassPointer = NULL;

//0x000014 (0x0000C8 - 0x0000B4)
//cUIAction_SetWidgetPosition[0x17D02270]
class UcUIAction_SetWidgetPosition : public UUIAction
{
public:
	unsigned long                                      ChangeLeft : 1;                                   		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      ChangeTop : 1;                                    		// 0x0000B4 (0x0004) [0x00000002] 
	unsigned long                                      ChangeRight : 1;                                  		// 0x0000B4 (0x0004) [0x00000004] 
	unsigned long                                      ChangeBottom : 1;                                 		// 0x0000B4 (0x0004) [0x00000008] 
	unsigned long                                      PreserveSize : 1;                                 		// 0x0000B4 (0x0004) [0x00000010] 
	float                                              Left;                                             		// 0x0000B8 (0x0004)              
	float                                              Top;                                              		// 0x0000BC (0x0004)              
	float                                              Right;                                            		// 0x0000C0 (0x0004)              
	float                                              Bottom;                                           		// 0x0000C4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetWidgetPosition");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetWidgetPosition::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_SetWidgetSize[0x17D02140]
class UcUIAction_SetWidgetSize : public UUIAction
{
public:
	unsigned long                                      ChangeWidth : 1;                                  		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      ChangeHeight : 1;                                 		// 0x0000B4 (0x0004) [0x00000002] 
	unsigned long                                      PreserveBottom : 1;                               		// 0x0000B4 (0x0004) [0x00000004] 
	float                                              Width;                                            		// 0x0000B8 (0x0004)              
	float                                              Height;                                           		// 0x0000BC (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_SetWidgetSize");
		return pClassPointer;
	};
};
UClass* UcUIAction_SetWidgetSize::pClassPointer = NULL;

//0x000008 (0x0000BC - 0x0000B4)
//cUIAction_Sleep[0x17D02010]
class UcUIAction_Sleep : public UUIAction
{
public:
	float                                              m_fTimeOut;                                       		// 0x0000B4 (0x0004)              
	float                                              m_fTimeElapsed;                                   		// 0x0000B8 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Sleep");
		return pClassPointer;
	};
};
UClass* UcUIAction_Sleep::pClassPointer = NULL;

//0x000020 (0x0000D4 - 0x0000B4)
//cUIAction_Soc_AddFriend[0x17D01EE0]
class UcUIAction_Soc_AddFriend : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bWaitingForResult : 1;                          		// 0x0000C0 (0x0004) [0x00000001] 
	int                                                m_nError;                                         		// 0x0000C4 (0x0004)              
	struct FString                                     m_sErrorString;                                   		// 0x0000C8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_AddFriend");
		return pClassPointer;
	};

public:
	void OnAddCompleted(int Error);//APBUserInterface.cUIAction_Soc_AddFriend.OnAddCompleted
};
UClass* UcUIAction_Soc_AddFriend::pClassPointer = NULL;

//0x000020 (0x0000D4 - 0x0000B4)
//cUIAction_Soc_AddIgnore[0x17D01DB0]
class UcUIAction_Soc_AddIgnore : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bWaitingForResult : 1;                          		// 0x0000C0 (0x0004) [0x00000001] 
	int                                                m_nError;                                         		// 0x0000C4 (0x0004)              
	struct FString                                     m_sErrorString;                                   		// 0x0000C8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_AddIgnore");
		return pClassPointer;
	};

public:
	void OnAddCompleted(int Error);//APBUserInterface.cUIAction_Soc_AddIgnore.OnAddCompleted
};
UClass* UcUIAction_Soc_AddIgnore::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_AskToJoinGroup[0x17D01C80]
class UcUIAction_Soc_AskToJoinGroup : public UUIAction
{
public:
	struct FString                                     Player;                                           		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_AskToJoinGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_AskToJoinGroup::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_CanAddFriend[0x17D01B50]
class UcUIAction_Soc_CanAddFriend : public UUIAction
{
public:
	struct FString                                     m_CharacterName;                                  		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_CanAddFriend");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_CanAddFriend::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_CanAddIgnore[0x17D01A20]
class UcUIAction_Soc_CanAddIgnore : public UUIAction
{
public:
	struct FString                                     m_CharacterName;                                  		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_CanAddIgnore");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_CanAddIgnore::pClassPointer = NULL;

//0x000018 (0x0000CC - 0x0000B4)
//cUIAction_Soc_EditIgnore[0x17D018F0]
class UcUIAction_Soc_EditIgnore : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              
	struct FString                                     m_UpdatedReason;                                  		// 0x0000C0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_EditIgnore");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_EditIgnore::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_LeaveGroup[0x17D017C0]
class UcUIAction_Soc_LeaveGroup : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_LeaveGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_LeaveGroup::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RefreshDistrictList[0x17D01690]
class UcUIAction_Soc_RefreshDistrictList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RefreshDistrictList");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RefreshDistrictList::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RefreshFindList[0x17D01560]
class UcUIAction_Soc_RefreshFindList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RefreshFindList");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RefreshFindList::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RefreshFriendList[0x17D01430]
class UcUIAction_Soc_RefreshFriendList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RefreshFriendList");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RefreshFriendList::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RefreshGroupList[0x17D01300]
class UcUIAction_Soc_RefreshGroupList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RefreshGroupList");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RefreshGroupList::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RefreshTeamList[0x17D011D0]
class UcUIAction_Soc_RefreshTeamList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RefreshTeamList");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RefreshTeamList::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_RemoveFriend[0x17D010A0]
class UcUIAction_Soc_RemoveFriend : public UUIAction
{
public:
	struct FString                                     m_FriendName;                                     		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RemoveFriend");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RemoveFriend::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_RemoveFromGroup[0x17D00F70]
class UcUIAction_Soc_RemoveFromGroup : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RemoveFromGroup");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RemoveFromGroup::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_RemoveFromSide[0x17D00E40]
class UcUIAction_Soc_RemoveFromSide : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RemoveFromSide");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RemoveFromSide::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_RemoveIgnore[0x17D00D10]
class UcUIAction_Soc_RemoveIgnore : public UUIAction
{
public:
	struct FString                                     m_PlayerName;                                     		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RemoveIgnore");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RemoveIgnore::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_Soc_RequestLeadership[0x17D00BE0]
class UcUIAction_Soc_RequestLeadership : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_RequestLeadership");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_RequestLeadership::pClassPointer = NULL;

//0x000010 (0x0000C4 - 0x0000B4)
//cUIAction_Soc_SendGroupInvite[0x17D00AB0]
class UcUIAction_Soc_SendGroupInvite : public UUIAction
{
public:
	struct FString                                     m_PlayerToInvite;                                 		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bWaitingForAcknowledgement : 1;                 		// 0x0000C0 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_SendGroupInvite");
		return pClassPointer;
	};

public:
	void OnInviteSent();//APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSent
	void OnInviteSendFailed(int nError);//APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSendFailed
};
UClass* UcUIAction_Soc_SendGroupInvite::pClassPointer = NULL;

//0x000020 (0x0000D4 - 0x0000B4)
//cUIAction_Soc_SendTeamInvite[0x17D00980]
class UcUIAction_Soc_SendTeamInvite : public UUIAction
{
public:
	struct FString                                     m_PlayerToInvite;                                 		// 0x0000B4 (0x000C)              
	unsigned long                                      m_bWaitingForResult : 1;                          		// 0x0000C0 (0x0004) [0x00000001] 
	int                                                m_nError;                                         		// 0x0000C4 (0x0004)              
	struct FString                                     m_sErrorString;                                   		// 0x0000C8 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_SendTeamInvite");
		return pClassPointer;
	};

public:
	void OnSendCompleted(int Error);//APBUserInterface.cUIAction_Soc_SendTeamInvite.OnSendCompleted
};
UClass* UcUIAction_Soc_SendTeamInvite::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_Soc_TransferGroupLeadership[0x17D00850]
class UcUIAction_Soc_TransferGroupLeadership : public UUIAction
{
public:
	struct FString                                     m_NewLeaderName;                                  		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_Soc_TransferGroupLeadership");
		return pClassPointer;
	};
};
UClass* UcUIAction_Soc_TransferGroupLeadership::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUIAction_StartOrStopMovie[0x17D00720]
class UcUIAction_StartOrStopMovie : public UUIAction
{
public:
	class UUIImage*                                    m_pImage;                                         		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StartOrStopMovie");
		return pClassPointer;
	};
};
UClass* UcUIAction_StartOrStopMovie::pClassPointer = NULL;

//0x000000 (0x0000D0 - 0x0000D0)
//cUIAction_StreamLevel[0x17D005F0]
class UcUIAction_StreamLevel : public USeqAct_LevelStreaming
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StreamLevel");
		return pClassPointer;
	};

public:
	bool IsValidUISequenceObject(class UUIScreenObject* TargetObject);//APBUserInterface.cUIAction_StreamLevel.IsValidUISequenceObject
};
UClass* UcUIAction_StreamLevel::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_StringLength[0x17D004C0]
class UcUIAction_StringLength : public UUIAction
{
public:
	struct FString                                     m_sString;                                        		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StringLength");
		return pClassPointer;
	};
};
UClass* UcUIAction_StringLength::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_StringToBool[0x17D00390]
class UcUIAction_StringToBool : public UUIAction
{
public:
	struct FString                                     m_sString;                                        		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StringToBool");
		return pClassPointer;
	};
};
UClass* UcUIAction_StringToBool::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_StringToFloat[0x17D00260]
class UcUIAction_StringToFloat : public UUIAction
{
public:
	struct FString                                     m_sString;                                        		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StringToFloat");
		return pClassPointer;
	};
};
UClass* UcUIAction_StringToFloat::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUIAction_StringToInt[0x17D00130]
class UcUIAction_StringToInt : public UUIAction
{
public:
	struct FString                                     m_sString;                                        		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_StringToInt");
		return pClassPointer;
	};
};
UClass* UcUIAction_StringToInt::pClassPointer = NULL;

//0x000024 (0x0000EC - 0x0000C8)
//cUIAction_UpdateDataStoreValue[0x17D00000]
class UcUIAction_UpdateDataStoreValue : public UUIAction_DataStoreField
{
public:
	struct FString                                     m_sNewStringValue;                                		// 0x0000C8 (0x000C)              
	struct FUIRangeData                                m_NewRangeValue;                                  		// 0x0000D4 (0x0014)              
	unsigned long                                      m_bOnlyUpdateOnCreation : 1;                      		// 0x0000E8 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_UpdateDataStoreValue");
		return pClassPointer;
	};
};
UClass* UcUIAction_UpdateDataStoreValue::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_UpdateList[0x17D2FE20]
class UcUIAction_UpdateList : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_UpdateList");
		return pClassPointer;
	};
};
UClass* UcUIAction_UpdateList::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUIAction_UpdateScrollFrame[0x17D2FCF0]
class UcUIAction_UpdateScrollFrame : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIAction_UpdateScrollFrame");
		return pClassPointer;
	};
};
UClass* UcUIAction_UpdateScrollFrame::pClassPointer = NULL;

//0x000048 (0x0004CC - 0x000484)
//cUIButton[0x17D2FBC0]
class UcUIButton : public UUIButton
{
public:
	class UTexture2D*                                  m_OverlayImage;                                   		// 0x000484 (0x0004)              
	struct FUIDataStoreBinding                         OverlayImageDataSource;                           		// 0x000488 (0x0030)              
	class UUIComp_DrawImage*                           OverlayImageComponent;                            		// 0x0004B8 (0x0004)              
	float                                              m_OverlayUVs[0x4];                                		// 0x0004BC (0x0010)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIButton");
		return pClassPointer;
	};

public:
	struct FString GetDataStoreBinding(int BindingIndex);//APBUserInterface.cUIButton.GetDataStoreBinding
	void SetDataStoreBinding(struct FString MarkupText,int BindingIndex);//APBUserInterface.cUIButton.SetDataStoreBinding
	void NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex);//APBUserInterface.cUIButton.NotifyDataStoreValueUpdated
	bool SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex);//APBUserInterface.cUIButton.SaveSubscriberValue
	void OnSetImage(class UcUIAction_SetImage* Action);//APBUserInterface.cUIButton.OnSetImage
	void GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores);//APBUserInterface.cUIButton.GetBoundDataStores
	bool RefreshSubscriberValue(int BindingIndex);//APBUserInterface.cUIButton.RefreshSubscriberValue
	void ClearBoundDataStores();//APBUserInterface.cUIButton.ClearBoundDataStores
	void SetSecondaryImage(class USurface* NewImage);//APBUserInterface.cUIButton.SetSecondaryImage
};
UClass* UcUIButton::pClassPointer = NULL;

//0x000000 (0x0004CC - 0x0004CC)
//cUIButton_Dynamic[0x17D2FA90]
class UcUIButton_Dynamic : public UcUIButton
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIButton_Dynamic");
		return pClassPointer;
	};
};
UClass* UcUIButton_Dynamic::pClassPointer = NULL;

//0x000310 (0x00077C - 0x00046C)
//cUIThumbnailList[0x17D2F830]
class UcUIThumbnailList : public UUIObject
{
public:
	DWORD                                              VfTable_IUIDataStorePublisher;                    		// 0x00046C (0x0004)              
	struct FUIDataStoreBinding                         m_DataSource;                                     		// 0x000470 (0x0030)              
	class UUIListElementProvider*                      m_DataProvider;                                   		// 0x0004A0 (0x0004)              
	unsigned char                                      _0x0004A4[0x4];                                   		// 0x0004A4 (0x0004) ALIGNEMENT
	TArray<int>                                        m_Items;                                          		// 0x0004A8 (0x000C)              
	class UcUIComp_ThumbnailListPresenter*             m_CellDataComponent;                              		// 0x0004B4 (0x0004)              
	struct FString                                     m_sImageField;                                    		// 0x0004B8 (0x000C)              
	struct FString                                     m_sInfoTextField;                                 		// 0x0004C4 (0x000C)              
	struct FString                                     m_sToolTipField;                                  		// 0x0004D0 (0x000C)              
	struct FUIStyleReference                           m_ImageStyle[0x5];                                		// 0x0004DC (0x00A0)              
	struct FUIStyleReference                           m_BackgroundImageStyle[0x5];                      		// 0x00057C (0x00A0)              
	struct FUIStyleReference                           m_InfoTextStyle[0x5];                             		// 0x00061C (0x00A0)              
	float                                              m_ItemPadding[0x2];                               		// 0x0006BC (0x0008)              
	float                                              m_ImagePadding[0x4];                              		// 0x0006C4 (0x0010)              
	struct FUIScreenValue                              m_ImageSize[0x2];                                 		// 0x0006D4 (0x0010)              
	struct FUIScreenValue                              m_InfoTextHeight;                                 		// 0x0006E4 (0x0008)              
	struct FUIScreenValue                              m_InfoTextOffset;                                 		// 0x0006EC (0x0008)              
	unsigned long                                      m_bUseInfoText : 1;                               		// 0x0006F4 (0x0004) [0x00000001] 
	unsigned long                                      m_bCanSelectDisabledItems : 1;                    		// 0x0006F4 (0x0004) [0x00000002] 
	unsigned long                                      m_bAllowDragAndDropReordering : 1;                		// 0x0006F4 (0x0004) [0x00000004] 
	unsigned long                                      m_bPaged : 1;                                     		// 0x0006F4 (0x0004) [0x00000008] 
	unsigned long                                      m_bDragOperationValid : 1;                        		// 0x0006F4 (0x0004) [0x00000010] 
	struct FUIScreenValue_Position                     m_DragAndDropDeadzone;                            		// 0x0006F8 (0x000C)              
	struct FEnumeratedName                             m_ClickedCue;                                     		// 0x000704 (0x0010)              
	struct FEnumeratedName                             DragCue;                                          		// 0x000714 (0x0010)              
	struct FEnumeratedName                             DropCue;                                          		// 0x000724 (0x0010)              
	struct FEnumeratedName                             DropFailedCue;                                    		// 0x000734 (0x0010)              
	class UUIScrollbar*                                m_pScrollBar;                                     		// 0x000744 (0x0004)              
	int                                                m_nNumCols;                                       		// 0x000748 (0x0004)              
	int                                                m_nNumRows;                                       		// 0x00074C (0x0004)              
	int                                                m_nNumPages;                                      		// 0x000750 (0x0004)              
	int                                                m_nSelectedItem;                                  		// 0x000754 (0x0004)              
	int                                                m_nCurrentPage;                                   		// 0x000758 (0x0004)              
	int                                                m_nCurrentRowOffset;                              		// 0x00075C (0x0004)              
	int                                                m_nToolTipIndex;                                  		// 0x000760 (0x0004)              
	struct FUIScreenValue_Position                     m_StartMousePosition;                             		// 0x000764 (0x000C)              
	float                                              m_fAutoScrollStart;                               		// 0x000770 (0x0004)              
	float                                              m_fAutoScrollAmount;                              		// 0x000774 (0x0004)              
	int                                                m_nInsertPosition;                                		// 0x000778 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIThumbnailList");
		return pClassPointer;
	};

public:
	bool RefreshSubscriberValue(int BindingIndex);//APBUserInterface.cUIThumbnailList.RefreshSubscriberValue
	void OnScrollBarSpaceClicked(class UUIScrollbar* Sender,float PositionPerc,int PlayerIndex);//APBUserInterface.cUIThumbnailList.OnScrollBarSpaceClicked
	int GetNumItems();//APBUserInterface.cUIThumbnailList.GetNumItems
	int GetNumCols();//APBUserInterface.cUIThumbnailList.GetNumCols
	void GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores);//APBUserInterface.cUIThumbnailList.GetBoundDataStores
	bool OnSequenceAction(class USequenceAction* Action);//APBUserInterface.cUIThumbnailList.OnSequenceAction
	int GetNumRows();//APBUserInterface.cUIThumbnailList.GetNumRows
	int GetCurrentItem();//APBUserInterface.cUIThumbnailList.GetCurrentItem
	float GetInfoTextHeight();//APBUserInterface.cUIThumbnailList.GetInfoTextHeight
	void ClearBoundDataStores();//APBUserInterface.cUIThumbnailList.ClearBoundDataStores
	int GetNumPages();//APBUserInterface.cUIThumbnailList.GetNumPages
	void ChangePage(int nDelta);//APBUserInterface.cUIThumbnailList.ChangePage
	void OnSetListIndex(class UUIAction_SetListIndex* Action);//APBUserInterface.cUIThumbnailList.OnSetListIndex
	bool SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex);//APBUserInterface.cUIThumbnailList.SaveSubscriberValue
	void SetDataStoreBinding(struct FString MarkupText,int BindingIndex);//APBUserInterface.cUIThumbnailList.SetDataStoreBinding
	void NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex);//APBUserInterface.cUIThumbnailList.NotifyDataStoreValueUpdated
	int GetCurrentPage();//APBUserInterface.cUIThumbnailList.GetCurrentPage
	bool SelectItem(int nIndex);//APBUserInterface.cUIThumbnailList.SelectItem
	float GetImageWidth();//APBUserInterface.cUIThumbnailList.GetImageWidth
	float GetImageHeight(bool bIncludeText);//APBUserInterface.cUIThumbnailList.GetImageHeight
	struct FString GetDataStoreBinding(int BindingIndex);//APBUserInterface.cUIThumbnailList.GetDataStoreBinding
	void OnChangeThumbnailListPage(class UcUIAction_ChangeThumbnailListPage* Action);//APBUserInterface.cUIThumbnailList.OnChangeThumbnailListPage
	int GetNumVisibleItems();//APBUserInterface.cUIThumbnailList.GetNumVisibleItems
	bool OnScrollBarMoved(class UUIScrollbar* Sender,float PositionChange,bool bPositionMaxed);//APBUserInterface.cUIThumbnailList.OnScrollBarMoved
};
UClass* UcUIThumbnailList::pClassPointer = NULL;

//0x00006C (0x0000B8 - 0x00004C)
//cUIComp_ThumbnailListPresenter[0x17D2F960]
class UcUIComp_ThumbnailListPresenter : public UUIComponent
{
public:
	TArray<struct FUIThumbnailListItem>                m_ListItems;                                      		// 0x00004C (0x000C)              
	unsigned long                                      m_bReapplyFormatting : 1;                         		// 0x000058 (0x0004) [0x00000001] 
	class UUIStyle_Image*                              m_ImageStyle[0x5];                                		// 0x00005C (0x0014)              
	class UUIStyle_Combo*                              m_InfoTextCellStyle[0x5];                         		// 0x000070 (0x0014)              
	class UUITexture*                                  m_ImageBackground[0x5];                           		// 0x000084 (0x0014)              
	class UUITexture*                                  m_InfoTextBackground[0x5];                        		// 0x000098 (0x0014)              
	float                                              m_fItemWidth;                                     		// 0x0000AC (0x0004)              
	float                                              m_fItemHeight;                                    		// 0x0000B0 (0x0004)              
	float                                              m_fItemTextHeight;                                		// 0x0000B4 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIComp_ThumbnailListPresenter");
		return pClassPointer;
	};
};
UClass* UcUIComp_ThumbnailListPresenter::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUICond_Contact_IsMissionProvider[0x17D2F700]
class UcUICond_Contact_IsMissionProvider : public UUIAction
{
public:
	struct FString                                     m_sContactUID;                                    		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Contact_IsMissionProvider");
		return pClassPointer;
	};
};
UClass* UcUICond_Contact_IsMissionProvider::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Fnd_IsGroupAdvertised[0x17D2F5D0]
class UcUICond_Fnd_IsGroupAdvertised : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Fnd_IsGroupAdvertised");
		return pClassPointer;
	};
};
UClass* UcUICond_Fnd_IsGroupAdvertised::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Fnd_IsTeamAdvertised[0x17D2F4A0]
class UcUICond_Fnd_IsTeamAdvertised : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Fnd_IsTeamAdvertised");
		return pClassPointer;
	};
};
UClass* UcUICond_Fnd_IsTeamAdvertised::pClassPointer = NULL;

//0x000004 (0x0000B8 - 0x0000B4)
//cUICond_IsInMission[0x17D2F370]
class UcUICond_IsInMission : public UUIAction
{
public:
	unsigned long                                      IncludeUnacceptedMissions : 1;                    		// 0x0000B4 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_IsInMission");
		return pClassPointer;
	};
};
UClass* UcUICond_IsInMission::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_IsPlayerInDistrict[0x17D2F240]
class UcUICond_IsPlayerInDistrict : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_IsPlayerInDistrict");
		return pClassPointer;
	};
};
UClass* UcUICond_IsPlayerInDistrict::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_IsPlayerLoggedOut[0x17D2F110]
class UcUICond_IsPlayerLoggedOut : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_IsPlayerLoggedOut");
		return pClassPointer;
	};
};
UClass* UcUICond_IsPlayerLoggedOut::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUICond_IsSlotEmpty[0x17D2EFE0]
class UcUICond_IsSlotEmpty : public UUIAction
{
public:
	struct FString                                     m_sSlotNumber;                                    		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_IsSlotEmpty");
		return pClassPointer;
	};
};
UClass* UcUICond_IsSlotEmpty::pClassPointer = NULL;

//0x00000C (0x0000C0 - 0x0000B4)
//cUICond_ShouldFastLogin[0x17D2EEB0]
class UcUICond_ShouldFastLogin : public UUIAction
{
public:
	struct FString                                     m_sHasLoggedInBefore;                             		// 0x0000B4 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_ShouldFastLogin");
		return pClassPointer;
	};
};
UClass* UcUICond_ShouldFastLogin::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_HasFriends[0x17D2ED80]
class UcUICond_Soc_HasFriends : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_HasFriends");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_HasFriends::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_HasGroup[0x17D2EC50]
class UcUICond_Soc_HasGroup : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_HasGroup");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_HasGroup::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_HasIgnore[0x17D2EB20]
class UcUICond_Soc_HasIgnore : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_HasIgnore");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_HasIgnore::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_HasSide[0x17D2E9F0]
class UcUICond_Soc_HasSide : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_HasSide");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_HasSide::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_HasTeam[0x17D2E8C0]
class UcUICond_Soc_HasTeam : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_HasTeam");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_HasTeam::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_IsGroupLeader[0x17D2E790]
class UcUICond_Soc_IsGroupLeader : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_IsGroupLeader");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_IsGroupLeader::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_IsSideLeader[0x17D2E660]
class UcUICond_Soc_IsSideLeader : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_IsSideLeader");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_IsSideLeader::pClassPointer = NULL;

//0x000000 (0x0000B4 - 0x0000B4)
//cUICond_Soc_IsTeamLeader[0x17D2E530]
class UcUICond_Soc_IsTeamLeader : public UUIAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUICond_Soc_IsTeamLeader");
		return pClassPointer;
	};
};
UClass* UcUICond_Soc_IsTeamLeader::pClassPointer = NULL;

//0x00006C (0x0000AC - 0x000040)
//cUIConsoleCommands[0x17D2E400]
class UcUIConsoleCommands : public UObject
{
public:
	DWORD                                              VfTable_FExec;                                    		// 0x000040 (0x0004)              
	unsigned long                                      m_bHandled : 1;                                   		// 0x000044 (0x0004) [0x00000001] 
	struct FString                                     m_sSocialUI;                                      		// 0x000048 (0x000C)              
	class UUIScene*                                    m_pSocialUI;                                      		// 0x000054 (0x0004)              
	struct FString                                     m_sSocialUI_CloseEvent;                           		// 0x000058 (0x000C)              
	class UUIScene*                                    m_pWeaponCustomisationUI;                         		// 0x000064 (0x0004)              
	struct FString                                     m_sWeaponCustomisationUI_CloseEvent;              		// 0x000068 (0x000C)              
	class UUIScene*                                    m_pReportBugUI;                                   		// 0x000074 (0x0004)              
	struct FString                                     m_sReportBugUI;                                   		// 0x000078 (0x000C)              
	struct FString                                     m_sReportBugUI_CloseEvent;                        		// 0x000084 (0x000C)              
	struct FString                                     m_sProvingGroundsChallenges;                      		// 0x000090 (0x000C)              
	class UUIScene*                                    m_pProvingGroundsChallenges;                      		// 0x00009C (0x0004)              
	struct FString                                     m_sProvingGroundsChallenges_CloseEvent;           		// 0x0000A0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIConsoleCommands");
		return pClassPointer;
	};

public:
	void TogglePopupDialogTool();//APBUserInterface.cUIConsoleCommands.TogglePopupDialogTool
	void ResetPopupCounters();//APBUserInterface.cUIConsoleCommands.ResetPopupCounters
	bool OpenTestContactUI(struct FString sUIType);//APBUserInterface.cUIConsoleCommands.OpenTestContactUI
	bool PreviewMissionStageDisable();//APBUserInterface.cUIConsoleCommands.PreviewMissionStageDisable
	void ChangeLanguage(struct FString sNewLanguage);//APBUserInterface.cUIConsoleCommands.ChangeLanguage
	bool DebugShowBrowserNavigation(bool bVisible);//APBUserInterface.cUIConsoleCommands.DebugShowBrowserNavigation
	bool ToggleStorageInventoryUI();//APBUserInterface.cUIConsoleCommands.ToggleStorageInventoryUI
	bool ResetUserNameAndPassword();//APBUserInterface.cUIConsoleCommands.ResetUserNameAndPassword
	bool ToggleMailUI();//APBUserInterface.cUIConsoleCommands.ToggleMailUI
	bool ToggleMissionSummary();//APBUserInterface.cUIConsoleCommands.ToggleMissionSummary
	bool ToggleMarketplaceUI();//APBUserInterface.cUIConsoleCommands.ToggleMarketplaceUI
	bool ToggleSocialUI();//APBUserInterface.cUIConsoleCommands.ToggleSocialUI
	bool Editor_OpenMarketplaceUI();//APBUserInterface.cUIConsoleCommands.Editor_OpenMarketplaceUI
	bool OpenContactUI(struct FString sContact,struct FString sContactRole);//APBUserInterface.cUIConsoleCommands.OpenContactUI
	bool ScreenShot();//APBUserInterface.cUIConsoleCommands.ScreenShot
	bool OpenMissionSummary();//APBUserInterface.cUIConsoleCommands.OpenMissionSummary
	bool ToggleTeamMgmtUI(bool bForce);//APBUserInterface.cUIConsoleCommands.ToggleTeamMgmtUI
	bool CrimeEventAlertUI(bool bShow);//APBUserInterface.cUIConsoleCommands.CrimeEventAlertUI
	bool InvertMouse(bool bInvert);//APBUserInterface.cUIConsoleCommands.InvertMouse
	bool ToggleReportBugUI();//APBUserInterface.cUIConsoleCommands.ToggleReportBugUI
	void OnMenuClosed(struct FName Menu);//APBUserInterface.cUIConsoleCommands.OnMenuClosed
	void TogglePopupCues();//APBUserInterface.cUIConsoleCommands.TogglePopupCues
	bool OpenArmasStore(struct FString sSDDURLTag);//APBUserInterface.cUIConsoleCommands.OpenArmasStore
	bool ToggleMusicPlaybackUI();//APBUserInterface.cUIConsoleCommands.ToggleMusicPlaybackUI
	bool FlushMailCache();//APBUserInterface.cUIConsoleCommands.FlushMailCache
	bool CloseContactUI();//APBUserInterface.cUIConsoleCommands.CloseContactUI
	bool OpenLobby();//APBUserInterface.cUIConsoleCommands.OpenLobby
	bool ToggleTutorialUI(bool bForce);//APBUserInterface.cUIConsoleCommands.ToggleTutorialUI
	bool InGameQuestionAccepted();//APBUserInterface.cUIConsoleCommands.InGameQuestionAccepted
	bool OpenViewUI(struct FString sInventoryItemType);//APBUserInterface.cUIConsoleCommands.OpenViewUI
	bool ForceWorldsOffline(bool bOffline);//APBUserInterface.cUIConsoleCommands.ForceWorldsOffline
	bool InGameQuestionDeclined();//APBUserInterface.cUIConsoleCommands.InGameQuestionDeclined
	bool OpenAPBSupportPage(struct FString sSDDURLTag);//APBUserInterface.cUIConsoleCommands.OpenAPBSupportPage
	bool OpenCityMap();//APBUserInterface.cUIConsoleCommands.OpenCityMap
	bool ToggleOptionsUI();//APBUserInterface.cUIConsoleCommands.ToggleOptionsUI
	void InternalToggleInventoryUI();//APBUserInterface.cUIConsoleCommands.InternalToggleInventoryUI
	bool CloseMissionSummary();//APBUserInterface.cUIConsoleCommands.CloseMissionSummary
	void ToggleTooltipTool();//APBUserInterface.cUIConsoleCommands.ToggleTooltipTool
	bool ToggleDeploymentInventoryUI();//APBUserInterface.cUIConsoleCommands.ToggleDeploymentInventoryUI
	bool OpenKnowledgeBase();//APBUserInterface.cUIConsoleCommands.OpenKnowledgeBase
	bool FlushMarketplaceCache();//APBUserInterface.cUIConsoleCommands.FlushMarketplaceCache
	bool ResetEULATOSAcceptDates();//APBUserInterface.cUIConsoleCommands.ResetEULATOSAcceptDates
	bool ToggleProvingGroundsChallengesUI();//APBUserInterface.cUIConsoleCommands.ToggleProvingGroundsChallengesUI
	bool OpenBrowser(struct FString sUrl,struct FString sBrowserTitle);//APBUserInterface.cUIConsoleCommands.OpenBrowser
	bool ToggleScoreboard();//APBUserInterface.cUIConsoleCommands.ToggleScoreboard
	bool AddInGameQuestion(struct FString sText);//APBUserInterface.cUIConsoleCommands.AddInGameQuestion
	bool TiledScreenShot();//APBUserInterface.cUIConsoleCommands.TiledScreenShot
	bool PreviewMissionStage(struct FString sMissionTemplate,int nStage,bool bOpposition,struct FString sFaction);//APBUserInterface.cUIConsoleCommands.PreviewMissionStage
};
UClass* UcUIConsoleCommands::pClassPointer = NULL;

//0x00001C (0x00009C - 0x000080)
//cUIDataStore[0x17D2E2D0]
class UcUIDataStore : public UUIDataStore
{
public:
	TArray<class UClass*>                              m_acListProviders;                                		// 0x000080 (0x000C)              
	TArray<class UcUIListProvider*>                    m_aListProviders;                                 		// 0x00008C (0x000C)              
	unsigned long                                      m_bExposePlayerFunds : 1;                         		// 0x000098 (0x0004) [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIDataStore");
		return pClassPointer;
	};

public:
	void ReleaseAssets();//APBUserInterface.cUIDataStore.ReleaseAssets
	void LoadAssets();//APBUserInterface.cUIDataStore.LoadAssets
	bool NotifyGameSessionEnded();//APBUserInterface.cUIDataStore.NotifyGameSessionEnded
};
UClass* UcUIDataStore::pClassPointer = NULL;

//0x00002C (0x0000C8 - 0x00009C)
//cUIDataStore_CharacterMenu[0x17D2E1A0]
class UcUIDataStore_CharacterMenu : public UcUIDataStore
{
public:
	DWORD                                              VfTable_IUIListElementProvider;                   		// 0x00009C (0x0004)              
	DWORD                                              VfTable_IUIListElementCellProvider;               		// 0x0000A0 (0x0004)              
	struct FString                                     m_sCharacterName;                                 		// 0x0000A4 (0x000C)              
	int                                                m_nCharacterUID;                                  		// 0x0000B0 (0x0004)              
	unsigned long                                      m_bCharacterInSameDistrict : 1;                   		// 0x0000B4 (0x0004) [0x00000001] 
	unsigned long                                      m_bCharacterIsSameFaction : 1;                    		// 0x0000B4 (0x0004) [0x00000002] 
	class UUIScene*                                    m_pScene;                                         		// 0x0000B8 (0x0004)              
	TArray<class UTexture2D*>                          m_Icons;                                          		// 0x0000BC (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIDataStore_CharacterMenu");
		return pClassPointer;
	};

public:
	bool OnRawInputKey(struct FInputEventParameters Input);//APBUserInterface.cUIDataStore_CharacterMenu.OnRawInputKey
};
UClass* UcUIDataStore_CharacterMenu::pClassPointer = NULL;

//0x0000C4 (0x000160 - 0x00009C)
//cUIDataStore_FileSelector[0x17D2E070]
class UcUIDataStore_FileSelector : public UcUIDataStore
{
public:
	DWORD                                              VfTable_IUIListElementProvider;                   		// 0x00009C (0x0004)              
	DWORD                                              VfTable_IUIListElementCellProvider;               		// 0x0000A0 (0x0004)              
	unsigned char                                      m_Filter_FileType;                                		// 0x0000A4 (0x0001)              PROPERTY: eUIFileSelector_FileType
	unsigned char                                      _0x0000A5[0x3];                                   		// 0x0000A5 (0x0003) MISSED OFFSET
	struct FString                                     m_Filter_FileName;                                		// 0x0000A8 (0x000C)              
	struct FString                                     m_sTitle;                                         		// 0x0000B4 (0x000C)              
	struct FString                                     m_sPrompt;                                        		// 0x0000C0 (0x000C)              
	unsigned long                                      m_bDisplayedDirectory_IsRoot : 1;                 		// 0x0000CC (0x0004) [0x00000001] 
	unsigned long                                      m_bDisplayedDirectory_IsDrive : 1;                		// 0x0000CC (0x0004) [0x00000002] 
	unsigned long                                      m_bDisplayedDirectory_IsNetworkSystem : 1;        		// 0x0000CC (0x0004) [0x00000004] 
	unsigned long                                      m_bDisplayedDirectory_IsNetworkShare : 1;         		// 0x0000CC (0x0004) [0x00000008] 
	unsigned long                                      m_bDisplayedDirectory_IsNetworkDirectory : 1;     		// 0x0000CC (0x0004) [0x00000010] 
	unsigned long                                      m_bAllowMultipleResults : 1;                      		// 0x0000CC (0x0004) [0x00000020] 
	struct FString                                     m_sDisplayedDirectory_PathName;                   		// 0x0000D0 (0x000C)              
	struct FString                                     m_sDisplayedNetworkSystem;                        		// 0x0000DC (0x000C)              
	TArray<struct FtUIFileSelector_File>               m_DisplayedDirectory_Contents;                    		// 0x0000E8 (0x000C)              
	TArray<struct FString>                             m_sDrives;                                        		// 0x0000F4 (0x000C)              
	TArray<struct FString>                             m_sShares;                                        		// 0x000100 (0x000C)              
	class UTexture2D*                                  m_pFileIcon_Hdd;                                  		// 0x00010C (0x0004)              
	class UTexture2D*                                  m_pFileIcon_OpticalDrive_Enabled;                 		// 0x000110 (0x0004)              
	class UTexture2D*                                  m_pFileIcon_NetworkShare;                         		// 0x000114 (0x0004)              
	class UTexture2D*                                  m_pFileIcon_RemovableDrive;                       		// 0x000118 (0x0004)              
	class UTexture2D*                                  m_pFileIcon_SystemRoot;                           		// 0x00011C (0x0004)              
	class UTexture2D*                                  m_pFileIcon_ParentFolder;                         		// 0x000120 (0x0004)              
	class UTexture2D*                                  m_pFileIcon_ChildFolder;                          		// 0x000124 (0x0004)              
	class UTexture2D*                                  m_pFileIcon_File;                                 		// 0x000128 (0x0004)              
	class UUIScene*                                    m_pTemplateDialogScene;                           		// 0x00012C (0x0004)              
	struct FString                                     m_sTemplateDialogScene;                           		// 0x000130 (0x000C)              
	struct FScriptDelegate                             __OnSelectionMade__Delegate;                      		// 0x00013C (0x000C)              
	struct FScriptDelegate                             __OnSelectionCanceled__Delegate;                  		// 0x000148 (0x000C)              
	struct FScriptDelegate                             __OnSelectionDone__Delegate;                      		// 0x000154 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIDataStore_FileSelector");
		return pClassPointer;
	};

public:
	void OnSelectionMade(struct FString sSelectedPath);//APBUserInterface.cUIDataStore_FileSelector.OnSelectionMade
	void OnSelectionDone();//APBUserInterface.cUIDataStore_FileSelector.OnSelectionDone
	void OnSelectionCanceled();//APBUserInterface.cUIDataStore_FileSelector.OnSelectionCanceled
};
UClass* UcUIDataStore_FileSelector::pClassPointer = NULL;

//0x000040 (0x0000DC - 0x00009C)
//cUIDataStore_FileSystem[0x17D2DF40]
class UcUIDataStore_FileSystem : public UcUIDataStore
{
public:
	DWORD                                              VfTable_IUIListElementProvider;                   		// 0x00009C (0x0004)              
	DWORD                                              VfTable_IUIListElementCellProvider;               		// 0x0000A0 (0x0004)              
	unsigned long                                      m_bBrowsing : 1;                                  		// 0x0000A4 (0x0004) [0x00000001] 
	unsigned long                                      m_bAllowMultipleResults : 1;                      		// 0x0000A4 (0x0004) [0x00000002] 
	unsigned long                                      m_bShowFiles : 1;                                 		// 0x0000A4 (0x0004) [0x00000004] 
	unsigned long                                      m_bCurrentDirectory_IsLibrary : 1;                		// 0x0000A4 (0x0004) [0x00000008] 
	struct FString                                     m_sNameFilter;                                    		// 0x0000A8 (0x000C)              
	unsigned char                                      m_eCurrentDirectory_ItemType;                     		// 0x0000B4 (0x0001)              PROPERTY: eFSItemType
	unsigned char                                      m_eCurrentDirectory_SpecialDirectory;             		// 0x0000B5 (0x0001)              PROPERTY: eUISpecialDirectory
	unsigned char                                      _0x0000B6[0x2];                                   		// 0x0000B6 (0x0002) MISSED OFFSET
	struct FSFGAOF                                     m_nCurrentDirectory_AttributeFlags;               		// 0x0000B8 (0x0004)              
	DWORD                                              m_pCurrentDirectory_IDList;                       		// 0x0000BC (0x0004)              
	DWORD                                              m_pCurrentDirectory_Folder;                       		// 0x0000C0 (0x0004)              
	struct FString                                     m_sCurrentDirectory_PathName;                     		// 0x0000C4 (0x000C)              
	TArray<struct FUIFileSystem_File>                  m_CurrentDirectory_Contents;                      		// 0x0000D0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class APBUserInterface.cUIDataStore_FileSystem");
		return pClassPointer;
	};

public:
	void BrowseToParentDirectory();//APBUserInterface.cUIDataStore_FileSystem.BrowseToParentDirectory
	bool BrowseToBaseDirectory();//APBUserInterface.cUIDataStore_FileSystem.BrowseToBaseDirectory
	void BrowseToItemDirectory(struct FUIFileSystem_File* i_Item);//APBUserInterface.cUIDataStore_FileSystem.BrowseToItemDirectory
	void BrowseToSpecialDirectory(unsigned char i_eDirectory);//APBUserInterface.cUIDataStore_FileSystem.BrowseToSpecialDirectory
	void StartBrowsing(bool i_bShowFiles,struct FString i_sNameFilter,bool i_bAllowMultipleResults);//APBUserInterface.cUIDataStore_FileSystem.StartBrowsing
	bool IsInSelectableDirectory();//APBUserInterface.cUIDataStore_FileSystem.IsInSelectableDirectory
	bool BrowseToDirectory(struct FString i_sPathName);//APBUserInterface.cUIDataStore_FileSystem.BrowseToDirectory
	void BrowseToItemDirectoryByID(int i_nID);//APBUserInterface.cUIDataStore_FileSystem.BrowseToItemDirectoryByID
	struct FString GetFallbackIconFor(unsigned char i_ItemType);//APBUserInterface.cUIDataStore_FileSystem.GetFallbackIconFor
	TArray<struct FUIFileSystem_File> GetPathContent(struct FString i_sPathName,bool i_bShowFiles,struct FString i_sFilter);//APBUserInterface.cUIDataStore_FileSystem.GetPathContent
	struct FString GetIconFor(unsigned char i_ItemType,unsigned char i_SpecialDirectory);//APBUserInterface.cUIDataStore_FileSystem.GetIconFor
	void EndBrowsing();//APBUserInterface.cUIDataStore_FileSystem.EndBrowsing
};
UClass* UcUIDataStore_FileSystem::pClassPointer = NULL;

//0x00008C (0x000128 - 0x00009C)
//cUIDataStore_Fnd_GroupFinder[0x17D2DE10]
class UcUIDataStore_Fnd_GroupFinder : public UcUIDataStore
{
public:
	DWORD                                              VfTable_IiUIListPagedElementProvider;             		// 0x00009C (0x0004)              
	DWORD                                              VfTable_IUIListElementCellProvider;               		// 0x0000A0 (0x0004)              
	unsigned char                                      PageCache[0x3C];                                  		// 0x0000A4 (0x003C)              UNKNOWN PROPERTY: MapProperty
	TArray<int>                                        LRUPages;                                         		// 0x0000E0 (0x000C)              
	unsigned char                                      m_HasLocalEntry;                                  		// 0x0000EC (0x0001)              PROPERTY: GroupFinder_LocalEntryCacheState
