
struct APBUserInterface_ExportErrorMessage_Parms
{
};

void UcUIAction_HostingOp::ExportErrorMessage()
{
	static UFieldFunc* pFnExportErrorMessage = NULL;
	if(!pFnExportErrorMessage)
		pFnExportErrorMessage = UObject::FindFunction("Function APBUserInterface.cUIAction_HostingOp.ExportErrorMessage");

	APBUserInterface_ExportErrorMessage_Parms ExportErrorMessage_Parms;
	pFnExportErrorMessage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnExportErrorMessage,NULL,&ExportErrorMessage_Parms,NULL);
	pFnExportErrorMessage->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnFadeCompleted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIAction_HostingOp::OnFadeCompleted()
{
	static UFieldFunc* pFnOnFadeCompleted = NULL;
	if(!pFnOnFadeCompleted)
		pFnOnFadeCompleted = UObject::FindFunction("Function APBUserInterface.cUIAction_HostingOp.OnFadeCompleted");

	APBUserInterface_OnFadeCompleted_Parms OnFadeCompleted_Parms;
	ProcessEvent(pFnOnFadeCompleted,NULL,&OnFadeCompleted_Parms,NULL);
	return OnFadeCompleted_Parms.ReturnValue;
}

struct APBUserInterface_SetupScene_Parms
{
	class UcUIScene_BaseScene*                         Scene;                                            		// 0x000000 (0x0004)              
	//class UUILabel*                                    Lbl;                                              		// 0x000004 (0x0004)              
	//class UUIPanel*                                    Pnl;                                              		// 0x000008 (0x0004)              
};

void UcUIAction_HostingOp::SetupScene(class UcUIScene_BaseScene* Scene)
{
	static UFieldFunc* pFnSetupScene = NULL;
	if(!pFnSetupScene)
		pFnSetupScene = UObject::FindFunction("Function APBUserInterface.cUIAction_HostingOp.SetupScene");

	APBUserInterface_SetupScene_Parms SetupScene_Parms;
	SetupScene_Parms.Scene = Scene;
	ProcessEvent(pFnSetupScene,NULL,&SetupScene_Parms,NULL);
}

struct APBUserInterface_ResetErrorMessage_Parms
{
};

void UcUIAction_HostingOp::ResetErrorMessage()
{
	static UFieldFunc* pFnResetErrorMessage = NULL;
	if(!pFnResetErrorMessage)
		pFnResetErrorMessage = UObject::FindFunction("Function APBUserInterface.cUIAction_HostingOp.ResetErrorMessage");

	APBUserInterface_ResetErrorMessage_Parms ResetErrorMessage_Parms;
	ProcessEvent(pFnResetErrorMessage,NULL,&ResetErrorMessage_Parms,NULL);
}

struct APBUserInterface_UpdateTexture_Parms
{
	float                                              i_fTargetGamma;                                   		// 0x000000 (0x0004)              
};

void UcGammaPreviewTexture::UpdateTexture(float i_fTargetGamma)
{
	static UFieldFunc* pFnUpdateTexture = NULL;
	if(!pFnUpdateTexture)
		pFnUpdateTexture = UObject::FindFunction("Function APBUserInterface.cGammaPreviewTexture.UpdateTexture");

	APBUserInterface_UpdateTexture_Parms UpdateTexture_Parms;
	UpdateTexture_Parms.i_fTargetGamma = i_fTargetGamma;
	pFnUpdateTexture->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUpdateTexture,NULL,&UpdateTexture_Parms,NULL);
	pFnUpdateTexture->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnAssignSelectedCharacterToPlaceholder_Parms
{
	class UcSeqAct_AssignSelectedCharacterToPlaceholder* i_pAction;                                        		// 0x000000 (0x0004)              
};

void AcPlaceholderSkeletalMesh::OnAssignSelectedCharacterToPlaceholder(class UcSeqAct_AssignSelectedCharacterToPlaceholder* i_pAction)
{
	static UFieldFunc* pFnOnAssignSelectedCharacterToPlaceholder = NULL;
	if(!pFnOnAssignSelectedCharacterToPlaceholder)
		pFnOnAssignSelectedCharacterToPlaceholder = UObject::FindFunction("Function APBUserInterface.cPlaceholderSkeletalMesh.OnAssignSelectedCharacterToPlaceholder");

	APBUserInterface_OnAssignSelectedCharacterToPlaceholder_Parms OnAssignSelectedCharacterToPlaceholder_Parms;
	OnAssignSelectedCharacterToPlaceholder_Parms.i_pAction = i_pAction;
	pFnOnAssignSelectedCharacterToPlaceholder->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnAssignSelectedCharacterToPlaceholder,NULL,&OnAssignSelectedCharacterToPlaceholder_Parms,NULL);
	pFnOnAssignSelectedCharacterToPlaceholder->FunctionFlags |= 0x400;
}

struct APBUserInterface_UpdateSkeletalMesh_Parms
{
	class USkeletalMeshComponent*                      NewComponent;                                     		// 0x000000 (0x0004)              
};

void AcPlaceholderSkeletalMesh::UpdateSkeletalMesh(class USkeletalMeshComponent* NewComponent)
{
	static UFieldFunc* pFnUpdateSkeletalMesh = NULL;
	if(!pFnUpdateSkeletalMesh)
		pFnUpdateSkeletalMesh = UObject::FindFunction("Function APBUserInterface.cPlaceholderSkeletalMesh.UpdateSkeletalMesh");

	APBUserInterface_UpdateSkeletalMesh_Parms UpdateSkeletalMesh_Parms;
	UpdateSkeletalMesh_Parms.NewComponent = NewComponent;
	pFnUpdateSkeletalMesh->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUpdateSkeletalMesh,NULL,&UpdateSkeletalMesh_Parms,NULL);
	pFnUpdateSkeletalMesh->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AcPlaceholderSkeletalMesh::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cPlaceholderSkeletalMesh.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_CastPopupDialogCategory_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastPopupDialogCategory(int I)
{
	static UFieldFunc* pFnCastPopupDialogCategory = NULL;
	if(!pFnCastPopupDialogCategory)
		pFnCastPopupDialogCategory = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastPopupDialogCategory");

	APBUserInterface_CastPopupDialogCategory_Parms CastPopupDialogCategory_Parms;
	CastPopupDialogCategory_Parms.I = I;
	ProcessEvent(pFnCastPopupDialogCategory,NULL,&CastPopupDialogCategory_Parms,NULL);
	return CastPopupDialogCategory_Parms.ReturnValue;
}

struct APBUserInterface_CastHUDUsables_DisplaySetting_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastHUDUsables_DisplaySetting(int I)
{
	static UFieldFunc* pFnCastHUDUsables_DisplaySetting = NULL;
	if(!pFnCastHUDUsables_DisplaySetting)
		pFnCastHUDUsables_DisplaySetting = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastHUDUsables_DisplaySetting");

	APBUserInterface_CastHUDUsables_DisplaySetting_Parms CastHUDUsables_DisplaySetting_Parms;
	CastHUDUsables_DisplaySetting_Parms.I = I;
	ProcessEvent(pFnCastHUDUsables_DisplaySetting,NULL,&CastHUDUsables_DisplaySetting_Parms,NULL);
	return CastHUDUsables_DisplaySetting_Parms.ReturnValue;
}

struct APBUserInterface_CastDialogResult_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastDialogResult(int I)
{
	static UFieldFunc* pFnCastDialogResult = NULL;
	if(!pFnCastDialogResult)
		pFnCastDialogResult = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastDialogResult");

	APBUserInterface_CastDialogResult_Parms CastDialogResult_Parms;
	CastDialogResult_Parms.I = I;
	ProcessEvent(pFnCastDialogResult,NULL,&CastDialogResult_Parms,NULL);
	return CastDialogResult_Parms.ReturnValue;
}

struct APBUserInterface_CastChatCommandWorksFromState_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastChatCommandWorksFromState(int I)
{
	static UFieldFunc* pFnCastChatCommandWorksFromState = NULL;
	if(!pFnCastChatCommandWorksFromState)
		pFnCastChatCommandWorksFromState = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastChatCommandWorksFromState");

	APBUserInterface_CastChatCommandWorksFromState_Parms CastChatCommandWorksFromState_Parms;
	CastChatCommandWorksFromState_Parms.I = I;
	ProcessEvent(pFnCastChatCommandWorksFromState,NULL,&CastChatCommandWorksFromState_Parms,NULL);
	return CastChatCommandWorksFromState_Parms.ReturnValue;
}

struct APBUserInterface_CastChatMessageCategory_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastChatMessageCategory(int I)
{
	static UFieldFunc* pFnCastChatMessageCategory = NULL;
	if(!pFnCastChatMessageCategory)
		pFnCastChatMessageCategory = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastChatMessageCategory");

	APBUserInterface_CastChatMessageCategory_Parms CastChatMessageCategory_Parms;
	CastChatMessageCategory_Parms.I = I;
	ProcessEvent(pFnCastChatMessageCategory,NULL,&CastChatMessageCategory_Parms,NULL);
	return CastChatMessageCategory_Parms.ReturnValue;
}

struct APBUserInterface_CastScaleformInterface_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastScaleformInterface(int I)
{
	static UFieldFunc* pFnCastScaleformInterface = NULL;
	if(!pFnCastScaleformInterface)
		pFnCastScaleformInterface = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastScaleformInterface");

	APBUserInterface_CastScaleformInterface_Parms CastScaleformInterface_Parms;
	CastScaleformInterface_Parms.I = I;
	ProcessEvent(pFnCastScaleformInterface,NULL,&CastScaleformInterface_Parms,NULL);
	return CastScaleformInterface_Parms.ReturnValue;
}

struct APBUserInterface_CastLoginState_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastLoginState(int I)
{
	static UFieldFunc* pFnCastLoginState = NULL;
	if(!pFnCastLoginState)
		pFnCastLoginState = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastLoginState");

	APBUserInterface_CastLoginState_Parms CastLoginState_Parms;
	CastLoginState_Parms.I = I;
	ProcessEvent(pFnCastLoginState,NULL,&CastLoginState_Parms,NULL);
	return CastLoginState_Parms.ReturnValue;
}

struct APBUserInterface_CastScaleformLayoutMode_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastScaleformLayoutMode(int I)
{
	static UFieldFunc* pFnCastScaleformLayoutMode = NULL;
	if(!pFnCastScaleformLayoutMode)
		pFnCastScaleformLayoutMode = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastScaleformLayoutMode");

	APBUserInterface_CastScaleformLayoutMode_Parms CastScaleformLayoutMode_Parms;
	CastScaleformLayoutMode_Parms.I = I;
	ProcessEvent(pFnCastScaleformLayoutMode,NULL,&CastScaleformLayoutMode_Parms,NULL);
	return CastScaleformLayoutMode_Parms.ReturnValue;
}

struct APBUserInterface_CastScaleformCriticalTimer_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastScaleformCriticalTimer(int I)
{
	static UFieldFunc* pFnCastScaleformCriticalTimer = NULL;
	if(!pFnCastScaleformCriticalTimer)
		pFnCastScaleformCriticalTimer = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastScaleformCriticalTimer");

	APBUserInterface_CastScaleformCriticalTimer_Parms CastScaleformCriticalTimer_Parms;
	CastScaleformCriticalTimer_Parms.I = I;
	ProcessEvent(pFnCastScaleformCriticalTimer,NULL,&CastScaleformCriticalTimer_Parms,NULL);
	return CastScaleformCriticalTimer_Parms.ReturnValue;
}

struct APBUserInterface_CastGameFlowDialog_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastGameFlowDialog(int I)
{
	static UFieldFunc* pFnCastGameFlowDialog = NULL;
	if(!pFnCastGameFlowDialog)
		pFnCastGameFlowDialog = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastGameFlowDialog");

	APBUserInterface_CastGameFlowDialog_Parms CastGameFlowDialog_Parms;
	CastGameFlowDialog_Parms.I = I;
	ProcessEvent(pFnCastGameFlowDialog,NULL,&CastGameFlowDialog_Parms,NULL);
	return CastGameFlowDialog_Parms.ReturnValue;
}

struct APBUserInterface_CastChatCommandType_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastChatCommandType(int I)
{
	static UFieldFunc* pFnCastChatCommandType = NULL;
	if(!pFnCastChatCommandType)
		pFnCastChatCommandType = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastChatCommandType");

	APBUserInterface_CastChatCommandType_Parms CastChatCommandType_Parms;
	CastChatCommandType_Parms.I = I;
	ProcessEvent(pFnCastChatCommandType,NULL,&CastChatCommandType_Parms,NULL);
	return CastChatCommandType_Parms.ReturnValue;
}

struct APBUserInterface_CastPopupDialogArea_Parms
{
	int                                                I;                                                		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char UcSDDUI::CastPopupDialogArea(int I)
{
	static UFieldFunc* pFnCastPopupDialogArea = NULL;
	if(!pFnCastPopupDialogArea)
		pFnCastPopupDialogArea = UObject::FindFunction("Function APBUserInterface.cSDDUI.CastPopupDialogArea");

	APBUserInterface_CastPopupDialogArea_Parms CastPopupDialogArea_Parms;
	CastPopupDialogArea_Parms.I = I;
	ProcessEvent(pFnCastPopupDialogArea,NULL,&CastPopupDialogArea_Parms,NULL);
	return CastPopupDialogArea_Parms.ReturnValue;
}

struct APBUserInterface_CloseOptionScreen_Parms
{
	unsigned long                                      i_bForce : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
};

void UcSupportScreenManager::CloseOptionScreen(bool i_bForce)
{
	static UFieldFunc* pFnCloseOptionScreen = NULL;
	if(!pFnCloseOptionScreen)
		pFnCloseOptionScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.CloseOptionScreen");

	APBUserInterface_CloseOptionScreen_Parms CloseOptionScreen_Parms;
	CloseOptionScreen_Parms.i_bForce = i_bForce;
	pFnCloseOptionScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseOptionScreen,NULL,&CloseOptionScreen_Parms,NULL);
	pFnCloseOptionScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenOptionScreen_Parms
{
};

void UcSupportScreenManager::OpenOptionScreen()
{
	static UFieldFunc* pFnOpenOptionScreen = NULL;
	if(!pFnOpenOptionScreen)
		pFnOpenOptionScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OpenOptionScreen");

	APBUserInterface_OpenOptionScreen_Parms OpenOptionScreen_Parms;
	pFnOpenOptionScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenOptionScreen,NULL,&OpenOptionScreen_Parms,NULL);
	pFnOpenOptionScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnWebBrowserClosed_Parms
{
	class UcBrowserUIController*                       i_pBrowser;                                       		// 0x000000 (0x0004)              
};

void UcSupportScreenManager::OnWebBrowserClosed(class UcBrowserUIController* i_pBrowser)
{
	static UFieldFunc* pFnOnWebBrowserClosed = NULL;
	if(!pFnOnWebBrowserClosed)
		pFnOnWebBrowserClosed = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OnWebBrowserClosed");

	APBUserInterface_OnWebBrowserClosed_Parms OnWebBrowserClosed_Parms;
	OnWebBrowserClosed_Parms.i_pBrowser = i_pBrowser;
	pFnOnWebBrowserClosed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnWebBrowserClosed,NULL,&OnWebBrowserClosed_Parms,NULL);
	pFnOnWebBrowserClosed->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsTutorialScreenOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcSupportScreenManager::IsTutorialScreenOpen()
{
	static UFieldFunc* pFnIsTutorialScreenOpen = NULL;
	if(!pFnIsTutorialScreenOpen)
		pFnIsTutorialScreenOpen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.IsTutorialScreenOpen");

	APBUserInterface_IsTutorialScreenOpen_Parms IsTutorialScreenOpen_Parms;
	pFnIsTutorialScreenOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsTutorialScreenOpen,NULL,&IsTutorialScreenOpen_Parms,NULL);
	pFnIsTutorialScreenOpen->FunctionFlags |= 0x400;
	return IsTutorialScreenOpen_Parms.ReturnValue;
}

struct APBUserInterface_OnOptionsClosed_Parms
{
};

void UcSupportScreenManager::OnOptionsClosed()
{
	static UFieldFunc* pFnOnOptionsClosed = NULL;
	if(!pFnOnOptionsClosed)
		pFnOnOptionsClosed = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OnOptionsClosed");

	APBUserInterface_OnOptionsClosed_Parms OnOptionsClosed_Parms;
	ProcessEvent(pFnOnOptionsClosed,NULL,&OnOptionsClosed_Parms,NULL);
}

struct APBUserInterface_ToggleOptionScreen_Parms
{
};

void UcSupportScreenManager::ToggleOptionScreen()
{
	static UFieldFunc* pFnToggleOptionScreen = NULL;
	if(!pFnToggleOptionScreen)
		pFnToggleOptionScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.ToggleOptionScreen");

	APBUserInterface_ToggleOptionScreen_Parms ToggleOptionScreen_Parms;
	pFnToggleOptionScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleOptionScreen,NULL,&ToggleOptionScreen_Parms,NULL);
	pFnToggleOptionScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnCounterClosed_Parms
{
};

void UcSupportScreenManager::OnCounterClosed()
{
	static UFieldFunc* pFnOnCounterClosed = NULL;
	if(!pFnOnCounterClosed)
		pFnOnCounterClosed = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OnCounterClosed");

	APBUserInterface_OnCounterClosed_Parms OnCounterClosed_Parms;
	ProcessEvent(pFnOnCounterClosed,NULL,&OnCounterClosed_Parms,NULL);
}

struct APBUserInterface_WebBrowserClosedCallback_Parms
{
};

void UcSupportScreenManager::WebBrowserClosedCallback()
{
	static UFieldFunc* pFnWebBrowserClosedCallback = NULL;
	if(!pFnWebBrowserClosedCallback)
		pFnWebBrowserClosedCallback = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.WebBrowserClosedCallback");

	APBUserInterface_WebBrowserClosedCallback_Parms WebBrowserClosedCallback_Parms;
	ProcessEvent(pFnWebBrowserClosedCallback,NULL,&WebBrowserClosedCallback_Parms,NULL);
}

struct APBUserInterface_OpenSupportPage_Parms
{
	struct FName                                       SupportPage;                                      		// 0x000000 (0x0008)              
	TArray<struct FString>                             Parameters;                                       		// 0x000008 (0x000C)              
	unsigned long                                      bInternal : 1;                                    		// 0x000014 (0x0004) [0x00000001] 
};

void UcSupportScreenManager::OpenSupportPage(struct FName SupportPage,TArray<struct FString> Parameters,bool bInternal)
{
	static UFieldFunc* pFnOpenSupportPage = NULL;
	if(!pFnOpenSupportPage)
		pFnOpenSupportPage = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OpenSupportPage");

	APBUserInterface_OpenSupportPage_Parms OpenSupportPage_Parms;
	memcpy(&OpenSupportPage_Parms.SupportPage,&SupportPage,0x8);
	memcpy(&OpenSupportPage_Parms.Parameters,&Parameters,0xC);
	OpenSupportPage_Parms.bInternal = bInternal;
	pFnOpenSupportPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenSupportPage,NULL,&OpenSupportPage_Parms,NULL);
	pFnOpenSupportPage->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsOptionsScreenOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcSupportScreenManager::IsOptionsScreenOpen()
{
	static UFieldFunc* pFnIsOptionsScreenOpen = NULL;
	if(!pFnIsOptionsScreenOpen)
		pFnIsOptionsScreenOpen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.IsOptionsScreenOpen");

	APBUserInterface_IsOptionsScreenOpen_Parms IsOptionsScreenOpen_Parms;
	pFnIsOptionsScreenOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsOptionsScreenOpen,NULL,&IsOptionsScreenOpen_Parms,NULL);
	pFnIsOptionsScreenOpen->FunctionFlags |= 0x400;
	return IsOptionsScreenOpen_Parms.ReturnValue;
}

struct APBUserInterface_OpenTutorialScreen_Parms
{
};

void UcSupportScreenManager::OpenTutorialScreen()
{
	static UFieldFunc* pFnOpenTutorialScreen = NULL;
	if(!pFnOpenTutorialScreen)
		pFnOpenTutorialScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OpenTutorialScreen");

	APBUserInterface_OpenTutorialScreen_Parms OpenTutorialScreen_Parms;
	pFnOpenTutorialScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenTutorialScreen,NULL,&OpenTutorialScreen_Parms,NULL);
	pFnOpenTutorialScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_CloseTutorialScreen_Parms
{
};

void UcSupportScreenManager::CloseTutorialScreen()
{
	static UFieldFunc* pFnCloseTutorialScreen = NULL;
	if(!pFnCloseTutorialScreen)
		pFnCloseTutorialScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.CloseTutorialScreen");

	APBUserInterface_CloseTutorialScreen_Parms CloseTutorialScreen_Parms;
	pFnCloseTutorialScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseTutorialScreen,NULL,&CloseTutorialScreen_Parms,NULL);
	pFnCloseTutorialScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_ToggleTutorialScreen_Parms
{
};

void UcSupportScreenManager::ToggleTutorialScreen()
{
	static UFieldFunc* pFnToggleTutorialScreen = NULL;
	if(!pFnToggleTutorialScreen)
		pFnToggleTutorialScreen = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.ToggleTutorialScreen");

	APBUserInterface_ToggleTutorialScreen_Parms ToggleTutorialScreen_Parms;
	pFnToggleTutorialScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleTutorialScreen,NULL,&ToggleTutorialScreen_Parms,NULL);
	pFnToggleTutorialScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetInstance_Parms
{
	class UcSupportScreenManager*                      ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UcSupportScreenManager* UcSupportScreenManager::GetInstance()
{
	static UFieldFunc* pFnGetInstance = NULL;
	if(!pFnGetInstance)
		pFnGetInstance = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.GetInstance");

	APBUserInterface_GetInstance_Parms GetInstance_Parms;
	pFnGetInstance->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetInstance,NULL,&GetInstance_Parms,NULL);
	pFnGetInstance->FunctionFlags |= 0x400;
	return GetInstance_Parms.ReturnValue;
}

struct APBUserInterface_OnCriticalTimerClosed_Parms
{
};

void UcSupportScreenManager::OnCriticalTimerClosed()
{
	static UFieldFunc* pFnOnCriticalTimerClosed = NULL;
	if(!pFnOnCriticalTimerClosed)
		pFnOnCriticalTimerClosed = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OnCriticalTimerClosed");

	APBUserInterface_OnCriticalTimerClosed_Parms OnCriticalTimerClosed_Parms;
	ProcessEvent(pFnOnCriticalTimerClosed,NULL,&OnCriticalTimerClosed_Parms,NULL);
}

struct APBUserInterface_OpenWebBrowser_Parms
{
	struct FString                                     URL;                                              		// 0x000000 (0x000C)              
	struct FString                                     sBrowserTitle;                                    		// 0x00000C (0x000C)              
	unsigned long                                      bInternal : 1;                                    		// 0x000018 (0x0004) [0x00000001] 
	struct FScriptDelegate                             BrowserClosedCallback;                            		// 0x00001C (0x000C)              
	struct FString                                     sCallbackURL;                                     		// 0x000028 (0x000C)              
};

void UcSupportScreenManager::OpenWebBrowser(struct FString URL,struct FString sBrowserTitle,bool bInternal,struct FScriptDelegate BrowserClosedCallback,struct FString sCallbackURL)
{
	static UFieldFunc* pFnOpenWebBrowser = NULL;
	if(!pFnOpenWebBrowser)
		pFnOpenWebBrowser = UObject::FindFunction("Function APBUserInterface.cSupportScreenManager.OpenWebBrowser");

	APBUserInterface_OpenWebBrowser_Parms OpenWebBrowser_Parms;
	memcpy(&OpenWebBrowser_Parms.URL,&URL,0xC);
	memcpy(&OpenWebBrowser_Parms.sBrowserTitle,&sBrowserTitle,0xC);
	OpenWebBrowser_Parms.bInternal = bInternal;
	memcpy(&OpenWebBrowser_Parms.BrowserClosedCallback,&BrowserClosedCallback,0xC);
	memcpy(&OpenWebBrowser_Parms.sCallbackURL,&sCallbackURL,0xC);
	pFnOpenWebBrowser->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenWebBrowser,NULL,&OpenWebBrowser_Parms,NULL);
	pFnOpenWebBrowser->FunctionFlags |= 0x400;
}

struct APBUserInterface_InviteAccepted_Parms
{
	unsigned char                                      Answer;                                           		// 0x000000 (0x0001)              
};

void UcUI_Soc_GroupAccept::InviteAccepted(unsigned char Answer)
{
	static UFieldFunc* pFnInviteAccepted = NULL;
	if(!pFnInviteAccepted)
		pFnInviteAccepted = UObject::FindFunction("Function APBUserInterface.cUI_Soc_GroupAccept.InviteAccepted");

	APBUserInterface_InviteAccepted_Parms InviteAccepted_Parms;
	InviteAccepted_Parms.Answer = Answer;
	pFnInviteAccepted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInviteAccepted,NULL,&InviteAccepted_Parms,NULL);
	pFnInviteAccepted->FunctionFlags |= 0x400;
}

struct APBUserInterface_InviteReceived_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x000000 (0x000C)              
};

void UcUI_Soc_GroupAccept::InviteReceived(struct FString sPlayerName)
{
	static UFieldFunc* pFnInviteReceived = NULL;
	if(!pFnInviteReceived)
		pFnInviteReceived = UObject::FindFunction("Function APBUserInterface.cUI_Soc_GroupAccept.InviteReceived");

	APBUserInterface_InviteReceived_Parms InviteReceived_Parms;
	memcpy(&InviteReceived_Parms.sPlayerName,&sPlayerName,0xC);
	pFnInviteReceived->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInviteReceived,NULL,&InviteReceived_Parms,NULL);
	pFnInviteReceived->FunctionFlags |= 0x400;
}

struct APBUserInterface_InviteReceived_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x000000 (0x000C)              
	struct FString                                     sTeamName;                                        		// 0x00000C (0x000C)              
};

void UcUI_TM_TeamInviteAccept::InviteReceived(struct FString sPlayerName,struct FString sTeamName)
{
	static UFieldFunc* pFnInviteReceived = NULL;
	if(!pFnInviteReceived)
		pFnInviteReceived = UObject::FindFunction("Function APBUserInterface.cUI_TM_TeamInviteAccept.InviteReceived");

	APBUserInterface_InviteReceived_Parms InviteReceived_Parms;
	memcpy(&InviteReceived_Parms.sPlayerName,&sPlayerName,0xC);
	memcpy(&InviteReceived_Parms.sTeamName,&sTeamName,0xC);
	pFnInviteReceived->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInviteReceived,NULL,&InviteReceived_Parms,NULL);
	pFnInviteReceived->FunctionFlags |= 0x400;
}

struct APBUserInterface_InviteAccepted_Parms
{
	unsigned char                                      Answer;                                           		// 0x000000 (0x0001)              
};

void UcUI_TM_TeamInviteAccept::InviteAccepted(unsigned char Answer)
{
	static UFieldFunc* pFnInviteAccepted = NULL;
	if(!pFnInviteAccepted)
		pFnInviteAccepted = UObject::FindFunction("Function APBUserInterface.cUI_TM_TeamInviteAccept.InviteAccepted");

	APBUserInterface_InviteAccepted_Parms InviteAccepted_Parms;
	InviteAccepted_Parms.Answer = Answer;
	pFnInviteAccepted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInviteAccepted,NULL,&InviteAccepted_Parms,NULL);
	pFnInviteAccepted->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsValidLevelSequenceObject_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIAction_CompString::IsValidLevelSequenceObject()
{
	static UFieldFunc* pFnIsValidLevelSequenceObject = NULL;
	if(!pFnIsValidLevelSequenceObject)
		pFnIsValidLevelSequenceObject = UObject::FindFunction("Function APBUserInterface.cUIAction_CompString.IsValidLevelSequenceObject");

	APBUserInterface_IsValidLevelSequenceObject_Parms IsValidLevelSequenceObject_Parms;
	ProcessEvent(pFnIsValidLevelSequenceObject,NULL,&IsValidLevelSequenceObject_Parms,NULL);
	return IsValidLevelSequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_HasDynamicOutputLinks_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIAction_CompString::HasDynamicOutputLinks()
{
	static UFieldFunc* pFnHasDynamicOutputLinks = NULL;
	if(!pFnHasDynamicOutputLinks)
		pFnHasDynamicOutputLinks = UObject::FindFunction("Function APBUserInterface.cUIAction_CompString.HasDynamicOutputLinks");

	APBUserInterface_HasDynamicOutputLinks_Parms HasDynamicOutputLinks_Parms;
	ProcessEvent(pFnHasDynamicOutputLinks,NULL,&HasDynamicOutputLinks_Parms,NULL);
	return HasDynamicOutputLinks_Parms.ReturnValue;
}

struct APBUserInterface_OnBoxClosed_Parms
{
	unsigned long                                      bInAcceptOk : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIAction_DisplayTextEntry::OnBoxClosed(bool bInAcceptOk)
{
	static UFieldFunc* pFnOnBoxClosed = NULL;
	if(!pFnOnBoxClosed)
		pFnOnBoxClosed = UObject::FindFunction("Function APBUserInterface.cUIAction_DisplayTextEntry.OnBoxClosed");

	APBUserInterface_OnBoxClosed_Parms OnBoxClosed_Parms;
	OnBoxClosed_Parms.bInAcceptOk = bInAcceptOk;
	ProcessEvent(pFnOnBoxClosed,NULL,&OnBoxClosed_Parms,NULL);
}

struct APBUserInterface_SetupScene_Parms
{
	class UcUIScene_TextEntry*                         Scene;                                            		// 0x000000 (0x0004)              
};

void UcUIAction_DisplayTextEntry::SetupScene(class UcUIScene_TextEntry* Scene)
{
	static UFieldFunc* pFnSetupScene = NULL;
	if(!pFnSetupScene)
		pFnSetupScene = UObject::FindFunction("Function APBUserInterface.cUIAction_DisplayTextEntry.SetupScene");

	APBUserInterface_SetupScene_Parms SetupScene_Parms;
	SetupScene_Parms.Scene = Scene;
	ProcessEvent(pFnSetupScene,NULL,&SetupScene_Parms,NULL);
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIAction_ForceGC::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIAction_ForceGC.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_InputKey_Parms
{
	int                                                ControllerId;                                     		// 0x000000 (0x0004)              
	struct FName                                       Key;                                              		// 0x000004 (0x0008)              
	unsigned char                                      EventType;                                        		// 0x00000C (0x0001)              
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) ALIGNEMENT
	float                                              AmountDepressed;                                  		// 0x000010 (0x0004)              
	unsigned long                                      bGamepad : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool UcUIAction_FullScreenMoviePlayer::InputKey(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad)
{
	static UFieldFunc* pFnInputKey = NULL;
	if(!pFnInputKey)
		pFnInputKey = UObject::FindFunction("Function APBUserInterface.cUIAction_FullScreenMoviePlayer.InputKey");

	APBUserInterface_InputKey_Parms InputKey_Parms;
	InputKey_Parms.ControllerId = ControllerId;
	memcpy(&InputKey_Parms.Key,&Key,0x8);
	InputKey_Parms.EventType = EventType;
	InputKey_Parms.AmountDepressed = AmountDepressed;
	InputKey_Parms.bGamepad = bGamepad;
	pFnInputKey->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInputKey,NULL,&InputKey_Parms,NULL);
	pFnInputKey->FunctionFlags |= 0x400;
	return InputKey_Parms.ReturnValue;
}

struct APBUserInterface_InputKey_Global_Parms
{
	int                                                ControllerId;                                     		// 0x000000 (0x0004)              
	struct FName                                       Key;                                              		// 0x000004 (0x0008)              
	unsigned char                                      EventType;                                        		// 0x00000C (0x0001)              
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) ALIGNEMENT
	float                                              AmountDepressed;                                  		// 0x000010 (0x0004)              
	unsigned long                                      bGamepad : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool UcUIAction_GetKeyPress::InputKey_Global(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad)
{
	static UFieldFunc* pFnInputKey_Global = NULL;
	if(!pFnInputKey_Global)
		pFnInputKey_Global = UObject::FindFunction("Function APBUserInterface.cUIAction_GetKeyPress.InputKey_Global");

	APBUserInterface_InputKey_Global_Parms InputKey_Global_Parms;
	InputKey_Global_Parms.ControllerId = ControllerId;
	memcpy(&InputKey_Global_Parms.Key,&Key,0x8);
	InputKey_Global_Parms.EventType = EventType;
	InputKey_Global_Parms.AmountDepressed = AmountDepressed;
	InputKey_Global_Parms.bGamepad = bGamepad;
	pFnInputKey_Global->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInputKey_Global,NULL,&InputKey_Global_Parms,NULL);
	pFnInputKey_Global->FunctionFlags |= 0x400;
	return InputKey_Global_Parms.ReturnValue;
}

struct APBUserInterface_OldInputKeyDelegate_Global_Parms
{
	int                                                ControllerId;                                     		// 0x000000 (0x0004)              
	struct FName                                       Key;                                              		// 0x000004 (0x0008)              
	unsigned char                                      EventType;                                        		// 0x00000C (0x0001)              
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) ALIGNEMENT
	float                                              AmountDepressed;                                  		// 0x000010 (0x0004)              
	unsigned long                                      bGamepad : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool UcUIAction_GetKeyPress::OldInputKeyDelegate_Global(int ControllerId,struct FName Key,unsigned char EventType,float AmountDepressed,bool bGamepad)
{
	static UFieldFunc* pFnOldInputKeyDelegate_Global = NULL;
	if(!pFnOldInputKeyDelegate_Global)
		pFnOldInputKeyDelegate_Global = UObject::FindFunction("Function APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_Global");

	APBUserInterface_OldInputKeyDelegate_Global_Parms OldInputKeyDelegate_Global_Parms;
	OldInputKeyDelegate_Global_Parms.ControllerId = ControllerId;
	memcpy(&OldInputKeyDelegate_Global_Parms.Key,&Key,0x8);
	OldInputKeyDelegate_Global_Parms.EventType = EventType;
	OldInputKeyDelegate_Global_Parms.AmountDepressed = AmountDepressed;
	OldInputKeyDelegate_Global_Parms.bGamepad = bGamepad;
	ProcessEvent(pFnOldInputKeyDelegate_Global,NULL,&OldInputKeyDelegate_Global_Parms,NULL);
	return OldInputKeyDelegate_Global_Parms.ReturnValue;
}

struct APBUserInterface_InputKey_UIWidget_Parms
{
	struct FInputEventParameters                       EventParms;                                       		// 0x000000 (0x0020)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

bool UcUIAction_GetKeyPress::InputKey_UIWidget(struct FInputEventParameters* EventParms)
{
	static UFieldFunc* pFnInputKey_UIWidget = NULL;
	if(!pFnInputKey_UIWidget)
		pFnInputKey_UIWidget = UObject::FindFunction("Function APBUserInterface.cUIAction_GetKeyPress.InputKey_UIWidget");

	APBUserInterface_InputKey_UIWidget_Parms InputKey_UIWidget_Parms;
	pFnInputKey_UIWidget->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInputKey_UIWidget,NULL,&InputKey_UIWidget_Parms,NULL);
	pFnInputKey_UIWidget->FunctionFlags |= 0x400;
	if(EventParms)
		memcpy(EventParms,&InputKey_UIWidget_Parms.EventParms,0x20);
	return InputKey_UIWidget_Parms.ReturnValue;
}

struct APBUserInterface_OldInputKeyDelegate_UIWidget_Parms
{
	struct FInputEventParameters                       EventParms;                                       		// 0x000000 (0x0020)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

bool UcUIAction_GetKeyPress::OldInputKeyDelegate_UIWidget(struct FInputEventParameters* EventParms)
{
	static UFieldFunc* pFnOldInputKeyDelegate_UIWidget = NULL;
	if(!pFnOldInputKeyDelegate_UIWidget)
		pFnOldInputKeyDelegate_UIWidget = UObject::FindFunction("Function APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_UIWidget");

	APBUserInterface_OldInputKeyDelegate_UIWidget_Parms OldInputKeyDelegate_UIWidget_Parms;
	ProcessEvent(pFnOldInputKeyDelegate_UIWidget,NULL,&OldInputKeyDelegate_UIWidget_Parms,NULL);
	if(EventParms)
		memcpy(EventParms,&OldInputKeyDelegate_UIWidget_Parms.EventParms,0x20);
	return OldInputKeyDelegate_UIWidget_Parms.ReturnValue;
}

struct APBUserInterface_GetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIAction_HasTutorialBeenPlayed::GetObjClassVersion()
{
	static UFieldFunc* pFnGetObjClassVersion = NULL;
	if(!pFnGetObjClassVersion)
		pFnGetObjClassVersion = UObject::FindFunction("Function APBUserInterface.cUIAction_HasTutorialBeenPlayed.GetObjClassVersion");

	APBUserInterface_GetObjClassVersion_Parms GetObjClassVersion_Parms;
	ProcessEvent(pFnGetObjClassVersion,NULL,&GetObjClassVersion_Parms,NULL);
	return GetObjClassVersion_Parms.ReturnValue;
}

struct APBUserInterface_OnCharacterInfoSuccess_Parms
{
};

void UcUIAction_CharacterInfo::OnCharacterInfoSuccess()
{
	static UFieldFunc* pFnOnCharacterInfoSuccess = NULL;
	if(!pFnOnCharacterInfoSuccess)
		pFnOnCharacterInfoSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoSuccess");

	APBUserInterface_OnCharacterInfoSuccess_Parms OnCharacterInfoSuccess_Parms;
	pFnOnCharacterInfoSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnCharacterInfoSuccess,NULL,&OnCharacterInfoSuccess_Parms,NULL);
	pFnOnCharacterInfoSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnCharacterInfoFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_CharacterInfo::OnCharacterInfoFailed(int nError)
{
	static UFieldFunc* pFnOnCharacterInfoFailed = NULL;
	if(!pFnOnCharacterInfoFailed)
		pFnOnCharacterInfoFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoFailed");

	APBUserInterface_OnCharacterInfoFailed_Parms OnCharacterInfoFailed_Parms;
	OnCharacterInfoFailed_Parms.nError = nError;
	pFnOnCharacterInfoFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnCharacterInfoFailed,NULL,&OnCharacterInfoFailed_Parms,NULL);
	pFnOnCharacterInfoFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnNameCheckFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_CharacterNameCheck::OnNameCheckFailed(int nError)
{
	static UFieldFunc* pFnOnNameCheckFailed = NULL;
	if(!pFnOnNameCheckFailed)
		pFnOnNameCheckFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckFailed");

	APBUserInterface_OnNameCheckFailed_Parms OnNameCheckFailed_Parms;
	OnNameCheckFailed_Parms.nError = nError;
	pFnOnNameCheckFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnNameCheckFailed,NULL,&OnNameCheckFailed_Parms,NULL);
	pFnOnNameCheckFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnNameCheckSuccess_Parms
{
};

void UcUIAction_CharacterNameCheck::OnNameCheckSuccess()
{
	static UFieldFunc* pFnOnNameCheckSuccess = NULL;
	if(!pFnOnNameCheckSuccess)
		pFnOnNameCheckSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckSuccess");

	APBUserInterface_OnNameCheckSuccess_Parms OnNameCheckSuccess_Parms;
	pFnOnNameCheckSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnNameCheckSuccess,NULL,&OnNameCheckSuccess_Parms,NULL);
	pFnOnNameCheckSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDistrictReserveFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
	int                                                nDistrictUID;                                     		// 0x000004 (0x0004)              
	int                                                nInstanceNo;                                      		// 0x000008 (0x0004)              
	unsigned long                                      bGroup : 1;                                       		// 0x00000C (0x0004) [0x00000001] 
};

void UcUIAction_DistrictEnter::OnDistrictReserveFailed(int nError,int nDistrictUID,int nInstanceNo,bool bGroup)
{
	static UFieldFunc* pFnOnDistrictReserveFailed = NULL;
	if(!pFnOnDistrictReserveFailed)
		pFnOnDistrictReserveFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveFailed");

	APBUserInterface_OnDistrictReserveFailed_Parms OnDistrictReserveFailed_Parms;
	OnDistrictReserveFailed_Parms.nError = nError;
	OnDistrictReserveFailed_Parms.nDistrictUID = nDistrictUID;
	OnDistrictReserveFailed_Parms.nInstanceNo = nInstanceNo;
	OnDistrictReserveFailed_Parms.bGroup = bGroup;
	pFnOnDistrictReserveFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDistrictReserveFailed,NULL,&OnDistrictReserveFailed_Parms,NULL);
	pFnOnDistrictReserveFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_DistrictReserve_Parms
{
};

void UcUIAction_DistrictEnter::DistrictReserve()
{
	static UFieldFunc* pFnDistrictReserve = NULL;
	if(!pFnDistrictReserve)
		pFnDistrictReserve = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.DistrictReserve");

	APBUserInterface_DistrictReserve_Parms DistrictReserve_Parms;
	pFnDistrictReserve->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDistrictReserve,NULL,&DistrictReserve_Parms,NULL);
	pFnDistrictReserve->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDistrictEnterSuccess_Parms
{
};

void UcUIAction_DistrictEnter::OnDistrictEnterSuccess()
{
	static UFieldFunc* pFnOnDistrictEnterSuccess = NULL;
	if(!pFnOnDistrictEnterSuccess)
		pFnOnDistrictEnterSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterSuccess");

	APBUserInterface_OnDistrictEnterSuccess_Parms OnDistrictEnterSuccess_Parms;
	pFnOnDistrictEnterSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDistrictEnterSuccess,NULL,&OnDistrictEnterSuccess_Parms,NULL);
	pFnOnDistrictEnterSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_CharacterGetInfoSuccess_Parms
{
	int                                                nCharacterUID;                                    		// 0x000000 (0x0004)              
	int                                                nDistrictUID;                                     		// 0x000004 (0x0004)              
	int                                                nInstanceNo;                                      		// 0x000008 (0x0004)              
	unsigned char                                      eFaction;                                         		// 0x00000C (0x0001)              
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) ALIGNEMENT
	struct FString                                     sCharacterName;                                   		// 0x000010 (0x000C)              
	int                                                nInstanceThreat;                                  		// 0x00001C (0x0004)              
};

void UcUIAction_DistrictEnter::CharacterGetInfoSuccess(int nCharacterUID,int nDistrictUID,int nInstanceNo,unsigned char eFaction,struct FString sCharacterName,int nInstanceThreat)
{
	static UFieldFunc* pFnCharacterGetInfoSuccess = NULL;
	if(!pFnCharacterGetInfoSuccess)
		pFnCharacterGetInfoSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoSuccess");

	APBUserInterface_CharacterGetInfoSuccess_Parms CharacterGetInfoSuccess_Parms;
	CharacterGetInfoSuccess_Parms.nCharacterUID = nCharacterUID;
	CharacterGetInfoSuccess_Parms.nDistrictUID = nDistrictUID;
	CharacterGetInfoSuccess_Parms.nInstanceNo = nInstanceNo;
	CharacterGetInfoSuccess_Parms.eFaction = eFaction;
	memcpy(&CharacterGetInfoSuccess_Parms.sCharacterName,&sCharacterName,0xC);
	CharacterGetInfoSuccess_Parms.nInstanceThreat = nInstanceThreat;
	pFnCharacterGetInfoSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCharacterGetInfoSuccess,NULL,&CharacterGetInfoSuccess_Parms,NULL);
	pFnCharacterGetInfoSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_ShowLoadingScreen_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIAction_DistrictEnter::ShowLoadingScreen(bool bShow)
{
	static UFieldFunc* pFnShowLoadingScreen = NULL;
	if(!pFnShowLoadingScreen)
		pFnShowLoadingScreen = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.ShowLoadingScreen");

	APBUserInterface_ShowLoadingScreen_Parms ShowLoadingScreen_Parms;
	ShowLoadingScreen_Parms.bShow = bShow;
	pFnShowLoadingScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnShowLoadingScreen,NULL,&ShowLoadingScreen_Parms,NULL);
	pFnShowLoadingScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDistrictEnterFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_DistrictEnter::OnDistrictEnterFailed(int nError)
{
	static UFieldFunc* pFnOnDistrictEnterFailed = NULL;
	if(!pFnOnDistrictEnterFailed)
		pFnOnDistrictEnterFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterFailed");

	APBUserInterface_OnDistrictEnterFailed_Parms OnDistrictEnterFailed_Parms;
	OnDistrictEnterFailed_Parms.nError = nError;
	pFnOnDistrictEnterFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDistrictEnterFailed,NULL,&OnDistrictEnterFailed_Parms,NULL);
	pFnOnDistrictEnterFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_JoinPlayer_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x000000 (0x000C)              
};

void UcUIAction_DistrictEnter::JoinPlayer(struct FString sPlayerName)
{
	static UFieldFunc* pFnJoinPlayer = NULL;
	if(!pFnJoinPlayer)
		pFnJoinPlayer = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.JoinPlayer");

	APBUserInterface_JoinPlayer_Parms JoinPlayer_Parms;
	memcpy(&JoinPlayer_Parms.sPlayerName,&sPlayerName,0xC);
	pFnJoinPlayer->FunctionFlags |= ~0x400;
	ProcessEvent(pFnJoinPlayer,NULL,&JoinPlayer_Parms,NULL);
	pFnJoinPlayer->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDistrictReserveSuccess_Parms
{
};

void UcUIAction_DistrictEnter::OnDistrictReserveSuccess()
{
	static UFieldFunc* pFnOnDistrictReserveSuccess = NULL;
	if(!pFnOnDistrictReserveSuccess)
		pFnOnDistrictReserveSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveSuccess");

	APBUserInterface_OnDistrictReserveSuccess_Parms OnDistrictReserveSuccess_Parms;
	pFnOnDistrictReserveSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDistrictReserveSuccess,NULL,&OnDistrictReserveSuccess_Parms,NULL);
	pFnOnDistrictReserveSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_CharacterGetInfoFailure_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
	struct FString                                     sCharacterName;                                   		// 0x000004 (0x000C)              
};

void UcUIAction_DistrictEnter::CharacterGetInfoFailure(int nError,struct FString sCharacterName)
{
	static UFieldFunc* pFnCharacterGetInfoFailure = NULL;
	if(!pFnCharacterGetInfoFailure)
		pFnCharacterGetInfoFailure = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoFailure");

	APBUserInterface_CharacterGetInfoFailure_Parms CharacterGetInfoFailure_Parms;
	CharacterGetInfoFailure_Parms.nError = nError;
	memcpy(&CharacterGetInfoFailure_Parms.sCharacterName,&sCharacterName,0xC);
	pFnCharacterGetInfoFailure->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCharacterGetInfoFailure,NULL,&CharacterGetInfoFailure_Parms,NULL);
	pFnCharacterGetInfoFailure->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnWorldServerDisconnect_Parms
{
};

void UcUIAction_DistrictEnter::OnWorldServerDisconnect()
{
	static UFieldFunc* pFnOnWorldServerDisconnect = NULL;
	if(!pFnOnWorldServerDisconnect)
		pFnOnWorldServerDisconnect = UObject::FindFunction("Function APBUserInterface.cUIAction_DistrictEnter.OnWorldServerDisconnect");

	APBUserInterface_OnWorldServerDisconnect_Parms OnWorldServerDisconnect_Parms;
	pFnOnWorldServerDisconnect->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnWorldServerDisconnect,NULL,&OnWorldServerDisconnect_Parms,NULL);
	pFnOnWorldServerDisconnect->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnPlayerSpawnTimerExpired_Parms
{
};

void UcUIAction_DM_HandleInput::OnPlayerSpawnTimerExpired()
{
	static UFieldFunc* pFnOnPlayerSpawnTimerExpired = NULL;
	if(!pFnOnPlayerSpawnTimerExpired)
		pFnOnPlayerSpawnTimerExpired = UObject::FindFunction("Function APBUserInterface.cUIAction_DM_HandleInput.OnPlayerSpawnTimerExpired");

	APBUserInterface_OnPlayerSpawnTimerExpired_Parms OnPlayerSpawnTimerExpired_Parms;
	pFnOnPlayerSpawnTimerExpired->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnPlayerSpawnTimerExpired,NULL,&OnPlayerSpawnTimerExpired_Parms,NULL);
	pFnOnPlayerSpawnTimerExpired->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnGetInstanceListSuccess_Parms
{
};

void UcUIAction_GetInstanceList::OnGetInstanceListSuccess()
{
	static UFieldFunc* pFnOnGetInstanceListSuccess = NULL;
	if(!pFnOnGetInstanceListSuccess)
		pFnOnGetInstanceListSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListSuccess");

	APBUserInterface_OnGetInstanceListSuccess_Parms OnGetInstanceListSuccess_Parms;
	pFnOnGetInstanceListSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnGetInstanceListSuccess,NULL,&OnGetInstanceListSuccess_Parms,NULL);
	pFnOnGetInstanceListSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnGetInstanceListFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_GetInstanceList::OnGetInstanceListFailed(int nError)
{
	static UFieldFunc* pFnOnGetInstanceListFailed = NULL;
	if(!pFnOnGetInstanceListFailed)
		pFnOnGetInstanceListFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListFailed");

	APBUserInterface_OnGetInstanceListFailed_Parms OnGetInstanceListFailed_Parms;
	OnGetInstanceListFailed_Parms.nError = nError;
	pFnOnGetInstanceListFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnGetInstanceListFailed,NULL,&OnGetInstanceListFailed_Parms,NULL);
	pFnOnGetInstanceListFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnFastLoginFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
	struct FString                                     sCountryCode;                                     		// 0x000004 (0x000C)              
};

void UcUIAction_LaunchGameFlowScene::OnFastLoginFailed(int nError,struct FString sCountryCode)
{
	static UFieldFunc* pFnOnFastLoginFailed = NULL;
	if(!pFnOnFastLoginFailed)
		pFnOnFastLoginFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginFailed");

	APBUserInterface_OnFastLoginFailed_Parms OnFastLoginFailed_Parms;
	OnFastLoginFailed_Parms.nError = nError;
	memcpy(&OnFastLoginFailed_Parms.sCountryCode,&sCountryCode,0xC);
	pFnOnFastLoginFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnFastLoginFailed,NULL,&OnFastLoginFailed_Parms,NULL);
	pFnOnFastLoginFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_ClientInvokeCityMap_Parms
{
};

void UcUIAction_LaunchGameFlowScene::ClientInvokeCityMap()
{
	static UFieldFunc* pFnClientInvokeCityMap = NULL;
	if(!pFnClientInvokeCityMap)
		pFnClientInvokeCityMap = UObject::FindFunction("Function APBUserInterface.cUIAction_LaunchGameFlowScene.ClientInvokeCityMap");

	APBUserInterface_ClientInvokeCityMap_Parms ClientInvokeCityMap_Parms;
	pFnClientInvokeCityMap->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClientInvokeCityMap,NULL,&ClientInvokeCityMap_Parms,NULL);
	pFnClientInvokeCityMap->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnFastLoginSuccess_Parms
{
};

void UcUIAction_LaunchGameFlowScene::OnFastLoginSuccess()
{
	static UFieldFunc* pFnOnFastLoginSuccess = NULL;
	if(!pFnOnFastLoginSuccess)
		pFnOnFastLoginSuccess = UObject::FindFunction("Function APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginSuccess");

	APBUserInterface_OnFastLoginSuccess_Parms OnFastLoginSuccess_Parms;
	pFnOnFastLoginSuccess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnFastLoginSuccess,NULL,&OnFastLoginSuccess_Parms,NULL);
	pFnOnFastLoginSuccess->FunctionFlags |= 0x400;
}

struct APBUserInterface_ClientNotReturningToLobby_Parms
{
};

void UcUIAction_LaunchGameFlowScene::ClientNotReturningToLobby()
{
	static UFieldFunc* pFnClientNotReturningToLobby = NULL;
	if(!pFnClientNotReturningToLobby)
		pFnClientNotReturningToLobby = UObject::FindFunction("Function APBUserInterface.cUIAction_LaunchGameFlowScene.ClientNotReturningToLobby");

	APBUserInterface_ClientNotReturningToLobby_Parms ClientNotReturningToLobby_Parms;
	pFnClientNotReturningToLobby->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClientNotReturningToLobby,NULL,&ClientNotReturningToLobby_Parms,NULL);
	pFnClientNotReturningToLobby->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDisconnected_Parms
{
};

void UcUIAction_Logout::OnDisconnected()
{
	static UFieldFunc* pFnOnDisconnected = NULL;
	if(!pFnOnDisconnected)
		pFnOnDisconnected = UObject::FindFunction("Function APBUserInterface.cUIAction_Logout.OnDisconnected");

	APBUserInterface_OnDisconnected_Parms OnDisconnected_Parms;
	pFnOnDisconnected->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDisconnected,NULL,&OnDisconnected_Parms,NULL);
	pFnOnDisconnected->FunctionFlags |= 0x400;
}

struct APBUserInterface_SelectionDone_Parms
{
};

void UcUIAction_OpenFileSelector::SelectionDone()
{
	static UFieldFunc* pFnSelectionDone = NULL;
	if(!pFnSelectionDone)
		pFnSelectionDone = UObject::FindFunction("Function APBUserInterface.cUIAction_OpenFileSelector.SelectionDone");

	APBUserInterface_SelectionDone_Parms SelectionDone_Parms;
	pFnSelectionDone->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSelectionDone,NULL,&SelectionDone_Parms,NULL);
	pFnSelectionDone->FunctionFlags |= 0x400;
}

struct APBUserInterface_SelectionCanceled_Parms
{
};

void UcUIAction_OpenFileSelector::SelectionCanceled()
{
	static UFieldFunc* pFnSelectionCanceled = NULL;
	if(!pFnSelectionCanceled)
		pFnSelectionCanceled = UObject::FindFunction("Function APBUserInterface.cUIAction_OpenFileSelector.SelectionCanceled");

	APBUserInterface_SelectionCanceled_Parms SelectionCanceled_Parms;
	pFnSelectionCanceled->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSelectionCanceled,NULL,&SelectionCanceled_Parms,NULL);
	pFnSelectionCanceled->FunctionFlags |= 0x400;
}

struct APBUserInterface_SelectionMade_Parms
{
	struct FString                                     sSelectedPath;                                    		// 0x000000 (0x000C)              
};

void UcUIAction_OpenFileSelector::SelectionMade(struct FString sSelectedPath)
{
	static UFieldFunc* pFnSelectionMade = NULL;
	if(!pFnSelectionMade)
		pFnSelectionMade = UObject::FindFunction("Function APBUserInterface.cUIAction_OpenFileSelector.SelectionMade");

	APBUserInterface_SelectionMade_Parms SelectionMade_Parms;
	memcpy(&SelectionMade_Parms.sSelectedPath,&sSelectedPath,0xC);
	pFnSelectionMade->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSelectionMade,NULL,&SelectionMade_Parms,NULL);
	pFnSelectionMade->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnAddCompleted_Parms
{
	int                                                Error;                                            		// 0x000000 (0x0004)              
};

void UcUIAction_Soc_AddFriend::OnAddCompleted(int Error)
{
	static UFieldFunc* pFnOnAddCompleted = NULL;
	if(!pFnOnAddCompleted)
		pFnOnAddCompleted = UObject::FindFunction("Function APBUserInterface.cUIAction_Soc_AddFriend.OnAddCompleted");

	APBUserInterface_OnAddCompleted_Parms OnAddCompleted_Parms;
	OnAddCompleted_Parms.Error = Error;
	pFnOnAddCompleted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnAddCompleted,NULL,&OnAddCompleted_Parms,NULL);
	pFnOnAddCompleted->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnAddCompleted_Parms
{
	int                                                Error;                                            		// 0x000000 (0x0004)              
};

void UcUIAction_Soc_AddIgnore::OnAddCompleted(int Error)
{
	static UFieldFunc* pFnOnAddCompleted = NULL;
	if(!pFnOnAddCompleted)
		pFnOnAddCompleted = UObject::FindFunction("Function APBUserInterface.cUIAction_Soc_AddIgnore.OnAddCompleted");

	APBUserInterface_OnAddCompleted_Parms OnAddCompleted_Parms;
	OnAddCompleted_Parms.Error = Error;
	pFnOnAddCompleted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnAddCompleted,NULL,&OnAddCompleted_Parms,NULL);
	pFnOnAddCompleted->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnInviteSent_Parms
{
};

void UcUIAction_Soc_SendGroupInvite::OnInviteSent()
{
	static UFieldFunc* pFnOnInviteSent = NULL;
	if(!pFnOnInviteSent)
		pFnOnInviteSent = UObject::FindFunction("Function APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSent");

	APBUserInterface_OnInviteSent_Parms OnInviteSent_Parms;
	pFnOnInviteSent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnInviteSent,NULL,&OnInviteSent_Parms,NULL);
	pFnOnInviteSent->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnInviteSendFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_Soc_SendGroupInvite::OnInviteSendFailed(int nError)
{
	static UFieldFunc* pFnOnInviteSendFailed = NULL;
	if(!pFnOnInviteSendFailed)
		pFnOnInviteSendFailed = UObject::FindFunction("Function APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSendFailed");

	APBUserInterface_OnInviteSendFailed_Parms OnInviteSendFailed_Parms;
	OnInviteSendFailed_Parms.nError = nError;
	pFnOnInviteSendFailed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnInviteSendFailed,NULL,&OnInviteSendFailed_Parms,NULL);
	pFnOnInviteSendFailed->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnSendCompleted_Parms
{
	int                                                Error;                                            		// 0x000000 (0x0004)              
};

void UcUIAction_Soc_SendTeamInvite::OnSendCompleted(int Error)
{
	static UFieldFunc* pFnOnSendCompleted = NULL;
	if(!pFnOnSendCompleted)
		pFnOnSendCompleted = UObject::FindFunction("Function APBUserInterface.cUIAction_Soc_SendTeamInvite.OnSendCompleted");

	APBUserInterface_OnSendCompleted_Parms OnSendCompleted_Parms;
	OnSendCompleted_Parms.Error = Error;
	pFnOnSendCompleted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnSendCompleted,NULL,&OnSendCompleted_Parms,NULL);
	pFnOnSendCompleted->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIAction_StreamLevel::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIAction_StreamLevel.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUIButton::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIButton.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUIButton::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIButton.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUIButton::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUIButton.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUIButton::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIButton.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_OnSetImage_Parms
{
	class UcUIAction_SetImage*                         Action;                                           		// 0x000000 (0x0004)              
};

void UcUIButton::OnSetImage(class UcUIAction_SetImage* Action)
{
	static UFieldFunc* pFnOnSetImage = NULL;
	if(!pFnOnSetImage)
		pFnOnSetImage = UObject::FindFunction("Function APBUserInterface.cUIButton.OnSetImage");

	APBUserInterface_OnSetImage_Parms OnSetImage_Parms;
	OnSetImage_Parms.Action = Action;
	ProcessEvent(pFnOnSetImage,NULL,&OnSetImage_Parms,NULL);
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUIButton::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIButton.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIButton::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIButton.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_ClearBoundDataStores_Parms
{
};

void UcUIButton::ClearBoundDataStores()
{
	static UFieldFunc* pFnClearBoundDataStores = NULL;
	if(!pFnClearBoundDataStores)
		pFnClearBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIButton.ClearBoundDataStores");

	APBUserInterface_ClearBoundDataStores_Parms ClearBoundDataStores_Parms;
	pFnClearBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearBoundDataStores,NULL,&ClearBoundDataStores_Parms,NULL);
	pFnClearBoundDataStores->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetSecondaryImage_Parms
{
	class USurface*                                    NewImage;                                         		// 0x000000 (0x0004)              
};

void UcUIButton::SetSecondaryImage(class USurface* NewImage)
{
	static UFieldFunc* pFnSetSecondaryImage = NULL;
	if(!pFnSetSecondaryImage)
		pFnSetSecondaryImage = UObject::FindFunction("Function APBUserInterface.cUIButton.SetSecondaryImage");

	APBUserInterface_SetSecondaryImage_Parms SetSecondaryImage_Parms;
	SetSecondaryImage_Parms.NewImage = NewImage;
	ProcessEvent(pFnSetSecondaryImage,NULL,&SetSecondaryImage_Parms,NULL);
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIThumbnailList::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_OnScrollBarSpaceClicked_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x000000 (0x0004)              
	float                                              PositionPerc;                                     		// 0x000004 (0x0004)              
	int                                                PlayerIndex;                                      		// 0x000008 (0x0004)              
};

void UcUIThumbnailList::OnScrollBarSpaceClicked(class UUIScrollbar* Sender,float PositionPerc,int PlayerIndex)
{
	static UFieldFunc* pFnOnScrollBarSpaceClicked = NULL;
	if(!pFnOnScrollBarSpaceClicked)
		pFnOnScrollBarSpaceClicked = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.OnScrollBarSpaceClicked");

	APBUserInterface_OnScrollBarSpaceClicked_Parms OnScrollBarSpaceClicked_Parms;
	OnScrollBarSpaceClicked_Parms.Sender = Sender;
	OnScrollBarSpaceClicked_Parms.PositionPerc = PositionPerc;
	OnScrollBarSpaceClicked_Parms.PlayerIndex = PlayerIndex;
	pFnOnScrollBarSpaceClicked->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnScrollBarSpaceClicked,NULL,&OnScrollBarSpaceClicked_Parms,NULL);
	pFnOnScrollBarSpaceClicked->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetNumItems_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetNumItems()
{
	static UFieldFunc* pFnGetNumItems = NULL;
	if(!pFnGetNumItems)
		pFnGetNumItems = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetNumItems");

	APBUserInterface_GetNumItems_Parms GetNumItems_Parms;
	pFnGetNumItems->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumItems,NULL,&GetNumItems_Parms,NULL);
	pFnGetNumItems->FunctionFlags |= 0x400;
	return GetNumItems_Parms.ReturnValue;
}

struct APBUserInterface_GetNumCols_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetNumCols()
{
	static UFieldFunc* pFnGetNumCols = NULL;
	if(!pFnGetNumCols)
		pFnGetNumCols = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetNumCols");

	APBUserInterface_GetNumCols_Parms GetNumCols_Parms;
	pFnGetNumCols->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumCols,NULL,&GetNumCols_Parms,NULL);
	pFnGetNumCols->FunctionFlags |= 0x400;
	return GetNumCols_Parms.ReturnValue;
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUIThumbnailList::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIThumbnailList::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_GetNumRows_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetNumRows()
{
	static UFieldFunc* pFnGetNumRows = NULL;
	if(!pFnGetNumRows)
		pFnGetNumRows = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetNumRows");

	APBUserInterface_GetNumRows_Parms GetNumRows_Parms;
	pFnGetNumRows->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumRows,NULL,&GetNumRows_Parms,NULL);
	pFnGetNumRows->FunctionFlags |= 0x400;
	return GetNumRows_Parms.ReturnValue;
}

struct APBUserInterface_GetCurrentItem_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetCurrentItem()
{
	static UFieldFunc* pFnGetCurrentItem = NULL;
	if(!pFnGetCurrentItem)
		pFnGetCurrentItem = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetCurrentItem");

	APBUserInterface_GetCurrentItem_Parms GetCurrentItem_Parms;
	pFnGetCurrentItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentItem,NULL,&GetCurrentItem_Parms,NULL);
	pFnGetCurrentItem->FunctionFlags |= 0x400;
	return GetCurrentItem_Parms.ReturnValue;
}

struct APBUserInterface_GetInfoTextHeight_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float UcUIThumbnailList::GetInfoTextHeight()
{
	static UFieldFunc* pFnGetInfoTextHeight = NULL;
	if(!pFnGetInfoTextHeight)
		pFnGetInfoTextHeight = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetInfoTextHeight");

	APBUserInterface_GetInfoTextHeight_Parms GetInfoTextHeight_Parms;
	pFnGetInfoTextHeight->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetInfoTextHeight,NULL,&GetInfoTextHeight_Parms,NULL);
	pFnGetInfoTextHeight->FunctionFlags |= 0x400;
	return GetInfoTextHeight_Parms.ReturnValue;
}

struct APBUserInterface_ClearBoundDataStores_Parms
{
};

void UcUIThumbnailList::ClearBoundDataStores()
{
	static UFieldFunc* pFnClearBoundDataStores = NULL;
	if(!pFnClearBoundDataStores)
		pFnClearBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.ClearBoundDataStores");

	APBUserInterface_ClearBoundDataStores_Parms ClearBoundDataStores_Parms;
	pFnClearBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearBoundDataStores,NULL,&ClearBoundDataStores_Parms,NULL);
	pFnClearBoundDataStores->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetNumPages_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetNumPages()
{
	static UFieldFunc* pFnGetNumPages = NULL;
	if(!pFnGetNumPages)
		pFnGetNumPages = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetNumPages");

	APBUserInterface_GetNumPages_Parms GetNumPages_Parms;
	pFnGetNumPages->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumPages,NULL,&GetNumPages_Parms,NULL);
	pFnGetNumPages->FunctionFlags |= 0x400;
	return GetNumPages_Parms.ReturnValue;
}

struct APBUserInterface_ChangePage_Parms
{
	int                                                nDelta;                                           		// 0x000000 (0x0004)              
};

void UcUIThumbnailList::ChangePage(int nDelta)
{
	static UFieldFunc* pFnChangePage = NULL;
	if(!pFnChangePage)
		pFnChangePage = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.ChangePage");

	APBUserInterface_ChangePage_Parms ChangePage_Parms;
	ChangePage_Parms.nDelta = nDelta;
	pFnChangePage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnChangePage,NULL,&ChangePage_Parms,NULL);
	pFnChangePage->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnSetListIndex_Parms
{
	class UUIAction_SetListIndex*                      Action;                                           		// 0x000000 (0x0004)              
	//int                                                OutputLinkIndex;                                  		// 0x000004 (0x0004)              
};

void UcUIThumbnailList::OnSetListIndex(class UUIAction_SetListIndex* Action)
{
	static UFieldFunc* pFnOnSetListIndex = NULL;
	if(!pFnOnSetListIndex)
		pFnOnSetListIndex = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.OnSetListIndex");

	APBUserInterface_OnSetListIndex_Parms OnSetListIndex_Parms;
	OnSetListIndex_Parms.Action = Action;
	ProcessEvent(pFnOnSetListIndex,NULL,&OnSetListIndex_Parms,NULL);
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUIThumbnailList::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUIThumbnailList::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUIThumbnailList::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetCurrentPage_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetCurrentPage()
{
	static UFieldFunc* pFnGetCurrentPage = NULL;
	if(!pFnGetCurrentPage)
		pFnGetCurrentPage = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetCurrentPage");

	APBUserInterface_GetCurrentPage_Parms GetCurrentPage_Parms;
	pFnGetCurrentPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentPage,NULL,&GetCurrentPage_Parms,NULL);
	pFnGetCurrentPage->FunctionFlags |= 0x400;
	return GetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_SelectItem_Parms
{
	int                                                nIndex;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIThumbnailList::SelectItem(int nIndex)
{
	static UFieldFunc* pFnSelectItem = NULL;
	if(!pFnSelectItem)
		pFnSelectItem = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.SelectItem");

	APBUserInterface_SelectItem_Parms SelectItem_Parms;
	SelectItem_Parms.nIndex = nIndex;
	pFnSelectItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSelectItem,NULL,&SelectItem_Parms,NULL);
	pFnSelectItem->FunctionFlags |= 0x400;
	return SelectItem_Parms.ReturnValue;
}

struct APBUserInterface_GetImageWidth_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float UcUIThumbnailList::GetImageWidth()
{
	static UFieldFunc* pFnGetImageWidth = NULL;
	if(!pFnGetImageWidth)
		pFnGetImageWidth = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetImageWidth");

	APBUserInterface_GetImageWidth_Parms GetImageWidth_Parms;
	pFnGetImageWidth->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetImageWidth,NULL,&GetImageWidth_Parms,NULL);
	pFnGetImageWidth->FunctionFlags |= 0x400;
	return GetImageWidth_Parms.ReturnValue;
}

struct APBUserInterface_GetImageHeight_Parms
{
	unsigned long                                      bIncludeText : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
	float                                              ReturnValue;                                      		// 0x000004 (0x0004)              
};

float UcUIThumbnailList::GetImageHeight(bool bIncludeText)
{
	static UFieldFunc* pFnGetImageHeight = NULL;
	if(!pFnGetImageHeight)
		pFnGetImageHeight = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetImageHeight");

	APBUserInterface_GetImageHeight_Parms GetImageHeight_Parms;
	GetImageHeight_Parms.bIncludeText = bIncludeText;
	pFnGetImageHeight->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetImageHeight,NULL,&GetImageHeight_Parms,NULL);
	pFnGetImageHeight->FunctionFlags |= 0x400;
	return GetImageHeight_Parms.ReturnValue;
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUIThumbnailList::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_OnChangeThumbnailListPage_Parms
{
	class UcUIAction_ChangeThumbnailListPage*          Action;                                           		// 0x000000 (0x0004)              
};

void UcUIThumbnailList::OnChangeThumbnailListPage(class UcUIAction_ChangeThumbnailListPage* Action)
{
	static UFieldFunc* pFnOnChangeThumbnailListPage = NULL;
	if(!pFnOnChangeThumbnailListPage)
		pFnOnChangeThumbnailListPage = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.OnChangeThumbnailListPage");

	APBUserInterface_OnChangeThumbnailListPage_Parms OnChangeThumbnailListPage_Parms;
	OnChangeThumbnailListPage_Parms.Action = Action;
	ProcessEvent(pFnOnChangeThumbnailListPage,NULL,&OnChangeThumbnailListPage_Parms,NULL);
}

struct APBUserInterface_GetNumVisibleItems_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIThumbnailList::GetNumVisibleItems()
{
	static UFieldFunc* pFnGetNumVisibleItems = NULL;
	if(!pFnGetNumVisibleItems)
		pFnGetNumVisibleItems = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.GetNumVisibleItems");

	APBUserInterface_GetNumVisibleItems_Parms GetNumVisibleItems_Parms;
	pFnGetNumVisibleItems->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumVisibleItems,NULL,&GetNumVisibleItems_Parms,NULL);
	pFnGetNumVisibleItems->FunctionFlags |= 0x400;
	return GetNumVisibleItems_Parms.ReturnValue;
}

struct APBUserInterface_OnScrollBarMoved_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x000000 (0x0004)              
	float                                              PositionChange;                                   		// 0x000004 (0x0004)              
	unsigned long                                      bPositionMaxed : 1;                               		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIThumbnailList::OnScrollBarMoved(class UUIScrollbar* Sender,float PositionChange,bool bPositionMaxed)
{
	static UFieldFunc* pFnOnScrollBarMoved = NULL;
	if(!pFnOnScrollBarMoved)
		pFnOnScrollBarMoved = UObject::FindFunction("Function APBUserInterface.cUIThumbnailList.OnScrollBarMoved");

	APBUserInterface_OnScrollBarMoved_Parms OnScrollBarMoved_Parms;
	OnScrollBarMoved_Parms.Sender = Sender;
	OnScrollBarMoved_Parms.PositionChange = PositionChange;
	OnScrollBarMoved_Parms.bPositionMaxed = bPositionMaxed;
	pFnOnScrollBarMoved->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnScrollBarMoved,NULL,&OnScrollBarMoved_Parms,NULL);
	pFnOnScrollBarMoved->FunctionFlags |= 0x400;
	return OnScrollBarMoved_Parms.ReturnValue;
}

struct APBUserInterface_TogglePopupDialogTool_Parms
{
};

void UcUIConsoleCommands::TogglePopupDialogTool()
{
	static UFieldFunc* pFnTogglePopupDialogTool = NULL;
	if(!pFnTogglePopupDialogTool)
		pFnTogglePopupDialogTool = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.TogglePopupDialogTool");

	APBUserInterface_TogglePopupDialogTool_Parms TogglePopupDialogTool_Parms;
	pFnTogglePopupDialogTool->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTogglePopupDialogTool,NULL,&TogglePopupDialogTool_Parms,NULL);
	pFnTogglePopupDialogTool->FunctionFlags |= 0x400;
}

struct APBUserInterface_ResetPopupCounters_Parms
{
};

void UcUIConsoleCommands::ResetPopupCounters()
{
	static UFieldFunc* pFnResetPopupCounters = NULL;
	if(!pFnResetPopupCounters)
		pFnResetPopupCounters = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ResetPopupCounters");

	APBUserInterface_ResetPopupCounters_Parms ResetPopupCounters_Parms;
	pFnResetPopupCounters->FunctionFlags |= ~0x400;
	ProcessEvent(pFnResetPopupCounters,NULL,&ResetPopupCounters_Parms,NULL);
	pFnResetPopupCounters->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenTestContactUI_Parms
{
	struct FString                                     sUIType;                                          		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenTestContactUI(struct FString sUIType)
{
	static UFieldFunc* pFnOpenTestContactUI = NULL;
	if(!pFnOpenTestContactUI)
		pFnOpenTestContactUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenTestContactUI");

	APBUserInterface_OpenTestContactUI_Parms OpenTestContactUI_Parms;
	memcpy(&OpenTestContactUI_Parms.sUIType,&sUIType,0xC);
	pFnOpenTestContactUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenTestContactUI,NULL,&OpenTestContactUI_Parms,NULL);
	pFnOpenTestContactUI->FunctionFlags |= 0x400;
	return OpenTestContactUI_Parms.ReturnValue;
}

struct APBUserInterface_PreviewMissionStageDisable_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::PreviewMissionStageDisable()
{
	static UFieldFunc* pFnPreviewMissionStageDisable = NULL;
	if(!pFnPreviewMissionStageDisable)
		pFnPreviewMissionStageDisable = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.PreviewMissionStageDisable");

	APBUserInterface_PreviewMissionStageDisable_Parms PreviewMissionStageDisable_Parms;
	pFnPreviewMissionStageDisable->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPreviewMissionStageDisable,NULL,&PreviewMissionStageDisable_Parms,NULL);
	pFnPreviewMissionStageDisable->FunctionFlags |= 0x400;
	return PreviewMissionStageDisable_Parms.ReturnValue;
}

struct APBUserInterface_ChangeLanguage_Parms
{
	struct FString                                     sNewLanguage;                                     		// 0x000000 (0x000C)              
};

void UcUIConsoleCommands::ChangeLanguage(struct FString sNewLanguage)
{
	static UFieldFunc* pFnChangeLanguage = NULL;
	if(!pFnChangeLanguage)
		pFnChangeLanguage = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ChangeLanguage");

	APBUserInterface_ChangeLanguage_Parms ChangeLanguage_Parms;
	memcpy(&ChangeLanguage_Parms.sNewLanguage,&sNewLanguage,0xC);
	pFnChangeLanguage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnChangeLanguage,NULL,&ChangeLanguage_Parms,NULL);
	pFnChangeLanguage->FunctionFlags |= 0x400;
}

struct APBUserInterface_DebugShowBrowserNavigation_Parms
{
	unsigned long                                      bVisible : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::DebugShowBrowserNavigation(bool bVisible)
{
	static UFieldFunc* pFnDebugShowBrowserNavigation = NULL;
	if(!pFnDebugShowBrowserNavigation)
		pFnDebugShowBrowserNavigation = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.DebugShowBrowserNavigation");

	APBUserInterface_DebugShowBrowserNavigation_Parms DebugShowBrowserNavigation_Parms;
	DebugShowBrowserNavigation_Parms.bVisible = bVisible;
	pFnDebugShowBrowserNavigation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDebugShowBrowserNavigation,NULL,&DebugShowBrowserNavigation_Parms,NULL);
	pFnDebugShowBrowserNavigation->FunctionFlags |= 0x400;
	return DebugShowBrowserNavigation_Parms.ReturnValue;
}

struct APBUserInterface_ToggleStorageInventoryUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleStorageInventoryUI()
{
	static UFieldFunc* pFnToggleStorageInventoryUI = NULL;
	if(!pFnToggleStorageInventoryUI)
		pFnToggleStorageInventoryUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleStorageInventoryUI");

	APBUserInterface_ToggleStorageInventoryUI_Parms ToggleStorageInventoryUI_Parms;
	pFnToggleStorageInventoryUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleStorageInventoryUI,NULL,&ToggleStorageInventoryUI_Parms,NULL);
	pFnToggleStorageInventoryUI->FunctionFlags |= 0x400;
	return ToggleStorageInventoryUI_Parms.ReturnValue;
}

struct APBUserInterface_ResetUserNameAndPassword_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ResetUserNameAndPassword()
{
	static UFieldFunc* pFnResetUserNameAndPassword = NULL;
	if(!pFnResetUserNameAndPassword)
		pFnResetUserNameAndPassword = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ResetUserNameAndPassword");

	APBUserInterface_ResetUserNameAndPassword_Parms ResetUserNameAndPassword_Parms;
	pFnResetUserNameAndPassword->FunctionFlags |= ~0x400;
	ProcessEvent(pFnResetUserNameAndPassword,NULL,&ResetUserNameAndPassword_Parms,NULL);
	pFnResetUserNameAndPassword->FunctionFlags |= 0x400;
	return ResetUserNameAndPassword_Parms.ReturnValue;
}

struct APBUserInterface_ToggleMailUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleMailUI()
{
	static UFieldFunc* pFnToggleMailUI = NULL;
	if(!pFnToggleMailUI)
		pFnToggleMailUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleMailUI");

	APBUserInterface_ToggleMailUI_Parms ToggleMailUI_Parms;
	pFnToggleMailUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleMailUI,NULL,&ToggleMailUI_Parms,NULL);
	pFnToggleMailUI->FunctionFlags |= 0x400;
	return ToggleMailUI_Parms.ReturnValue;
}

struct APBUserInterface_ToggleMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleMissionSummary()
{
	static UFieldFunc* pFnToggleMissionSummary = NULL;
	if(!pFnToggleMissionSummary)
		pFnToggleMissionSummary = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleMissionSummary");

	APBUserInterface_ToggleMissionSummary_Parms ToggleMissionSummary_Parms;
	pFnToggleMissionSummary->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleMissionSummary,NULL,&ToggleMissionSummary_Parms,NULL);
	pFnToggleMissionSummary->FunctionFlags |= 0x400;
	return ToggleMissionSummary_Parms.ReturnValue;
}

struct APBUserInterface_ToggleMarketplaceUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleMarketplaceUI()
{
	static UFieldFunc* pFnToggleMarketplaceUI = NULL;
	if(!pFnToggleMarketplaceUI)
		pFnToggleMarketplaceUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleMarketplaceUI");

	APBUserInterface_ToggleMarketplaceUI_Parms ToggleMarketplaceUI_Parms;
	pFnToggleMarketplaceUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleMarketplaceUI,NULL,&ToggleMarketplaceUI_Parms,NULL);
	pFnToggleMarketplaceUI->FunctionFlags |= 0x400;
	return ToggleMarketplaceUI_Parms.ReturnValue;
}

struct APBUserInterface_ToggleSocialUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleSocialUI()
{
	static UFieldFunc* pFnToggleSocialUI = NULL;
	if(!pFnToggleSocialUI)
		pFnToggleSocialUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleSocialUI");

	APBUserInterface_ToggleSocialUI_Parms ToggleSocialUI_Parms;
	pFnToggleSocialUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleSocialUI,NULL,&ToggleSocialUI_Parms,NULL);
	pFnToggleSocialUI->FunctionFlags |= 0x400;
	return ToggleSocialUI_Parms.ReturnValue;
}

struct APBUserInterface_Editor_OpenMarketplaceUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::Editor_OpenMarketplaceUI()
{
	static UFieldFunc* pFnEditor_OpenMarketplaceUI = NULL;
	if(!pFnEditor_OpenMarketplaceUI)
		pFnEditor_OpenMarketplaceUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.Editor_OpenMarketplaceUI");

	APBUserInterface_Editor_OpenMarketplaceUI_Parms Editor_OpenMarketplaceUI_Parms;
	pFnEditor_OpenMarketplaceUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnEditor_OpenMarketplaceUI,NULL,&Editor_OpenMarketplaceUI_Parms,NULL);
	pFnEditor_OpenMarketplaceUI->FunctionFlags |= 0x400;
	return Editor_OpenMarketplaceUI_Parms.ReturnValue;
}

struct APBUserInterface_OpenContactUI_Parms
{
	struct FString                                     sContact;                                         		// 0x000000 (0x000C)              
	struct FString                                     sContactRole;                                     		// 0x00000C (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenContactUI(struct FString sContact,struct FString sContactRole)
{
	static UFieldFunc* pFnOpenContactUI = NULL;
	if(!pFnOpenContactUI)
		pFnOpenContactUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenContactUI");

	APBUserInterface_OpenContactUI_Parms OpenContactUI_Parms;
	memcpy(&OpenContactUI_Parms.sContact,&sContact,0xC);
	memcpy(&OpenContactUI_Parms.sContactRole,&sContactRole,0xC);
	pFnOpenContactUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenContactUI,NULL,&OpenContactUI_Parms,NULL);
	pFnOpenContactUI->FunctionFlags |= 0x400;
	return OpenContactUI_Parms.ReturnValue;
}

struct APBUserInterface_ScreenShot_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ScreenShot()
{
	static UFieldFunc* pFnScreenShot = NULL;
	if(!pFnScreenShot)
		pFnScreenShot = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ScreenShot");

	APBUserInterface_ScreenShot_Parms ScreenShot_Parms;
	pFnScreenShot->FunctionFlags |= ~0x400;
	ProcessEvent(pFnScreenShot,NULL,&ScreenShot_Parms,NULL);
	pFnScreenShot->FunctionFlags |= 0x400;
	return ScreenShot_Parms.ReturnValue;
}

struct APBUserInterface_OpenMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenMissionSummary()
{
	static UFieldFunc* pFnOpenMissionSummary = NULL;
	if(!pFnOpenMissionSummary)
		pFnOpenMissionSummary = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenMissionSummary");

	APBUserInterface_OpenMissionSummary_Parms OpenMissionSummary_Parms;
	pFnOpenMissionSummary->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenMissionSummary,NULL,&OpenMissionSummary_Parms,NULL);
	pFnOpenMissionSummary->FunctionFlags |= 0x400;
	return OpenMissionSummary_Parms.ReturnValue;
}

struct APBUserInterface_ToggleTeamMgmtUI_Parms
{
	unsigned long                                      bForce : 1;                                       		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleTeamMgmtUI(bool bForce)
{
	static UFieldFunc* pFnToggleTeamMgmtUI = NULL;
	if(!pFnToggleTeamMgmtUI)
		pFnToggleTeamMgmtUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleTeamMgmtUI");

	APBUserInterface_ToggleTeamMgmtUI_Parms ToggleTeamMgmtUI_Parms;
	ToggleTeamMgmtUI_Parms.bForce = bForce;
	pFnToggleTeamMgmtUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleTeamMgmtUI,NULL,&ToggleTeamMgmtUI_Parms,NULL);
	pFnToggleTeamMgmtUI->FunctionFlags |= 0x400;
	return ToggleTeamMgmtUI_Parms.ReturnValue;
}

struct APBUserInterface_CrimeEventAlertUI_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::CrimeEventAlertUI(bool bShow)
{
	static UFieldFunc* pFnCrimeEventAlertUI = NULL;
	if(!pFnCrimeEventAlertUI)
		pFnCrimeEventAlertUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.CrimeEventAlertUI");

	APBUserInterface_CrimeEventAlertUI_Parms CrimeEventAlertUI_Parms;
	CrimeEventAlertUI_Parms.bShow = bShow;
	pFnCrimeEventAlertUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCrimeEventAlertUI,NULL,&CrimeEventAlertUI_Parms,NULL);
	pFnCrimeEventAlertUI->FunctionFlags |= 0x400;
	return CrimeEventAlertUI_Parms.ReturnValue;
}

struct APBUserInterface_InvertMouse_Parms
{
	unsigned long                                      bInvert : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::InvertMouse(bool bInvert)
{
	static UFieldFunc* pFnInvertMouse = NULL;
	if(!pFnInvertMouse)
		pFnInvertMouse = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.InvertMouse");

	APBUserInterface_InvertMouse_Parms InvertMouse_Parms;
	InvertMouse_Parms.bInvert = bInvert;
	pFnInvertMouse->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInvertMouse,NULL,&InvertMouse_Parms,NULL);
	pFnInvertMouse->FunctionFlags |= 0x400;
	return InvertMouse_Parms.ReturnValue;
}

struct APBUserInterface_ToggleReportBugUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleReportBugUI()
{
	static UFieldFunc* pFnToggleReportBugUI = NULL;
	if(!pFnToggleReportBugUI)
		pFnToggleReportBugUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleReportBugUI");

	APBUserInterface_ToggleReportBugUI_Parms ToggleReportBugUI_Parms;
	pFnToggleReportBugUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleReportBugUI,NULL,&ToggleReportBugUI_Parms,NULL);
	pFnToggleReportBugUI->FunctionFlags |= 0x400;
	return ToggleReportBugUI_Parms.ReturnValue;
}

struct APBUserInterface_OnMenuClosed_Parms
{
	struct FName                                       Menu;                                             		// 0x000000 (0x0008)              
};

void UcUIConsoleCommands::OnMenuClosed(struct FName Menu)
{
	static UFieldFunc* pFnOnMenuClosed = NULL;
	if(!pFnOnMenuClosed)
		pFnOnMenuClosed = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OnMenuClosed");

	APBUserInterface_OnMenuClosed_Parms OnMenuClosed_Parms;
	memcpy(&OnMenuClosed_Parms.Menu,&Menu,0x8);
	pFnOnMenuClosed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnMenuClosed,NULL,&OnMenuClosed_Parms,NULL);
	pFnOnMenuClosed->FunctionFlags |= 0x400;
}

struct APBUserInterface_TogglePopupCues_Parms
{
};

void UcUIConsoleCommands::TogglePopupCues()
{
	static UFieldFunc* pFnTogglePopupCues = NULL;
	if(!pFnTogglePopupCues)
		pFnTogglePopupCues = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.TogglePopupCues");

	APBUserInterface_TogglePopupCues_Parms TogglePopupCues_Parms;
	pFnTogglePopupCues->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTogglePopupCues,NULL,&TogglePopupCues_Parms,NULL);
	pFnTogglePopupCues->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenArmasStore_Parms
{
	struct FString                                     sSDDURLTag;                                       		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenArmasStore(struct FString sSDDURLTag)
{
	static UFieldFunc* pFnOpenArmasStore = NULL;
	if(!pFnOpenArmasStore)
		pFnOpenArmasStore = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenArmasStore");

	APBUserInterface_OpenArmasStore_Parms OpenArmasStore_Parms;
	memcpy(&OpenArmasStore_Parms.sSDDURLTag,&sSDDURLTag,0xC);
	pFnOpenArmasStore->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenArmasStore,NULL,&OpenArmasStore_Parms,NULL);
	pFnOpenArmasStore->FunctionFlags |= 0x400;
	return OpenArmasStore_Parms.ReturnValue;
}

struct APBUserInterface_ToggleMusicPlaybackUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleMusicPlaybackUI()
{
	static UFieldFunc* pFnToggleMusicPlaybackUI = NULL;
	if(!pFnToggleMusicPlaybackUI)
		pFnToggleMusicPlaybackUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleMusicPlaybackUI");

	APBUserInterface_ToggleMusicPlaybackUI_Parms ToggleMusicPlaybackUI_Parms;
	pFnToggleMusicPlaybackUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleMusicPlaybackUI,NULL,&ToggleMusicPlaybackUI_Parms,NULL);
	pFnToggleMusicPlaybackUI->FunctionFlags |= 0x400;
	return ToggleMusicPlaybackUI_Parms.ReturnValue;
}

struct APBUserInterface_FlushMailCache_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::FlushMailCache()
{
	static UFieldFunc* pFnFlushMailCache = NULL;
	if(!pFnFlushMailCache)
		pFnFlushMailCache = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.FlushMailCache");

	APBUserInterface_FlushMailCache_Parms FlushMailCache_Parms;
	pFnFlushMailCache->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFlushMailCache,NULL,&FlushMailCache_Parms,NULL);
	pFnFlushMailCache->FunctionFlags |= 0x400;
	return FlushMailCache_Parms.ReturnValue;
}

struct APBUserInterface_CloseContactUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::CloseContactUI()
{
	static UFieldFunc* pFnCloseContactUI = NULL;
	if(!pFnCloseContactUI)
		pFnCloseContactUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.CloseContactUI");

	APBUserInterface_CloseContactUI_Parms CloseContactUI_Parms;
	pFnCloseContactUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseContactUI,NULL,&CloseContactUI_Parms,NULL);
	pFnCloseContactUI->FunctionFlags |= 0x400;
	return CloseContactUI_Parms.ReturnValue;
}

struct APBUserInterface_OpenLobby_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenLobby()
{
	static UFieldFunc* pFnOpenLobby = NULL;
	if(!pFnOpenLobby)
		pFnOpenLobby = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenLobby");

	APBUserInterface_OpenLobby_Parms OpenLobby_Parms;
	pFnOpenLobby->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenLobby,NULL,&OpenLobby_Parms,NULL);
	pFnOpenLobby->FunctionFlags |= 0x400;
	return OpenLobby_Parms.ReturnValue;
}

struct APBUserInterface_ToggleTutorialUI_Parms
{
	unsigned long                                      bForce : 1;                                       		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleTutorialUI(bool bForce)
{
	static UFieldFunc* pFnToggleTutorialUI = NULL;
	if(!pFnToggleTutorialUI)
		pFnToggleTutorialUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleTutorialUI");

	APBUserInterface_ToggleTutorialUI_Parms ToggleTutorialUI_Parms;
	ToggleTutorialUI_Parms.bForce = bForce;
	pFnToggleTutorialUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleTutorialUI,NULL,&ToggleTutorialUI_Parms,NULL);
	pFnToggleTutorialUI->FunctionFlags |= 0x400;
	return ToggleTutorialUI_Parms.ReturnValue;
}

struct APBUserInterface_InGameQuestionAccepted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::InGameQuestionAccepted()
{
	static UFieldFunc* pFnInGameQuestionAccepted = NULL;
	if(!pFnInGameQuestionAccepted)
		pFnInGameQuestionAccepted = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.InGameQuestionAccepted");

	APBUserInterface_InGameQuestionAccepted_Parms InGameQuestionAccepted_Parms;
	pFnInGameQuestionAccepted->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInGameQuestionAccepted,NULL,&InGameQuestionAccepted_Parms,NULL);
	pFnInGameQuestionAccepted->FunctionFlags |= 0x400;
	return InGameQuestionAccepted_Parms.ReturnValue;
}

struct APBUserInterface_OpenViewUI_Parms
{
	struct FString                                     sInventoryItemType;                               		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenViewUI(struct FString sInventoryItemType)
{
	static UFieldFunc* pFnOpenViewUI = NULL;
	if(!pFnOpenViewUI)
		pFnOpenViewUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenViewUI");

	APBUserInterface_OpenViewUI_Parms OpenViewUI_Parms;
	memcpy(&OpenViewUI_Parms.sInventoryItemType,&sInventoryItemType,0xC);
	pFnOpenViewUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenViewUI,NULL,&OpenViewUI_Parms,NULL);
	pFnOpenViewUI->FunctionFlags |= 0x400;
	return OpenViewUI_Parms.ReturnValue;
}

struct APBUserInterface_ForceWorldsOffline_Parms
{
	unsigned long                                      bOffline : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ForceWorldsOffline(bool bOffline)
{
	static UFieldFunc* pFnForceWorldsOffline = NULL;
	if(!pFnForceWorldsOffline)
		pFnForceWorldsOffline = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ForceWorldsOffline");

	APBUserInterface_ForceWorldsOffline_Parms ForceWorldsOffline_Parms;
	ForceWorldsOffline_Parms.bOffline = bOffline;
	pFnForceWorldsOffline->FunctionFlags |= ~0x400;
	ProcessEvent(pFnForceWorldsOffline,NULL,&ForceWorldsOffline_Parms,NULL);
	pFnForceWorldsOffline->FunctionFlags |= 0x400;
	return ForceWorldsOffline_Parms.ReturnValue;
}

struct APBUserInterface_InGameQuestionDeclined_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::InGameQuestionDeclined()
{
	static UFieldFunc* pFnInGameQuestionDeclined = NULL;
	if(!pFnInGameQuestionDeclined)
		pFnInGameQuestionDeclined = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.InGameQuestionDeclined");

	APBUserInterface_InGameQuestionDeclined_Parms InGameQuestionDeclined_Parms;
	pFnInGameQuestionDeclined->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInGameQuestionDeclined,NULL,&InGameQuestionDeclined_Parms,NULL);
	pFnInGameQuestionDeclined->FunctionFlags |= 0x400;
	return InGameQuestionDeclined_Parms.ReturnValue;
}

struct APBUserInterface_OpenAPBSupportPage_Parms
{
	struct FString                                     sSDDURLTag;                                       		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenAPBSupportPage(struct FString sSDDURLTag)
{
	static UFieldFunc* pFnOpenAPBSupportPage = NULL;
	if(!pFnOpenAPBSupportPage)
		pFnOpenAPBSupportPage = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenAPBSupportPage");

	APBUserInterface_OpenAPBSupportPage_Parms OpenAPBSupportPage_Parms;
	memcpy(&OpenAPBSupportPage_Parms.sSDDURLTag,&sSDDURLTag,0xC);
	pFnOpenAPBSupportPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenAPBSupportPage,NULL,&OpenAPBSupportPage_Parms,NULL);
	pFnOpenAPBSupportPage->FunctionFlags |= 0x400;
	return OpenAPBSupportPage_Parms.ReturnValue;
}

struct APBUserInterface_OpenCityMap_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenCityMap()
{
	static UFieldFunc* pFnOpenCityMap = NULL;
	if(!pFnOpenCityMap)
		pFnOpenCityMap = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenCityMap");

	APBUserInterface_OpenCityMap_Parms OpenCityMap_Parms;
	pFnOpenCityMap->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenCityMap,NULL,&OpenCityMap_Parms,NULL);
	pFnOpenCityMap->FunctionFlags |= 0x400;
	return OpenCityMap_Parms.ReturnValue;
}

struct APBUserInterface_ToggleOptionsUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleOptionsUI()
{
	static UFieldFunc* pFnToggleOptionsUI = NULL;
	if(!pFnToggleOptionsUI)
		pFnToggleOptionsUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleOptionsUI");

	APBUserInterface_ToggleOptionsUI_Parms ToggleOptionsUI_Parms;
	pFnToggleOptionsUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleOptionsUI,NULL,&ToggleOptionsUI_Parms,NULL);
	pFnToggleOptionsUI->FunctionFlags |= 0x400;
	return ToggleOptionsUI_Parms.ReturnValue;
}

struct APBUserInterface_InternalToggleInventoryUI_Parms
{
};

void UcUIConsoleCommands::InternalToggleInventoryUI()
{
	static UFieldFunc* pFnInternalToggleInventoryUI = NULL;
	if(!pFnInternalToggleInventoryUI)
		pFnInternalToggleInventoryUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.InternalToggleInventoryUI");

	APBUserInterface_InternalToggleInventoryUI_Parms InternalToggleInventoryUI_Parms;
	pFnInternalToggleInventoryUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInternalToggleInventoryUI,NULL,&InternalToggleInventoryUI_Parms,NULL);
	pFnInternalToggleInventoryUI->FunctionFlags |= 0x400;
}

struct APBUserInterface_CloseMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::CloseMissionSummary()
{
	static UFieldFunc* pFnCloseMissionSummary = NULL;
	if(!pFnCloseMissionSummary)
		pFnCloseMissionSummary = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.CloseMissionSummary");

	APBUserInterface_CloseMissionSummary_Parms CloseMissionSummary_Parms;
	pFnCloseMissionSummary->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseMissionSummary,NULL,&CloseMissionSummary_Parms,NULL);
	pFnCloseMissionSummary->FunctionFlags |= 0x400;
	return CloseMissionSummary_Parms.ReturnValue;
}

struct APBUserInterface_ToggleTooltipTool_Parms
{
};

void UcUIConsoleCommands::ToggleTooltipTool()
{
	static UFieldFunc* pFnToggleTooltipTool = NULL;
	if(!pFnToggleTooltipTool)
		pFnToggleTooltipTool = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleTooltipTool");

	APBUserInterface_ToggleTooltipTool_Parms ToggleTooltipTool_Parms;
	pFnToggleTooltipTool->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleTooltipTool,NULL,&ToggleTooltipTool_Parms,NULL);
	pFnToggleTooltipTool->FunctionFlags |= 0x400;
}

struct APBUserInterface_ToggleDeploymentInventoryUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleDeploymentInventoryUI()
{
	static UFieldFunc* pFnToggleDeploymentInventoryUI = NULL;
	if(!pFnToggleDeploymentInventoryUI)
		pFnToggleDeploymentInventoryUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleDeploymentInventoryUI");

	APBUserInterface_ToggleDeploymentInventoryUI_Parms ToggleDeploymentInventoryUI_Parms;
	pFnToggleDeploymentInventoryUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleDeploymentInventoryUI,NULL,&ToggleDeploymentInventoryUI_Parms,NULL);
	pFnToggleDeploymentInventoryUI->FunctionFlags |= 0x400;
	return ToggleDeploymentInventoryUI_Parms.ReturnValue;
}

struct APBUserInterface_OpenKnowledgeBase_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenKnowledgeBase()
{
	static UFieldFunc* pFnOpenKnowledgeBase = NULL;
	if(!pFnOpenKnowledgeBase)
		pFnOpenKnowledgeBase = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenKnowledgeBase");

	APBUserInterface_OpenKnowledgeBase_Parms OpenKnowledgeBase_Parms;
	pFnOpenKnowledgeBase->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenKnowledgeBase,NULL,&OpenKnowledgeBase_Parms,NULL);
	pFnOpenKnowledgeBase->FunctionFlags |= 0x400;
	return OpenKnowledgeBase_Parms.ReturnValue;
}

struct APBUserInterface_FlushMarketplaceCache_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::FlushMarketplaceCache()
{
	static UFieldFunc* pFnFlushMarketplaceCache = NULL;
	if(!pFnFlushMarketplaceCache)
		pFnFlushMarketplaceCache = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.FlushMarketplaceCache");

	APBUserInterface_FlushMarketplaceCache_Parms FlushMarketplaceCache_Parms;
	pFnFlushMarketplaceCache->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFlushMarketplaceCache,NULL,&FlushMarketplaceCache_Parms,NULL);
	pFnFlushMarketplaceCache->FunctionFlags |= 0x400;
	return FlushMarketplaceCache_Parms.ReturnValue;
}

struct APBUserInterface_ResetEULATOSAcceptDates_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ResetEULATOSAcceptDates()
{
	static UFieldFunc* pFnResetEULATOSAcceptDates = NULL;
	if(!pFnResetEULATOSAcceptDates)
		pFnResetEULATOSAcceptDates = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ResetEULATOSAcceptDates");

	APBUserInterface_ResetEULATOSAcceptDates_Parms ResetEULATOSAcceptDates_Parms;
	pFnResetEULATOSAcceptDates->FunctionFlags |= ~0x400;
	ProcessEvent(pFnResetEULATOSAcceptDates,NULL,&ResetEULATOSAcceptDates_Parms,NULL);
	pFnResetEULATOSAcceptDates->FunctionFlags |= 0x400;
	return ResetEULATOSAcceptDates_Parms.ReturnValue;
}

struct APBUserInterface_ToggleProvingGroundsChallengesUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleProvingGroundsChallengesUI()
{
	static UFieldFunc* pFnToggleProvingGroundsChallengesUI = NULL;
	if(!pFnToggleProvingGroundsChallengesUI)
		pFnToggleProvingGroundsChallengesUI = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleProvingGroundsChallengesUI");

	APBUserInterface_ToggleProvingGroundsChallengesUI_Parms ToggleProvingGroundsChallengesUI_Parms;
	pFnToggleProvingGroundsChallengesUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleProvingGroundsChallengesUI,NULL,&ToggleProvingGroundsChallengesUI_Parms,NULL);
	pFnToggleProvingGroundsChallengesUI->FunctionFlags |= 0x400;
	return ToggleProvingGroundsChallengesUI_Parms.ReturnValue;
}

struct APBUserInterface_OpenBrowser_Parms
{
	struct FString                                     sUrl;                                             		// 0x000000 (0x000C)              
	struct FString                                     sBrowserTitle;                                    		// 0x00000C (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::OpenBrowser(struct FString sUrl,struct FString sBrowserTitle)
{
	static UFieldFunc* pFnOpenBrowser = NULL;
	if(!pFnOpenBrowser)
		pFnOpenBrowser = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.OpenBrowser");

	APBUserInterface_OpenBrowser_Parms OpenBrowser_Parms;
	memcpy(&OpenBrowser_Parms.sUrl,&sUrl,0xC);
	memcpy(&OpenBrowser_Parms.sBrowserTitle,&sBrowserTitle,0xC);
	pFnOpenBrowser->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenBrowser,NULL,&OpenBrowser_Parms,NULL);
	pFnOpenBrowser->FunctionFlags |= 0x400;
	return OpenBrowser_Parms.ReturnValue;
}

struct APBUserInterface_ToggleScoreboard_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::ToggleScoreboard()
{
	static UFieldFunc* pFnToggleScoreboard = NULL;
	if(!pFnToggleScoreboard)
		pFnToggleScoreboard = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.ToggleScoreboard");

	APBUserInterface_ToggleScoreboard_Parms ToggleScoreboard_Parms;
	pFnToggleScoreboard->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleScoreboard,NULL,&ToggleScoreboard_Parms,NULL);
	pFnToggleScoreboard->FunctionFlags |= 0x400;
	return ToggleScoreboard_Parms.ReturnValue;
}

struct APBUserInterface_AddInGameQuestion_Parms
{
	struct FString                                     sText;                                            		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::AddInGameQuestion(struct FString sText)
{
	static UFieldFunc* pFnAddInGameQuestion = NULL;
	if(!pFnAddInGameQuestion)
		pFnAddInGameQuestion = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.AddInGameQuestion");

	APBUserInterface_AddInGameQuestion_Parms AddInGameQuestion_Parms;
	memcpy(&AddInGameQuestion_Parms.sText,&sText,0xC);
	pFnAddInGameQuestion->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddInGameQuestion,NULL,&AddInGameQuestion_Parms,NULL);
	pFnAddInGameQuestion->FunctionFlags |= 0x400;
	return AddInGameQuestion_Parms.ReturnValue;
}

struct APBUserInterface_TiledScreenShot_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::TiledScreenShot()
{
	static UFieldFunc* pFnTiledScreenShot = NULL;
	if(!pFnTiledScreenShot)
		pFnTiledScreenShot = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.TiledScreenShot");

	APBUserInterface_TiledScreenShot_Parms TiledScreenShot_Parms;
	pFnTiledScreenShot->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTiledScreenShot,NULL,&TiledScreenShot_Parms,NULL);
	pFnTiledScreenShot->FunctionFlags |= 0x400;
	return TiledScreenShot_Parms.ReturnValue;
}

struct APBUserInterface_PreviewMissionStage_Parms
{
	struct FString                                     sMissionTemplate;                                 		// 0x000000 (0x000C)              
	int                                                nStage;                                           		// 0x00000C (0x0004)              
	unsigned long                                      bOpposition : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
	struct FString                                     sFaction;                                         		// 0x000014 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

bool UcUIConsoleCommands::PreviewMissionStage(struct FString sMissionTemplate,int nStage,bool bOpposition,struct FString sFaction)
{
	static UFieldFunc* pFnPreviewMissionStage = NULL;
	if(!pFnPreviewMissionStage)
		pFnPreviewMissionStage = UObject::FindFunction("Function APBUserInterface.cUIConsoleCommands.PreviewMissionStage");

	APBUserInterface_PreviewMissionStage_Parms PreviewMissionStage_Parms;
	memcpy(&PreviewMissionStage_Parms.sMissionTemplate,&sMissionTemplate,0xC);
	PreviewMissionStage_Parms.nStage = nStage;
	PreviewMissionStage_Parms.bOpposition = bOpposition;
	memcpy(&PreviewMissionStage_Parms.sFaction,&sFaction,0xC);
	pFnPreviewMissionStage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPreviewMissionStage,NULL,&PreviewMissionStage_Parms,NULL);
	pFnPreviewMissionStage->FunctionFlags |= 0x400;
	return PreviewMissionStage_Parms.ReturnValue;
}

struct APBUserInterface_ReleaseAssets_Parms
{
};

void UcUIDataStore::ReleaseAssets()
{
	static UFieldFunc* pFnReleaseAssets = NULL;
	if(!pFnReleaseAssets)
		pFnReleaseAssets = UObject::FindFunction("Function APBUserInterface.cUIDataStore.ReleaseAssets");

	APBUserInterface_ReleaseAssets_Parms ReleaseAssets_Parms;
	pFnReleaseAssets->FunctionFlags |= ~0x400;
	ProcessEvent(pFnReleaseAssets,NULL,&ReleaseAssets_Parms,NULL);
	pFnReleaseAssets->FunctionFlags |= 0x400;
}

struct APBUserInterface_LoadAssets_Parms
{
};

void UcUIDataStore::LoadAssets()
{
	static UFieldFunc* pFnLoadAssets = NULL;
	if(!pFnLoadAssets)
		pFnLoadAssets = UObject::FindFunction("Function APBUserInterface.cUIDataStore.LoadAssets");

	APBUserInterface_LoadAssets_Parms LoadAssets_Parms;
	pFnLoadAssets->FunctionFlags |= ~0x400;
	ProcessEvent(pFnLoadAssets,NULL,&LoadAssets_Parms,NULL);
	pFnLoadAssets->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyGameSessionEnded_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore::NotifyGameSessionEnded()
{
	static UFieldFunc* pFnNotifyGameSessionEnded = NULL;
	if(!pFnNotifyGameSessionEnded)
		pFnNotifyGameSessionEnded = UObject::FindFunction("Function APBUserInterface.cUIDataStore.NotifyGameSessionEnded");

	APBUserInterface_NotifyGameSessionEnded_Parms NotifyGameSessionEnded_Parms;
	ProcessEvent(pFnNotifyGameSessionEnded,NULL,&NotifyGameSessionEnded_Parms,NULL);
	return NotifyGameSessionEnded_Parms.ReturnValue;
}

struct APBUserInterface_OnRawInputKey_Parms
{
	struct FInputEventParameters                       Input;                                            		// 0x000000 (0x0020)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

bool UcUIDataStore_CharacterMenu::OnRawInputKey(struct FInputEventParameters Input)
{
	static UFieldFunc* pFnOnRawInputKey = NULL;
	if(!pFnOnRawInputKey)
		pFnOnRawInputKey = UObject::FindFunction("Function APBUserInterface.cUIDataStore_CharacterMenu.OnRawInputKey");

	APBUserInterface_OnRawInputKey_Parms OnRawInputKey_Parms;
	memcpy(&OnRawInputKey_Parms.Input,&Input,0x20);
	pFnOnRawInputKey->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnRawInputKey,NULL,&OnRawInputKey_Parms,NULL);
	pFnOnRawInputKey->FunctionFlags |= 0x400;
	return OnRawInputKey_Parms.ReturnValue;
}

struct APBUserInterface_OnSelectionMade_Parms
{
	struct FString                                     sSelectedPath;                                    		// 0x000000 (0x000C)              
};

void UcUIDataStore_FileSelector::OnSelectionMade(struct FString sSelectedPath)
{
	static UFieldFunc* pFnOnSelectionMade = NULL;
	if(!pFnOnSelectionMade)
		pFnOnSelectionMade = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSelector.OnSelectionMade");

	APBUserInterface_OnSelectionMade_Parms OnSelectionMade_Parms;
	memcpy(&OnSelectionMade_Parms.sSelectedPath,&sSelectedPath,0xC);
	ProcessEvent(pFnOnSelectionMade,NULL,&OnSelectionMade_Parms,NULL);
}

struct APBUserInterface_OnSelectionDone_Parms
{
};

void UcUIDataStore_FileSelector::OnSelectionDone()
{
	static UFieldFunc* pFnOnSelectionDone = NULL;
	if(!pFnOnSelectionDone)
		pFnOnSelectionDone = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSelector.OnSelectionDone");

	APBUserInterface_OnSelectionDone_Parms OnSelectionDone_Parms;
	ProcessEvent(pFnOnSelectionDone,NULL,&OnSelectionDone_Parms,NULL);
}

struct APBUserInterface_OnSelectionCanceled_Parms
{
};

void UcUIDataStore_FileSelector::OnSelectionCanceled()
{
	static UFieldFunc* pFnOnSelectionCanceled = NULL;
	if(!pFnOnSelectionCanceled)
		pFnOnSelectionCanceled = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSelector.OnSelectionCanceled");

	APBUserInterface_OnSelectionCanceled_Parms OnSelectionCanceled_Parms;
	ProcessEvent(pFnOnSelectionCanceled,NULL,&OnSelectionCanceled_Parms,NULL);
}

struct APBUserInterface_BrowseToParentDirectory_Parms
{
};

void UcUIDataStore_FileSystem::BrowseToParentDirectory()
{
	static UFieldFunc* pFnBrowseToParentDirectory = NULL;
	if(!pFnBrowseToParentDirectory)
		pFnBrowseToParentDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToParentDirectory");

	APBUserInterface_BrowseToParentDirectory_Parms BrowseToParentDirectory_Parms;
	pFnBrowseToParentDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToParentDirectory,NULL,&BrowseToParentDirectory_Parms,NULL);
	pFnBrowseToParentDirectory->FunctionFlags |= 0x400;
}

struct APBUserInterface_BrowseToBaseDirectory_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore_FileSystem::BrowseToBaseDirectory()
{
	static UFieldFunc* pFnBrowseToBaseDirectory = NULL;
	if(!pFnBrowseToBaseDirectory)
		pFnBrowseToBaseDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToBaseDirectory");

	APBUserInterface_BrowseToBaseDirectory_Parms BrowseToBaseDirectory_Parms;
	pFnBrowseToBaseDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToBaseDirectory,NULL,&BrowseToBaseDirectory_Parms,NULL);
	pFnBrowseToBaseDirectory->FunctionFlags |= 0x400;
	return BrowseToBaseDirectory_Parms.ReturnValue;
}

struct APBUserInterface_BrowseToItemDirectory_Parms
{
	struct FUIFileSystem_File                          i_Item;                                           		// 0x000000 (0x0030)              
};

void UcUIDataStore_FileSystem::BrowseToItemDirectory(struct FUIFileSystem_File* i_Item)
{
	static UFieldFunc* pFnBrowseToItemDirectory = NULL;
	if(!pFnBrowseToItemDirectory)
		pFnBrowseToItemDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToItemDirectory");

	APBUserInterface_BrowseToItemDirectory_Parms BrowseToItemDirectory_Parms;
	pFnBrowseToItemDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToItemDirectory,NULL,&BrowseToItemDirectory_Parms,NULL);
	pFnBrowseToItemDirectory->FunctionFlags |= 0x400;
	if(i_Item)
		memcpy(i_Item,&BrowseToItemDirectory_Parms.i_Item,0x30);
}

struct APBUserInterface_BrowseToSpecialDirectory_Parms
{
	unsigned char                                      i_eDirectory;                                     		// 0x000000 (0x0001)              
};

void UcUIDataStore_FileSystem::BrowseToSpecialDirectory(unsigned char i_eDirectory)
{
	static UFieldFunc* pFnBrowseToSpecialDirectory = NULL;
	if(!pFnBrowseToSpecialDirectory)
		pFnBrowseToSpecialDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToSpecialDirectory");

	APBUserInterface_BrowseToSpecialDirectory_Parms BrowseToSpecialDirectory_Parms;
	BrowseToSpecialDirectory_Parms.i_eDirectory = i_eDirectory;
	pFnBrowseToSpecialDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToSpecialDirectory,NULL,&BrowseToSpecialDirectory_Parms,NULL);
	pFnBrowseToSpecialDirectory->FunctionFlags |= 0x400;
}

struct APBUserInterface_StartBrowsing_Parms
{
	unsigned long                                      i_bShowFiles : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
	struct FString                                     i_sNameFilter;                                    		// 0x000004 (0x000C)              
	unsigned long                                      i_bAllowMultipleResults : 1;                      		// 0x000010 (0x0004) [0x00000001] 
};

void UcUIDataStore_FileSystem::StartBrowsing(bool i_bShowFiles,struct FString i_sNameFilter,bool i_bAllowMultipleResults)
{
	static UFieldFunc* pFnStartBrowsing = NULL;
	if(!pFnStartBrowsing)
		pFnStartBrowsing = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.StartBrowsing");

	APBUserInterface_StartBrowsing_Parms StartBrowsing_Parms;
	StartBrowsing_Parms.i_bShowFiles = i_bShowFiles;
	memcpy(&StartBrowsing_Parms.i_sNameFilter,&i_sNameFilter,0xC);
	StartBrowsing_Parms.i_bAllowMultipleResults = i_bAllowMultipleResults;
	pFnStartBrowsing->FunctionFlags |= ~0x400;
	ProcessEvent(pFnStartBrowsing,NULL,&StartBrowsing_Parms,NULL);
	pFnStartBrowsing->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsInSelectableDirectory_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore_FileSystem::IsInSelectableDirectory()
{
	static UFieldFunc* pFnIsInSelectableDirectory = NULL;
	if(!pFnIsInSelectableDirectory)
		pFnIsInSelectableDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.IsInSelectableDirectory");

	APBUserInterface_IsInSelectableDirectory_Parms IsInSelectableDirectory_Parms;
	pFnIsInSelectableDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsInSelectableDirectory,NULL,&IsInSelectableDirectory_Parms,NULL);
	pFnIsInSelectableDirectory->FunctionFlags |= 0x400;
	return IsInSelectableDirectory_Parms.ReturnValue;
}

struct APBUserInterface_BrowseToDirectory_Parms
{
	struct FString                                     i_sPathName;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIDataStore_FileSystem::BrowseToDirectory(struct FString i_sPathName)
{
	static UFieldFunc* pFnBrowseToDirectory = NULL;
	if(!pFnBrowseToDirectory)
		pFnBrowseToDirectory = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToDirectory");

	APBUserInterface_BrowseToDirectory_Parms BrowseToDirectory_Parms;
	memcpy(&BrowseToDirectory_Parms.i_sPathName,&i_sPathName,0xC);
	pFnBrowseToDirectory->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToDirectory,NULL,&BrowseToDirectory_Parms,NULL);
	pFnBrowseToDirectory->FunctionFlags |= 0x400;
	return BrowseToDirectory_Parms.ReturnValue;
}

struct APBUserInterface_BrowseToItemDirectoryByID_Parms
{
	int                                                i_nID;                                            		// 0x000000 (0x0004)              
};

void UcUIDataStore_FileSystem::BrowseToItemDirectoryByID(int i_nID)
{
	static UFieldFunc* pFnBrowseToItemDirectoryByID = NULL;
	if(!pFnBrowseToItemDirectoryByID)
		pFnBrowseToItemDirectoryByID = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.BrowseToItemDirectoryByID");

	APBUserInterface_BrowseToItemDirectoryByID_Parms BrowseToItemDirectoryByID_Parms;
	BrowseToItemDirectoryByID_Parms.i_nID = i_nID;
	pFnBrowseToItemDirectoryByID->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBrowseToItemDirectoryByID,NULL,&BrowseToItemDirectoryByID_Parms,NULL);
	pFnBrowseToItemDirectoryByID->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetFallbackIconFor_Parms
{
	unsigned char                                      i_ItemType;                                       		// 0x000000 (0x0001)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUIDataStore_FileSystem::GetFallbackIconFor(unsigned char i_ItemType)
{
	static UFieldFunc* pFnGetFallbackIconFor = NULL;
	if(!pFnGetFallbackIconFor)
		pFnGetFallbackIconFor = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.GetFallbackIconFor");

	APBUserInterface_GetFallbackIconFor_Parms GetFallbackIconFor_Parms;
	GetFallbackIconFor_Parms.i_ItemType = i_ItemType;
	pFnGetFallbackIconFor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetFallbackIconFor,NULL,&GetFallbackIconFor_Parms,NULL);
	pFnGetFallbackIconFor->FunctionFlags |= 0x400;
	return GetFallbackIconFor_Parms.ReturnValue;
}

struct APBUserInterface_GetPathContent_Parms
{
	struct FString                                     i_sPathName;                                      		// 0x000000 (0x000C)              
	unsigned long                                      i_bShowFiles : 1;                                 		// 0x00000C (0x0004) [0x00000001] 
	struct FString                                     i_sFilter;                                        		// 0x000010 (0x000C)              
	TArray<struct FUIFileSystem_File>                  ReturnValue;                                      		// 0x00001C (0x000C)              
};

TArray<struct FUIFileSystem_File> UcUIDataStore_FileSystem::GetPathContent(struct FString i_sPathName,bool i_bShowFiles,struct FString i_sFilter)
{
	static UFieldFunc* pFnGetPathContent = NULL;
	if(!pFnGetPathContent)
		pFnGetPathContent = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.GetPathContent");

	APBUserInterface_GetPathContent_Parms GetPathContent_Parms;
	memcpy(&GetPathContent_Parms.i_sPathName,&i_sPathName,0xC);
	GetPathContent_Parms.i_bShowFiles = i_bShowFiles;
	memcpy(&GetPathContent_Parms.i_sFilter,&i_sFilter,0xC);
	pFnGetPathContent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetPathContent,NULL,&GetPathContent_Parms,NULL);
	pFnGetPathContent->FunctionFlags |= 0x400;
	return GetPathContent_Parms.ReturnValue;
}

struct APBUserInterface_GetIconFor_Parms
{
	unsigned char                                      i_ItemType;                                       		// 0x000000 (0x0001)              
	unsigned char                                      i_SpecialDirectory;                               		// 0x000001 (0x0001)              
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) ALIGNEMENT
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUIDataStore_FileSystem::GetIconFor(unsigned char i_ItemType,unsigned char i_SpecialDirectory)
{
	static UFieldFunc* pFnGetIconFor = NULL;
	if(!pFnGetIconFor)
		pFnGetIconFor = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.GetIconFor");

	APBUserInterface_GetIconFor_Parms GetIconFor_Parms;
	GetIconFor_Parms.i_ItemType = i_ItemType;
	GetIconFor_Parms.i_SpecialDirectory = i_SpecialDirectory;
	pFnGetIconFor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetIconFor,NULL,&GetIconFor_Parms,NULL);
	pFnGetIconFor->FunctionFlags |= 0x400;
	return GetIconFor_Parms.ReturnValue;
}

struct APBUserInterface_EndBrowsing_Parms
{
};

void UcUIDataStore_FileSystem::EndBrowsing()
{
	static UFieldFunc* pFnEndBrowsing = NULL;
	if(!pFnEndBrowsing)
		pFnEndBrowsing = UObject::FindFunction("Function APBUserInterface.cUIDataStore_FileSystem.EndBrowsing");

	APBUserInterface_EndBrowsing_Parms EndBrowsing_Parms;
	pFnEndBrowsing->FunctionFlags |= ~0x400;
	ProcessEvent(pFnEndBrowsing,NULL,&EndBrowsing_Parms,NULL);
	pFnEndBrowsing->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnListDataChanged_Parms
{
};

void UcUIDataStore_Fnd_GroupFinder::OnListDataChanged()
{
	static UFieldFunc* pFnOnListDataChanged = NULL;
	if(!pFnOnListDataChanged)
		pFnOnListDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.OnListDataChanged");

	APBUserInterface_OnListDataChanged_Parms OnListDataChanged_Parms;
	pFnOnListDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnListDataChanged,NULL,&OnListDataChanged_Parms,NULL);
	pFnOnListDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetCurrentPage_Parms
{
	int                                                nPage;                                            		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Fnd_GroupFinder::SetCurrentPage(int nPage)
{
	static UFieldFunc* pFnSetCurrentPage = NULL;
	if(!pFnSetCurrentPage)
		pFnSetCurrentPage = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.SetCurrentPage");

	APBUserInterface_SetCurrentPage_Parms SetCurrentPage_Parms;
	SetCurrentPage_Parms.nPage = nPage;
	pFnSetCurrentPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCurrentPage,NULL,&SetCurrentPage_Parms,NULL);
	pFnSetCurrentPage->FunctionFlags |= 0x400;
	return SetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_GetTotalPages_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIDataStore_Fnd_GroupFinder::GetTotalPages()
{
	static UFieldFunc* pFnGetTotalPages = NULL;
	if(!pFnGetTotalPages)
		pFnGetTotalPages = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.GetTotalPages");

	APBUserInterface_GetTotalPages_Parms GetTotalPages_Parms;
	pFnGetTotalPages->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTotalPages,NULL,&GetTotalPages_Parms,NULL);
	pFnGetTotalPages->FunctionFlags |= 0x400;
	return GetTotalPages_Parms.ReturnValue;
}

struct APBUserInterface_SetOrdering_Parms
{
	struct FName                                       Ordering;                                         		// 0x000000 (0x0008)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Fnd_GroupFinder::SetOrdering(struct FName Ordering)
{
	static UFieldFunc* pFnSetOrdering = NULL;
	if(!pFnSetOrdering)
		pFnSetOrdering = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.SetOrdering");

	APBUserInterface_SetOrdering_Parms SetOrdering_Parms;
	memcpy(&SetOrdering_Parms.Ordering,&Ordering,0x8);
	pFnSetOrdering->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOrdering,NULL,&SetOrdering_Parms,NULL);
	pFnSetOrdering->FunctionFlags |= 0x400;
	return SetOrdering_Parms.ReturnValue;
}

struct APBUserInterface_GetCurrentPage_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIDataStore_Fnd_GroupFinder::GetCurrentPage()
{
	static UFieldFunc* pFnGetCurrentPage = NULL;
	if(!pFnGetCurrentPage)
		pFnGetCurrentPage = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.GetCurrentPage");

	APBUserInterface_GetCurrentPage_Parms GetCurrentPage_Parms;
	pFnGetCurrentPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentPage,NULL,&GetCurrentPage_Parms,NULL);
	pFnGetCurrentPage->FunctionFlags |= 0x400;
	return GetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_OnLocalEntryDataChanged_Parms
{
};

void UcUIDataStore_Fnd_GroupFinder::OnLocalEntryDataChanged()
{
	static UFieldFunc* pFnOnLocalEntryDataChanged = NULL;
	if(!pFnOnLocalEntryDataChanged)
		pFnOnLocalEntryDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupFinder.OnLocalEntryDataChanged");

	APBUserInterface_OnLocalEntryDataChanged_Parms OnLocalEntryDataChanged_Parms;
	pFnOnLocalEntryDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnLocalEntryDataChanged,NULL,&OnLocalEntryDataChanged_Parms,NULL);
	pFnOnLocalEntryDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetSelectedGroup_Parms
{
	int                                                nGroupUID;                                        		// 0x000000 (0x0004)              
};

void UcUIDataStore_Fnd_GroupInfo::SetSelectedGroup(int nGroupUID)
{
	static UFieldFunc* pFnSetSelectedGroup = NULL;
	if(!pFnSetSelectedGroup)
		pFnSetSelectedGroup = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupInfo.SetSelectedGroup");

	APBUserInterface_SetSelectedGroup_Parms SetSelectedGroup_Parms;
	SetSelectedGroup_Parms.nGroupUID = nGroupUID;
	pFnSetSelectedGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetSelectedGroup,NULL,&SetSelectedGroup_Parms,NULL);
	pFnSetSelectedGroup->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDataChanged_Parms
{
};

void UcUIDataStore_Fnd_GroupInfo::OnDataChanged()
{
	static UFieldFunc* pFnOnDataChanged = NULL;
	if(!pFnOnDataChanged)
		pFnOnDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_GroupInfo.OnDataChanged");

	APBUserInterface_OnDataChanged_Parms OnDataChanged_Parms;
	pFnOnDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDataChanged,NULL,&OnDataChanged_Parms,NULL);
	pFnOnDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetTotalPages_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIDataStore_Fnd_TeamFinder::GetTotalPages()
{
	static UFieldFunc* pFnGetTotalPages = NULL;
	if(!pFnGetTotalPages)
		pFnGetTotalPages = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.GetTotalPages");

	APBUserInterface_GetTotalPages_Parms GetTotalPages_Parms;
	pFnGetTotalPages->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTotalPages,NULL,&GetTotalPages_Parms,NULL);
	pFnGetTotalPages->FunctionFlags |= 0x400;
	return GetTotalPages_Parms.ReturnValue;
}

struct APBUserInterface_SetCurrentPage_Parms
{
	int                                                nPage;                                            		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Fnd_TeamFinder::SetCurrentPage(int nPage)
{
	static UFieldFunc* pFnSetCurrentPage = NULL;
	if(!pFnSetCurrentPage)
		pFnSetCurrentPage = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.SetCurrentPage");

	APBUserInterface_SetCurrentPage_Parms SetCurrentPage_Parms;
	SetCurrentPage_Parms.nPage = nPage;
	pFnSetCurrentPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCurrentPage,NULL,&SetCurrentPage_Parms,NULL);
	pFnSetCurrentPage->FunctionFlags |= 0x400;
	return SetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_GetCurrentPage_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UcUIDataStore_Fnd_TeamFinder::GetCurrentPage()
{
	static UFieldFunc* pFnGetCurrentPage = NULL;
	if(!pFnGetCurrentPage)
		pFnGetCurrentPage = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.GetCurrentPage");

	APBUserInterface_GetCurrentPage_Parms GetCurrentPage_Parms;
	pFnGetCurrentPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentPage,NULL,&GetCurrentPage_Parms,NULL);
	pFnGetCurrentPage->FunctionFlags |= 0x400;
	return GetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_OnLocalEntryDataChanged_Parms
{
};

void UcUIDataStore_Fnd_TeamFinder::OnLocalEntryDataChanged()
{
	static UFieldFunc* pFnOnLocalEntryDataChanged = NULL;
	if(!pFnOnLocalEntryDataChanged)
		pFnOnLocalEntryDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.OnLocalEntryDataChanged");

	APBUserInterface_OnLocalEntryDataChanged_Parms OnLocalEntryDataChanged_Parms;
	pFnOnLocalEntryDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnLocalEntryDataChanged,NULL,&OnLocalEntryDataChanged_Parms,NULL);
	pFnOnLocalEntryDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnListDataChanged_Parms
{
};

void UcUIDataStore_Fnd_TeamFinder::OnListDataChanged()
{
	static UFieldFunc* pFnOnListDataChanged = NULL;
	if(!pFnOnListDataChanged)
		pFnOnListDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.OnListDataChanged");

	APBUserInterface_OnListDataChanged_Parms OnListDataChanged_Parms;
	pFnOnListDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnListDataChanged,NULL,&OnListDataChanged_Parms,NULL);
	pFnOnListDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetOrdering_Parms
{
	struct FName                                       Ordering;                                         		// 0x000000 (0x0008)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Fnd_TeamFinder::SetOrdering(struct FName Ordering)
{
	static UFieldFunc* pFnSetOrdering = NULL;
	if(!pFnSetOrdering)
		pFnSetOrdering = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamFinder.SetOrdering");

	APBUserInterface_SetOrdering_Parms SetOrdering_Parms;
	memcpy(&SetOrdering_Parms.Ordering,&Ordering,0x8);
	pFnSetOrdering->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOrdering,NULL,&SetOrdering_Parms,NULL);
	pFnSetOrdering->FunctionFlags |= 0x400;
	return SetOrdering_Parms.ReturnValue;
}

struct APBUserInterface_SetSelectedTeam_Parms
{
	int                                                nTeamUID;                                         		// 0x000000 (0x0004)              
};

void UcUIDataStore_Fnd_TeamInfo::SetSelectedTeam(int nTeamUID)
{
	static UFieldFunc* pFnSetSelectedTeam = NULL;
	if(!pFnSetSelectedTeam)
		pFnSetSelectedTeam = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamInfo.SetSelectedTeam");

	APBUserInterface_SetSelectedTeam_Parms SetSelectedTeam_Parms;
	SetSelectedTeam_Parms.nTeamUID = nTeamUID;
	pFnSetSelectedTeam->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetSelectedTeam,NULL,&SetSelectedTeam_Parms,NULL);
	pFnSetSelectedTeam->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDataChanged_Parms
{
};

void UcUIDataStore_Fnd_TeamInfo::OnDataChanged()
{
	static UFieldFunc* pFnOnDataChanged = NULL;
	if(!pFnOnDataChanged)
		pFnOnDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Fnd_TeamInfo.OnDataChanged");

	APBUserInterface_OnDataChanged_Parms OnDataChanged_Parms;
	pFnOnDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDataChanged,NULL,&OnDataChanged_Parms,NULL);
	pFnOnDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyGameSessionEnded_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore_HUD_Mission::NotifyGameSessionEnded()
{
	static UFieldFunc* pFnNotifyGameSessionEnded = NULL;
	if(!pFnNotifyGameSessionEnded)
		pFnNotifyGameSessionEnded = UObject::FindFunction("Function APBUserInterface.cUIDataStore_HUD_Mission.NotifyGameSessionEnded");

	APBUserInterface_NotifyGameSessionEnded_Parms NotifyGameSessionEnded_Parms;
	ProcessEvent(pFnNotifyGameSessionEnded,NULL,&NotifyGameSessionEnded_Parms,NULL);
	return NotifyGameSessionEnded_Parms.ReturnValue;
}

struct APBUserInterface_UnregisterCallbacks_Parms
{
};

void UcUIDataStore_Soc_IgnoreList::UnregisterCallbacks()
{
	static UFieldFunc* pFnUnregisterCallbacks = NULL;
	if(!pFnUnregisterCallbacks)
		pFnUnregisterCallbacks = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_IgnoreList.UnregisterCallbacks");

	APBUserInterface_UnregisterCallbacks_Parms UnregisterCallbacks_Parms;
	pFnUnregisterCallbacks->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUnregisterCallbacks,NULL,&UnregisterCallbacks_Parms,NULL);
	pFnUnregisterCallbacks->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnDataChanged_Parms
{
};

void UcUIDataStore_Soc_IgnoreList::OnDataChanged()
{
	static UFieldFunc* pFnOnDataChanged = NULL;
	if(!pFnOnDataChanged)
		pFnOnDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_IgnoreList.OnDataChanged");

	APBUserInterface_OnDataChanged_Parms OnDataChanged_Parms;
	pFnOnDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDataChanged,NULL,&OnDataChanged_Parms,NULL);
	pFnOnDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyGameSessionEnded_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Soc_IgnoreList::NotifyGameSessionEnded()
{
	static UFieldFunc* pFnNotifyGameSessionEnded = NULL;
	if(!pFnNotifyGameSessionEnded)
		pFnNotifyGameSessionEnded = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_IgnoreList.NotifyGameSessionEnded");

	APBUserInterface_NotifyGameSessionEnded_Parms NotifyGameSessionEnded_Parms;
	ProcessEvent(pFnNotifyGameSessionEnded,NULL,&NotifyGameSessionEnded_Parms,NULL);
	return NotifyGameSessionEnded_Parms.ReturnValue;
}

struct APBUserInterface_OnDataChanged_Parms
{
};

void UcUIDataStore_Soc_RecentSideList::OnDataChanged()
{
	static UFieldFunc* pFnOnDataChanged = NULL;
	if(!pFnOnDataChanged)
		pFnOnDataChanged = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_RecentSideList.OnDataChanged");

	APBUserInterface_OnDataChanged_Parms OnDataChanged_Parms;
	pFnOnDataChanged->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnDataChanged,NULL,&OnDataChanged_Parms,NULL);
	pFnOnDataChanged->FunctionFlags |= 0x400;
}

struct APBUserInterface_UnregisterCallbacks_Parms
{
};

void UcUIDataStore_Soc_RecentSideList::UnregisterCallbacks()
{
	static UFieldFunc* pFnUnregisterCallbacks = NULL;
	if(!pFnUnregisterCallbacks)
		pFnUnregisterCallbacks = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_RecentSideList.UnregisterCallbacks");

	APBUserInterface_UnregisterCallbacks_Parms UnregisterCallbacks_Parms;
	pFnUnregisterCallbacks->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUnregisterCallbacks,NULL,&UnregisterCallbacks_Parms,NULL);
	pFnUnregisterCallbacks->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnMissionEnded_Parms
{
};

void UcUIDataStore_Soc_RecentSideList::OnMissionEnded()
{
	static UFieldFunc* pFnOnMissionEnded = NULL;
	if(!pFnOnMissionEnded)
		pFnOnMissionEnded = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_RecentSideList.OnMissionEnded");

	APBUserInterface_OnMissionEnded_Parms OnMissionEnded_Parms;
	pFnOnMissionEnded->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnMissionEnded,NULL,&OnMissionEnded_Parms,NULL);
	pFnOnMissionEnded->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyGameSessionEnded_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIDataStore_Soc_RecentSideList::NotifyGameSessionEnded()
{
	static UFieldFunc* pFnNotifyGameSessionEnded = NULL;
	if(!pFnNotifyGameSessionEnded)
		pFnNotifyGameSessionEnded = UObject::FindFunction("Function APBUserInterface.cUIDataStore_Soc_RecentSideList.NotifyGameSessionEnded");

	APBUserInterface_NotifyGameSessionEnded_Parms NotifyGameSessionEnded_Parms;
	ProcessEvent(pFnNotifyGameSessionEnded,NULL,&NotifyGameSessionEnded_Parms,NULL);
	return NotifyGameSessionEnded_Parms.ReturnValue;
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIEvent_DistrictMapInput::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIEvent_DistrictMapInput.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIEvent_SliderCanvasBindChanged::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIEvent_SliderCanvasBindChanged.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIEvent_SymbolCanvasInput::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIEvent_SymbolCanvasInput.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_IsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIEvent_ThumbnailListItemChanged::IsValidUISequenceObject(class UUIScreenObject* TargetObject)
{
	static UFieldFunc* pFnIsValidUISequenceObject = NULL;
	if(!pFnIsValidUISequenceObject)
		pFnIsValidUISequenceObject = UObject::FindFunction("Function APBUserInterface.cUIEvent_ThumbnailListItemChanged.IsValidUISequenceObject");

	APBUserInterface_IsValidUISequenceObject_Parms IsValidUISequenceObject_Parms;
	IsValidUISequenceObject_Parms.TargetObject = TargetObject;
	ProcessEvent(pFnIsValidUISequenceObject,NULL,&IsValidUISequenceObject_Parms,NULL);
	return IsValidUISequenceObject_Parms.ReturnValue;
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIFourWay::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUIFourWay.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_OnSetFourWayPosition_Parms
{
	class UcUIAction_SetFourWayPosition*               Action;                                           		// 0x000000 (0x0004)              
};

void UcUIFourWay::OnSetFourWayPosition(class UcUIAction_SetFourWayPosition* Action)
{
	static UFieldFunc* pFnOnSetFourWayPosition = NULL;
	if(!pFnOnSetFourWayPosition)
		pFnOnSetFourWayPosition = UObject::FindFunction("Function APBUserInterface.cUIFourWay.OnSetFourWayPosition");

	APBUserInterface_OnSetFourWayPosition_Parms OnSetFourWayPosition_Parms;
	OnSetFourWayPosition_Parms.Action = Action;
	ProcessEvent(pFnOnSetFourWayPosition,NULL,&OnSetFourWayPosition_Parms,NULL);
}

struct APBUserInterface_OnSetImage_Parms
{
	class UcUIAction_SetImage*                         Action;                                           		// 0x000000 (0x0004)              
};

void UcUIFourWay::OnSetImage(class UcUIAction_SetImage* Action)
{
	static UFieldFunc* pFnOnSetImage = NULL;
	if(!pFnOnSetImage)
		pFnOnSetImage = UObject::FindFunction("Function APBUserInterface.cUIFourWay.OnSetImage");

	APBUserInterface_OnSetImage_Parms OnSetImage_Parms;
	OnSetImage_Parms.Action = Action;
	ProcessEvent(pFnOnSetImage,NULL,&OnSetImage_Parms,NULL);
}

struct APBUserInterface_ListUIScenes_Parms
{
};

void UcUIGameSceneClient::ListUIScenes()
{
	static UFieldFunc* pFnListUIScenes = NULL;
	if(!pFnListUIScenes)
		pFnListUIScenes = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.ListUIScenes");

	APBUserInterface_ListUIScenes_Parms ListUIScenes_Parms;
	pFnListUIScenes->FunctionFlags |= ~0x400;
	ProcessEvent(pFnListUIScenes,NULL,&ListUIScenes_Parms,NULL);
	pFnListUIScenes->FunctionFlags |= 0x400;
}

struct APBUserInterface_EnableCustomisationStudio_Parms
{
	unsigned long                                      bEnable : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIGameSceneClient::EnableCustomisationStudio(bool bEnable)
{
	static UFieldFunc* pFnEnableCustomisationStudio = NULL;
	if(!pFnEnableCustomisationStudio)
		pFnEnableCustomisationStudio = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.EnableCustomisationStudio");

	APBUserInterface_EnableCustomisationStudio_Parms EnableCustomisationStudio_Parms;
	EnableCustomisationStudio_Parms.bEnable = bEnable;
	pFnEnableCustomisationStudio->FunctionFlags |= ~0x400;
	ProcessEvent(pFnEnableCustomisationStudio,NULL,&EnableCustomisationStudio_Parms,NULL);
	pFnEnableCustomisationStudio->FunctionFlags |= 0x400;
}

struct APBUserInterface_DisplayTutorialFlag_Parms
{
};

void UcUIGameSceneClient::DisplayTutorialFlag()
{
	static UFieldFunc* pFnDisplayTutorialFlag = NULL;
	if(!pFnDisplayTutorialFlag)
		pFnDisplayTutorialFlag = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.DisplayTutorialFlag");

	APBUserInterface_DisplayTutorialFlag_Parms DisplayTutorialFlag_Parms;
	pFnDisplayTutorialFlag->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDisplayTutorialFlag,NULL,&DisplayTutorialFlag_Parms,NULL);
	pFnDisplayTutorialFlag->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenClothingCustomisation_Parms
{
};

void UcUIGameSceneClient::OpenClothingCustomisation()
{
	static UFieldFunc* pFnOpenClothingCustomisation = NULL;
	if(!pFnOpenClothingCustomisation)
		pFnOpenClothingCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenClothingCustomisation");

	APBUserInterface_OpenClothingCustomisation_Parms OpenClothingCustomisation_Parms;
	pFnOpenClothingCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenClothingCustomisation,NULL,&OpenClothingCustomisation_Parms,NULL);
	pFnOpenClothingCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsCustomisationStudioOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::IsCustomisationStudioOpen()
{
	static UFieldFunc* pFnIsCustomisationStudioOpen = NULL;
	if(!pFnIsCustomisationStudioOpen)
		pFnIsCustomisationStudioOpen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.IsCustomisationStudioOpen");

	APBUserInterface_IsCustomisationStudioOpen_Parms IsCustomisationStudioOpen_Parms;
	pFnIsCustomisationStudioOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsCustomisationStudioOpen,NULL,&IsCustomisationStudioOpen_Parms,NULL);
	pFnIsCustomisationStudioOpen->FunctionFlags |= 0x400;
	return IsCustomisationStudioOpen_Parms.ReturnValue;
}

struct APBUserInterface_MS_RemoveDSPPage_Parms
{
	int                                                nPageIndex;                                       		// 0x000000 (0x0004)              
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000004 (0x0004)              
};

void UcUIGameSceneClient::MS_RemoveDSPPage(int nPageIndex)
{
	static UFieldFunc* pFnMS_RemoveDSPPage = NULL;
	if(!pFnMS_RemoveDSPPage)
		pFnMS_RemoveDSPPage = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_RemoveDSPPage");

	APBUserInterface_MS_RemoveDSPPage_Parms MS_RemoveDSPPage_Parms;
	MS_RemoveDSPPage_Parms.nPageIndex = nPageIndex;
	ProcessEvent(pFnMS_RemoveDSPPage,NULL,&MS_RemoveDSPPage_Parms,NULL);
}

struct APBUserInterface_MS_RecreateDSPPages_Parms
{
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::MS_RecreateDSPPages()
{
	static UFieldFunc* pFnMS_RecreateDSPPages = NULL;
	if(!pFnMS_RecreateDSPPages)
		pFnMS_RecreateDSPPages = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_RecreateDSPPages");

	APBUserInterface_MS_RecreateDSPPages_Parms MS_RecreateDSPPages_Parms;
	ProcessEvent(pFnMS_RecreateDSPPages,NULL,&MS_RecreateDSPPages_Parms,NULL);
}

struct APBUserInterface_IsSymbolEditorOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::IsSymbolEditorOpen()
{
	static UFieldFunc* pFnIsSymbolEditorOpen = NULL;
	if(!pFnIsSymbolEditorOpen)
		pFnIsSymbolEditorOpen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.IsSymbolEditorOpen");

	APBUserInterface_IsSymbolEditorOpen_Parms IsSymbolEditorOpen_Parms;
	pFnIsSymbolEditorOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsSymbolEditorOpen,NULL,&IsSymbolEditorOpen_Parms,NULL);
	pFnIsSymbolEditorOpen->FunctionFlags |= 0x400;
	return IsSymbolEditorOpen_Parms.ReturnValue;
}

struct APBUserInterface_OnClosedMarketplaceUI_Parms
{
};

void UcUIGameSceneClient::OnClosedMarketplaceUI()
{
	static UFieldFunc* pFnOnClosedMarketplaceUI = NULL;
	if(!pFnOnClosedMarketplaceUI)
		pFnOnClosedMarketplaceUI = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OnClosedMarketplaceUI");

	APBUserInterface_OnClosedMarketplaceUI_Parms OnClosedMarketplaceUI_Parms;
	pFnOnClosedMarketplaceUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnClosedMarketplaceUI,NULL,&OnClosedMarketplaceUI_Parms,NULL);
	pFnOnClosedMarketplaceUI->FunctionFlags |= 0x400;
}

struct APBUserInterface_IsMainSceneOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::IsMainSceneOpen()
{
	static UFieldFunc* pFnIsMainSceneOpen = NULL;
	if(!pFnIsMainSceneOpen)
		pFnIsMainSceneOpen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.IsMainSceneOpen");

	APBUserInterface_IsMainSceneOpen_Parms IsMainSceneOpen_Parms;
	pFnIsMainSceneOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsMainSceneOpen,NULL,&IsMainSceneOpen_Parms,NULL);
	pFnIsMainSceneOpen->FunctionFlags |= 0x400;
	return IsMainSceneOpen_Parms.ReturnValue;
}

struct APBUserInterface_MS_RemoveDSPAtIndex_Parms
{
	int                                                nPageIndex;                                       		// 0x000000 (0x0004)              
	int                                                nDspIndex;                                        		// 0x000004 (0x0004)              
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000008 (0x0004)              
};

void UcUIGameSceneClient::MS_RemoveDSPAtIndex(int nPageIndex,int nDspIndex)
{
	static UFieldFunc* pFnMS_RemoveDSPAtIndex = NULL;
	if(!pFnMS_RemoveDSPAtIndex)
		pFnMS_RemoveDSPAtIndex = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_RemoveDSPAtIndex");

	APBUserInterface_MS_RemoveDSPAtIndex_Parms MS_RemoveDSPAtIndex_Parms;
	MS_RemoveDSPAtIndex_Parms.nPageIndex = nPageIndex;
	MS_RemoveDSPAtIndex_Parms.nDspIndex = nDspIndex;
	ProcessEvent(pFnMS_RemoveDSPAtIndex,NULL,&MS_RemoveDSPAtIndex_Parms,NULL);
}

struct APBUserInterface_MS_RemoveAllDSPs_Parms
{
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::MS_RemoveAllDSPs()
{
	static UFieldFunc* pFnMS_RemoveAllDSPs = NULL;
	if(!pFnMS_RemoveAllDSPs)
		pFnMS_RemoveAllDSPs = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_RemoveAllDSPs");

	APBUserInterface_MS_RemoveAllDSPs_Parms MS_RemoveAllDSPs_Parms;
	ProcessEvent(pFnMS_RemoveAllDSPs,NULL,&MS_RemoveAllDSPs_Parms,NULL);
}

struct APBUserInterface_OpenMusicEditor_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::OpenMusicEditor()
{
	static UFieldFunc* pFnOpenMusicEditor = NULL;
	if(!pFnOpenMusicEditor)
		pFnOpenMusicEditor = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenMusicEditor");

	APBUserInterface_OpenMusicEditor_Parms OpenMusicEditor_Parms;
	pFnOpenMusicEditor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenMusicEditor,NULL,&OpenMusicEditor_Parms,NULL);
	pFnOpenMusicEditor->FunctionFlags |= 0x400;
	return OpenMusicEditor_Parms.ReturnValue;
}

struct APBUserInterface_CloseMainScene_Parms
{
	class UUIScene*                                    pScene;                                           		// 0x000000 (0x0004)              
	struct FString                                     sCloseEvent;                                      		// 0x000004 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::CloseMainScene(class UUIScene* pScene,struct FString sCloseEvent)
{
	static UFieldFunc* pFnCloseMainScene = NULL;
	if(!pFnCloseMainScene)
		pFnCloseMainScene = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.CloseMainScene");

	APBUserInterface_CloseMainScene_Parms CloseMainScene_Parms;
	CloseMainScene_Parms.pScene = pScene;
	memcpy(&CloseMainScene_Parms.sCloseEvent,&sCloseEvent,0xC);
	pFnCloseMainScene->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseMainScene,NULL,&CloseMainScene_Parms,NULL);
	pFnCloseMainScene->FunctionFlags |= 0x400;
	return CloseMainScene_Parms.ReturnValue;
}

struct APBUserInterface_FireEvent_Parms
{
	struct FString                                     sEventName;                                       		// 0x000000 (0x000C)              
	unsigned long                                      bActivateImmediately : 1;                         		// 0x00000C (0x0004) [0x00000001] 
	TArray<float>                                      FloatParams;                                      		// 0x000010 (0x000C)              
	TArray<struct FString>                             StringParams;                                     		// 0x00001C (0x000C)              
	TArray<class UObject*>                             ObjectParams;                                     		// 0x000028 (0x000C)              
	class UUIScreenObject*                             TargetUIObject;                                   		// 0x000034 (0x0004)              
	class UObject*                                     Activator;                                        		// 0x000038 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00003C (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::FireEvent(struct FString sEventName,bool bActivateImmediately,TArray<float> FloatParams,TArray<struct FString> StringParams,TArray<class UObject*> ObjectParams,class UUIScreenObject* TargetUIObject,class UObject* Activator)
{
	static UFieldFunc* pFnFireEvent = NULL;
	if(!pFnFireEvent)
		pFnFireEvent = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.FireEvent");

	APBUserInterface_FireEvent_Parms FireEvent_Parms;
	memcpy(&FireEvent_Parms.sEventName,&sEventName,0xC);
	FireEvent_Parms.bActivateImmediately = bActivateImmediately;
	memcpy(&FireEvent_Parms.FloatParams,&FloatParams,0xC);
	memcpy(&FireEvent_Parms.StringParams,&StringParams,0xC);
	memcpy(&FireEvent_Parms.ObjectParams,&ObjectParams,0xC);
	FireEvent_Parms.TargetUIObject = TargetUIObject;
	FireEvent_Parms.Activator = Activator;
	pFnFireEvent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFireEvent,NULL,&FireEvent_Parms,NULL);
	pFnFireEvent->FunctionFlags |= 0x400;
	return FireEvent_Parms.ReturnValue;
}

struct APBUserInterface_EnableUIPostProcess_Parms
{
	unsigned long                                      bEnable : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIGameSceneClient::EnableUIPostProcess(bool bEnable)
{
	static UFieldFunc* pFnEnableUIPostProcess = NULL;
	if(!pFnEnableUIPostProcess)
		pFnEnableUIPostProcess = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.EnableUIPostProcess");

	APBUserInterface_EnableUIPostProcess_Parms EnableUIPostProcess_Parms;
	EnableUIPostProcess_Parms.bEnable = bEnable;
	pFnEnableUIPostProcess->FunctionFlags |= ~0x400;
	ProcessEvent(pFnEnableUIPostProcess,NULL,&EnableUIPostProcess_Parms,NULL);
	pFnEnableUIPostProcess->FunctionFlags |= 0x400;
}

struct APBUserInterface_GenericDelegate_Parms
{
};

void UcUIGameSceneClient::GenericDelegate()
{
	static UFieldFunc* pFnGenericDelegate = NULL;
	if(!pFnGenericDelegate)
		pFnGenericDelegate = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.GenericDelegate");

	APBUserInterface_GenericDelegate_Parms GenericDelegate_Parms;
	ProcessEvent(pFnGenericDelegate,NULL,&GenericDelegate_Parms,NULL);
}

struct APBUserInterface_NotifyGameSessionEndedNative_Parms
{
};

void UcUIGameSceneClient::NotifyGameSessionEndedNative()
{
	static UFieldFunc* pFnNotifyGameSessionEndedNative = NULL;
	if(!pFnNotifyGameSessionEndedNative)
		pFnNotifyGameSessionEndedNative = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.NotifyGameSessionEndedNative");

	APBUserInterface_NotifyGameSessionEndedNative_Parms NotifyGameSessionEndedNative_Parms;
	pFnNotifyGameSessionEndedNative->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyGameSessionEndedNative,NULL,&NotifyGameSessionEndedNative_Parms,NULL);
	pFnNotifyGameSessionEndedNative->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyGameSessionEnded_Parms
{
};

void UcUIGameSceneClient::NotifyGameSessionEnded()
{
	static UFieldFunc* pFnNotifyGameSessionEnded = NULL;
	if(!pFnNotifyGameSessionEnded)
		pFnNotifyGameSessionEnded = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.NotifyGameSessionEnded");

	APBUserInterface_NotifyGameSessionEnded_Parms NotifyGameSessionEnded_Parms;
	ProcessEvent(pFnNotifyGameSessionEnded,NULL,&NotifyGameSessionEnded_Parms,NULL);
}

struct APBUserInterface_DebugOpenSymbolEditor_Parms
{
};

void UcUIGameSceneClient::DebugOpenSymbolEditor()
{
	static UFieldFunc* pFnDebugOpenSymbolEditor = NULL;
	if(!pFnDebugOpenSymbolEditor)
		pFnDebugOpenSymbolEditor = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.DebugOpenSymbolEditor");

	APBUserInterface_DebugOpenSymbolEditor_Parms DebugOpenSymbolEditor_Parms;
	pFnDebugOpenSymbolEditor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDebugOpenSymbolEditor,NULL,&DebugOpenSymbolEditor_Parms,NULL);
	pFnDebugOpenSymbolEditor->FunctionFlags |= 0x400;
}

struct APBUserInterface_ShowEditorLoadingScreen_Parms
{
};

void UcUIGameSceneClient::ShowEditorLoadingScreen()
{
	static UFieldFunc* pFnShowEditorLoadingScreen = NULL;
	if(!pFnShowEditorLoadingScreen)
		pFnShowEditorLoadingScreen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.ShowEditorLoadingScreen");

	APBUserInterface_ShowEditorLoadingScreen_Parms ShowEditorLoadingScreen_Parms;
	pFnShowEditorLoadingScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnShowEditorLoadingScreen,NULL,&ShowEditorLoadingScreen_Parms,NULL);
	pFnShowEditorLoadingScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetTutorialFlag_Parms
{
	unsigned long                                      bEnable : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIGameSceneClient::SetTutorialFlag(bool bEnable)
{
	static UFieldFunc* pFnSetTutorialFlag = NULL;
	if(!pFnSetTutorialFlag)
		pFnSetTutorialFlag = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetTutorialFlag");

	APBUserInterface_SetTutorialFlag_Parms SetTutorialFlag_Parms;
	SetTutorialFlag_Parms.bEnable = bEnable;
	pFnSetTutorialFlag->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTutorialFlag,NULL,&SetTutorialFlag_Parms,NULL);
	pFnSetTutorialFlag->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenMarketplaceUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::OpenMarketplaceUI()
{
	static UFieldFunc* pFnOpenMarketplaceUI = NULL;
	if(!pFnOpenMarketplaceUI)
		pFnOpenMarketplaceUI = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenMarketplaceUI");

	APBUserInterface_OpenMarketplaceUI_Parms OpenMarketplaceUI_Parms;
	pFnOpenMarketplaceUI->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenMarketplaceUI,NULL,&OpenMarketplaceUI_Parms,NULL);
	pFnOpenMarketplaceUI->FunctionFlags |= 0x400;
	return OpenMarketplaceUI_Parms.ReturnValue;
}

struct APBUserInterface_MS_SetDSPDebugShowBounds_Parms
{
	unsigned long                                      bEnabled : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000004 (0x0004)              
};

void UcUIGameSceneClient::MS_SetDSPDebugShowBounds(bool bEnabled)
{
	static UFieldFunc* pFnMS_SetDSPDebugShowBounds = NULL;
	if(!pFnMS_SetDSPDebugShowBounds)
		pFnMS_SetDSPDebugShowBounds = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_SetDSPDebugShowBounds");

	APBUserInterface_MS_SetDSPDebugShowBounds_Parms MS_SetDSPDebugShowBounds_Parms;
	MS_SetDSPDebugShowBounds_Parms.bEnabled = bEnabled;
	ProcessEvent(pFnMS_SetDSPDebugShowBounds,NULL,&MS_SetDSPDebugShowBounds_Parms,NULL);
}

struct APBUserInterface_SetMaxLum_Parms
{
	float                                              fMaxLum;                                          		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::SetMaxLum(float fMaxLum)
{
	static UFieldFunc* pFnSetMaxLum = NULL;
	if(!pFnSetMaxLum)
		pFnSetMaxLum = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetMaxLum");

	APBUserInterface_SetMaxLum_Parms SetMaxLum_Parms;
	SetMaxLum_Parms.fMaxLum = fMaxLum;
	pFnSetMaxLum->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetMaxLum,NULL,&SetMaxLum_Parms,NULL);
	pFnSetMaxLum->FunctionFlags |= 0x400;
}

struct APBUserInterface_MS_GetDSPContainer_Parms
{
	class UcUIMSDSPContainer*                          ReturnValue;                                      		// 0x000000 (0x0004)              
	//class UUIScene*                                    Scene;                                            		// 0x000004 (0x0004)              
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000008 (0x0004)              
};

class UcUIMSDSPContainer* UcUIGameSceneClient::MS_GetDSPContainer()
{
	static UFieldFunc* pFnMS_GetDSPContainer = NULL;
	if(!pFnMS_GetDSPContainer)
		pFnMS_GetDSPContainer = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_GetDSPContainer");

	APBUserInterface_MS_GetDSPContainer_Parms MS_GetDSPContainer_Parms;
	ProcessEvent(pFnMS_GetDSPContainer,NULL,&MS_GetDSPContainer_Parms,NULL);
	return MS_GetDSPContainer_Parms.ReturnValue;
}

struct APBUserInterface_OpenCharacterCustomisation_Parms
{
};

void UcUIGameSceneClient::OpenCharacterCustomisation()
{
	static UFieldFunc* pFnOpenCharacterCustomisation = NULL;
	if(!pFnOpenCharacterCustomisation)
		pFnOpenCharacterCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenCharacterCustomisation");

	APBUserInterface_OpenCharacterCustomisation_Parms OpenCharacterCustomisation_Parms;
	pFnOpenCharacterCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenCharacterCustomisation,NULL,&OpenCharacterCustomisation_Parms,NULL);
	pFnOpenCharacterCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_MS_AddDSP_Parms
{
	int                                                nPageIndex;                                       		// 0x000000 (0x0004)              
	int                                                nDspType;                                         		// 0x000004 (0x0004)              
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000008 (0x0004)              
};

void UcUIGameSceneClient::MS_AddDSP(int nPageIndex,int nDspType)
{
	static UFieldFunc* pFnMS_AddDSP = NULL;
	if(!pFnMS_AddDSP)
		pFnMS_AddDSP = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_AddDSP");

	APBUserInterface_MS_AddDSP_Parms MS_AddDSP_Parms;
	MS_AddDSP_Parms.nPageIndex = nPageIndex;
	MS_AddDSP_Parms.nDspType = nDspType;
	ProcessEvent(pFnMS_AddDSP,NULL,&MS_AddDSP_Parms,NULL);
}

struct APBUserInterface_ToggleMainScene_Parms
{
	class UUIScene*                                    pScene;                                           		// 0x000000 (0x0004)              
	struct FString                                     sCloseEvent;                                      		// 0x000004 (0x000C)              
	unsigned long                                      bCloseExistingScenes : 1;                         		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000014 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::ToggleMainScene(class UUIScene* pScene,struct FString sCloseEvent,bool bCloseExistingScenes)
{
	static UFieldFunc* pFnToggleMainScene = NULL;
	if(!pFnToggleMainScene)
		pFnToggleMainScene = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.ToggleMainScene");

	APBUserInterface_ToggleMainScene_Parms ToggleMainScene_Parms;
	ToggleMainScene_Parms.pScene = pScene;
	memcpy(&ToggleMainScene_Parms.sCloseEvent,&sCloseEvent,0xC);
	ToggleMainScene_Parms.bCloseExistingScenes = bCloseExistingScenes;
	pFnToggleMainScene->FunctionFlags |= ~0x400;
	ProcessEvent(pFnToggleMainScene,NULL,&ToggleMainScene_Parms,NULL);
	pFnToggleMainScene->FunctionFlags |= 0x400;
	return ToggleMainScene_Parms.ReturnValue;
}

struct APBUserInterface_OpenSymbolEditor_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::OpenSymbolEditor()
{
	static UFieldFunc* pFnOpenSymbolEditor = NULL;
	if(!pFnOpenSymbolEditor)
		pFnOpenSymbolEditor = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenSymbolEditor");

	APBUserInterface_OpenSymbolEditor_Parms OpenSymbolEditor_Parms;
	pFnOpenSymbolEditor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenSymbolEditor,NULL,&OpenSymbolEditor_Parms,NULL);
	pFnOpenSymbolEditor->FunctionFlags |= 0x400;
	return OpenSymbolEditor_Parms.ReturnValue;
}

struct APBUserInterface_OpenCharacterCreation_Parms
{
};

void UcUIGameSceneClient::OpenCharacterCreation()
{
	static UFieldFunc* pFnOpenCharacterCreation = NULL;
	if(!pFnOpenCharacterCreation)
		pFnOpenCharacterCreation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenCharacterCreation");

	APBUserInterface_OpenCharacterCreation_Parms OpenCharacterCreation_Parms;
	pFnOpenCharacterCreation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenCharacterCreation,NULL,&OpenCharacterCreation_Parms,NULL);
	pFnOpenCharacterCreation->FunctionFlags |= 0x400;
}

struct APBUserInterface_MS_ShowDSPPage_Parms
{
	int                                                nPageIndex;                                       		// 0x000000 (0x0004)              
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000004 (0x0004)              
};

void UcUIGameSceneClient::MS_ShowDSPPage(int nPageIndex)
{
	static UFieldFunc* pFnMS_ShowDSPPage = NULL;
	if(!pFnMS_ShowDSPPage)
		pFnMS_ShowDSPPage = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_ShowDSPPage");

	APBUserInterface_MS_ShowDSPPage_Parms MS_ShowDSPPage_Parms;
	MS_ShowDSPPage_Parms.nPageIndex = nPageIndex;
	ProcessEvent(pFnMS_ShowDSPPage,NULL,&MS_ShowDSPPage_Parms,NULL);
}

struct APBUserInterface_SetMinSat_Parms
{
	float                                              fMinSat;                                          		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::SetMinSat(float fMinSat)
{
	static UFieldFunc* pFnSetMinSat = NULL;
	if(!pFnSetMinSat)
		pFnSetMinSat = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetMinSat");

	APBUserInterface_SetMinSat_Parms SetMinSat_Parms;
	SetMinSat_Parms.fMinSat = fMinSat;
	pFnSetMinSat->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetMinSat,NULL,&SetMinSat_Parms,NULL);
	pFnSetMinSat->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetCurrentCustomisationStudioType_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x000000 (0x0001)              
};

unsigned char UcUIGameSceneClient::GetCurrentCustomisationStudioType()
{
	static UFieldFunc* pFnGetCurrentCustomisationStudioType = NULL;
	if(!pFnGetCurrentCustomisationStudioType)
		pFnGetCurrentCustomisationStudioType = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.GetCurrentCustomisationStudioType");

	APBUserInterface_GetCurrentCustomisationStudioType_Parms GetCurrentCustomisationStudioType_Parms;
	pFnGetCurrentCustomisationStudioType->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentCustomisationStudioType,NULL,&GetCurrentCustomisationStudioType_Parms,NULL);
	pFnGetCurrentCustomisationStudioType->FunctionFlags |= 0x400;
	return GetCurrentCustomisationStudioType_Parms.ReturnValue;
}

struct APBUserInterface_SetMaxSat_Parms
{
	float                                              fMaxSat;                                          		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::SetMaxSat(float fMaxSat)
{
	static UFieldFunc* pFnSetMaxSat = NULL;
	if(!pFnSetMaxSat)
		pFnSetMaxSat = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetMaxSat");

	APBUserInterface_SetMaxSat_Parms SetMaxSat_Parms;
	SetMaxSat_Parms.fMaxSat = fMaxSat;
	pFnSetMaxSat->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetMaxSat,NULL,&SetMaxSat_Parms,NULL);
	pFnSetMaxSat->FunctionFlags |= 0x400;
}

struct APBUserInterface_DebugOpenVehicleCustomisation_Parms
{
};

void UcUIGameSceneClient::DebugOpenVehicleCustomisation()
{
	static UFieldFunc* pFnDebugOpenVehicleCustomisation = NULL;
	if(!pFnDebugOpenVehicleCustomisation)
		pFnDebugOpenVehicleCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.DebugOpenVehicleCustomisation");

	APBUserInterface_DebugOpenVehicleCustomisation_Parms DebugOpenVehicleCustomisation_Parms;
	pFnDebugOpenVehicleCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDebugOpenVehicleCustomisation,NULL,&DebugOpenVehicleCustomisation_Parms,NULL);
	pFnDebugOpenVehicleCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_OpenMainScene_Parms
{
	class UUIScene*                                    pScene;                                           		// 0x000000 (0x0004)              
	unsigned long                                      bCloseExistingScenes : 1;                         		// 0x000004 (0x0004) [0x00000001] 
	class UUIScene*                                    pOpenedScene;                                     		// 0x000008 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::OpenMainScene(class UUIScene* pScene,bool bCloseExistingScenes,class UUIScene** pOpenedScene)
{
	static UFieldFunc* pFnOpenMainScene = NULL;
	if(!pFnOpenMainScene)
		pFnOpenMainScene = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenMainScene");

	APBUserInterface_OpenMainScene_Parms OpenMainScene_Parms;
	OpenMainScene_Parms.pScene = pScene;
	OpenMainScene_Parms.bCloseExistingScenes = bCloseExistingScenes;
	pFnOpenMainScene->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenMainScene,NULL,&OpenMainScene_Parms,NULL);
	pFnOpenMainScene->FunctionFlags |= 0x400;
	if(pOpenedScene)
		*pOpenedScene = OpenMainScene_Parms.pOpenedScene;
	return OpenMainScene_Parms.ReturnValue;
}

struct APBUserInterface_SetSymbolEditorOpen_Parms
{
	unsigned long                                      bOpen : 1;                                        		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIGameSceneClient::SetSymbolEditorOpen(bool bOpen)
{
	static UFieldFunc* pFnSetSymbolEditorOpen = NULL;
	if(!pFnSetSymbolEditorOpen)
		pFnSetSymbolEditorOpen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetSymbolEditorOpen");

	APBUserInterface_SetSymbolEditorOpen_Parms SetSymbolEditorOpen_Parms;
	SetSymbolEditorOpen_Parms.bOpen = bOpen;
	pFnSetSymbolEditorOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetSymbolEditorOpen,NULL,&SetSymbolEditorOpen_Parms,NULL);
	pFnSetSymbolEditorOpen->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnMusicStudioClosed_Parms
{
};

void UcUIGameSceneClient::OnMusicStudioClosed()
{
	static UFieldFunc* pFnOnMusicStudioClosed = NULL;
	if(!pFnOnMusicStudioClosed)
		pFnOnMusicStudioClosed = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OnMusicStudioClosed");

	APBUserInterface_OnMusicStudioClosed_Parms OnMusicStudioClosed_Parms;
	pFnOnMusicStudioClosed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnMusicStudioClosed,NULL,&OnMusicStudioClosed_Parms,NULL);
	pFnOnMusicStudioClosed->FunctionFlags |= 0x400;
}

struct APBUserInterface_MS_AddDSPPage_Parms
{
	//class UcUIMSDSPContainer*                          dspcontainer;                                     		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::MS_AddDSPPage()
{
	static UFieldFunc* pFnMS_AddDSPPage = NULL;
	if(!pFnMS_AddDSPPage)
		pFnMS_AddDSPPage = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_AddDSPPage");

	APBUserInterface_MS_AddDSPPage_Parms MS_AddDSPPage_Parms;
	ProcessEvent(pFnMS_AddDSPPage,NULL,&MS_AddDSPPage_Parms,NULL);
}

struct APBUserInterface_IsInventorySceneOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::IsInventorySceneOpen()
{
	static UFieldFunc* pFnIsInventorySceneOpen = NULL;
	if(!pFnIsInventorySceneOpen)
		pFnIsInventorySceneOpen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.IsInventorySceneOpen");

	APBUserInterface_IsInventorySceneOpen_Parms IsInventorySceneOpen_Parms;
	pFnIsInventorySceneOpen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsInventorySceneOpen,NULL,&IsInventorySceneOpen_Parms,NULL);
	pFnIsInventorySceneOpen->FunctionFlags |= 0x400;
	return IsInventorySceneOpen_Parms.ReturnValue;
}

struct APBUserInterface_CloseAllMainScenes_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::CloseAllMainScenes()
{
	static UFieldFunc* pFnCloseAllMainScenes = NULL;
	if(!pFnCloseAllMainScenes)
		pFnCloseAllMainScenes = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.CloseAllMainScenes");

	APBUserInterface_CloseAllMainScenes_Parms CloseAllMainScenes_Parms;
	pFnCloseAllMainScenes->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseAllMainScenes,NULL,&CloseAllMainScenes_Parms,NULL);
	pFnCloseAllMainScenes->FunctionFlags |= 0x400;
	return CloseAllMainScenes_Parms.ReturnValue;
}

struct APBUserInterface_OpenVehicleCustomisation_Parms
{
};

void UcUIGameSceneClient::OpenVehicleCustomisation()
{
	static UFieldFunc* pFnOpenVehicleCustomisation = NULL;
	if(!pFnOpenVehicleCustomisation)
		pFnOpenVehicleCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.OpenVehicleCustomisation");

	APBUserInterface_OpenVehicleCustomisation_Parms OpenVehicleCustomisation_Parms;
	pFnOpenVehicleCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOpenVehicleCustomisation,NULL,&OpenVehicleCustomisation_Parms,NULL);
	pFnOpenVehicleCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_MS_FindScene_Parms
{
	struct FName                                       SceneName;                                        		// 0x000000 (0x0008)              
	class UUIScene*                                    ReturnValue;                                      		// 0x000008 (0x0004)              
	//int                                                I;                                                		// 0x00000C (0x0004)              
};

class UUIScene* UcUIGameSceneClient::MS_FindScene(struct FName SceneName)
{
	static UFieldFunc* pFnMS_FindScene = NULL;
	if(!pFnMS_FindScene)
		pFnMS_FindScene = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.MS_FindScene");

	APBUserInterface_MS_FindScene_Parms MS_FindScene_Parms;
	memcpy(&MS_FindScene_Parms.SceneName,&SceneName,0x8);
	ProcessEvent(pFnMS_FindScene,NULL,&MS_FindScene_Parms,NULL);
	return MS_FindScene_Parms.ReturnValue;
}

struct APBUserInterface_DebugOpenClothingCustomisation_Parms
{
};

void UcUIGameSceneClient::DebugOpenClothingCustomisation()
{
	static UFieldFunc* pFnDebugOpenClothingCustomisation = NULL;
	if(!pFnDebugOpenClothingCustomisation)
		pFnDebugOpenClothingCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.DebugOpenClothingCustomisation");

	APBUserInterface_DebugOpenClothingCustomisation_Parms DebugOpenClothingCustomisation_Parms;
	pFnDebugOpenClothingCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDebugOpenClothingCustomisation,NULL,&DebugOpenClothingCustomisation_Parms,NULL);
	pFnDebugOpenClothingCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetMinLum_Parms
{
	float                                              fMinLum;                                          		// 0x000000 (0x0004)              
};

void UcUIGameSceneClient::SetMinLum(float fMinLum)
{
	static UFieldFunc* pFnSetMinLum = NULL;
	if(!pFnSetMinLum)
		pFnSetMinLum = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.SetMinLum");

	APBUserInterface_SetMinLum_Parms SetMinLum_Parms;
	SetMinLum_Parms.fMinLum = fMinLum;
	pFnSetMinLum->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetMinLum,NULL,&SetMinLum_Parms,NULL);
	pFnSetMinLum->FunctionFlags |= 0x400;
}

struct APBUserInterface_HideEditorLoadingScreen_Parms
{
};

void UcUIGameSceneClient::HideEditorLoadingScreen()
{
	static UFieldFunc* pFnHideEditorLoadingScreen = NULL;
	if(!pFnHideEditorLoadingScreen)
		pFnHideEditorLoadingScreen = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.HideEditorLoadingScreen");

	APBUserInterface_HideEditorLoadingScreen_Parms HideEditorLoadingScreen_Parms;
	pFnHideEditorLoadingScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnHideEditorLoadingScreen,NULL,&HideEditorLoadingScreen_Parms,NULL);
	pFnHideEditorLoadingScreen->FunctionFlags |= 0x400;
}

struct APBUserInterface_DebugOpenCharacterCustomisation_Parms
{
};

void UcUIGameSceneClient::DebugOpenCharacterCustomisation()
{
	static UFieldFunc* pFnDebugOpenCharacterCustomisation = NULL;
	if(!pFnDebugOpenCharacterCustomisation)
		pFnDebugOpenCharacterCustomisation = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.DebugOpenCharacterCustomisation");

	APBUserInterface_DebugOpenCharacterCustomisation_Parms DebugOpenCharacterCustomisation_Parms;
	pFnDebugOpenCharacterCustomisation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDebugOpenCharacterCustomisation,NULL,&DebugOpenCharacterCustomisation_Parms,NULL);
	pFnDebugOpenCharacterCustomisation->FunctionFlags |= 0x400;
}

struct APBUserInterface_CloseEscapeMenu_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::CloseEscapeMenu()
{
	static UFieldFunc* pFnCloseEscapeMenu = NULL;
	if(!pFnCloseEscapeMenu)
		pFnCloseEscapeMenu = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.CloseEscapeMenu");

	APBUserInterface_CloseEscapeMenu_Parms CloseEscapeMenu_Parms;
	pFnCloseEscapeMenu->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCloseEscapeMenu,NULL,&CloseEscapeMenu_Parms,NULL);
	pFnCloseEscapeMenu->FunctionFlags |= 0x400;
	return CloseEscapeMenu_Parms.ReturnValue;
}

struct APBUserInterface_IsMainSceneVisible_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIGameSceneClient::IsMainSceneVisible()
{
	static UFieldFunc* pFnIsMainSceneVisible = NULL;
	if(!pFnIsMainSceneVisible)
		pFnIsMainSceneVisible = UObject::FindFunction("Function APBUserInterface.cUIGameSceneClient.IsMainSceneVisible");

	APBUserInterface_IsMainSceneVisible_Parms IsMainSceneVisible_Parms;
	pFnIsMainSceneVisible->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsMainSceneVisible,NULL,&IsMainSceneVisible_Parms,NULL);
	pFnIsMainSceneVisible->FunctionFlags |= 0x400;
	return IsMainSceneVisible_Parms.ReturnValue;
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUILabelButton::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUILabelButton.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUILabelButton::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUILabelButton.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUILabelButton::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUILabelButton.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUILabelButton::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUILabelButton.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUILabelButton::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUILabelButton.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_ClearBoundDataStores_Parms
{
};

void UcUILabelButton::ClearBoundDataStores()
{
	static UFieldFunc* pFnClearBoundDataStores = NULL;
	if(!pFnClearBoundDataStores)
		pFnClearBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUILabelButton.ClearBoundDataStores");

	APBUserInterface_ClearBoundDataStores_Parms ClearBoundDataStores_Parms;
	pFnClearBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearBoundDataStores,NULL,&ClearBoundDataStores_Parms,NULL);
	pFnClearBoundDataStores->FunctionFlags |= 0x400;
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUILabelButton::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUILabelButton.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_ScrollVerticalPage_Parms
{
	int                                                nPageChange;                                      		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUILargeList::ScrollVerticalPage(int nPageChange)
{
	static UFieldFunc* pFnScrollVerticalPage = NULL;
	if(!pFnScrollVerticalPage)
		pFnScrollVerticalPage = UObject::FindFunction("Function APBUserInterface.cUILargeList.ScrollVerticalPage");

	APBUserInterface_ScrollVerticalPage_Parms ScrollVerticalPage_Parms;
	ScrollVerticalPage_Parms.nPageChange = nPageChange;
	pFnScrollVerticalPage->FunctionFlags |= ~0x400;
	ProcessEvent(pFnScrollVerticalPage,NULL,&ScrollVerticalPage_Parms,NULL);
	pFnScrollVerticalPage->FunctionFlags |= 0x400;
	return ScrollVerticalPage_Parms.ReturnValue;
}

struct APBUserInterface_ScrollVertical_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x000000 (0x0004)              
	float                                              PositionChange;                                   		// 0x000004 (0x0004)              
	unsigned long                                      bPositionMaxed : 1;                               		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUILargeList::ScrollVertical(class UUIScrollbar* Sender,float PositionChange,bool bPositionMaxed)
{
	static UFieldFunc* pFnScrollVertical = NULL;
	if(!pFnScrollVertical)
		pFnScrollVertical = UObject::FindFunction("Function APBUserInterface.cUILargeList.ScrollVertical");

	APBUserInterface_ScrollVertical_Parms ScrollVertical_Parms;
	ScrollVertical_Parms.Sender = Sender;
	ScrollVertical_Parms.PositionChange = PositionChange;
	ScrollVertical_Parms.bPositionMaxed = bPositionMaxed;
	pFnScrollVertical->FunctionFlags |= ~0x400;
	ProcessEvent(pFnScrollVertical,NULL,&ScrollVertical_Parms,NULL);
	pFnScrollVertical->FunctionFlags |= 0x400;
	return ScrollVertical_Parms.ReturnValue;
}

struct APBUserInterface_GetSelectedItems_Parms
{
	TArray<int>                                        ReturnValue;                                      		// 0x000000 (0x000C)              
};

TArray<int> UcUILargeList::GetSelectedItems()
{
	static UFieldFunc* pFnGetSelectedItems = NULL;
	if(!pFnGetSelectedItems)
		pFnGetSelectedItems = UObject::FindFunction("Function APBUserInterface.cUILargeList.GetSelectedItems");

	APBUserInterface_GetSelectedItems_Parms GetSelectedItems_Parms;
	pFnGetSelectedItems->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetSelectedItems,NULL,&GetSelectedItems_Parms,NULL);
	pFnGetSelectedItems->FunctionFlags |= 0x400;
	return GetSelectedItems_Parms.ReturnValue;
}

struct APBUserInterface_ClickedScrollZone_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x000000 (0x0004)              
	float                                              PositionPerc;                                     		// 0x000004 (0x0004)              
	int                                                PlayerIndex;                                      		// 0x000008 (0x0004)              
};

void UcUILargeList::ClickedScrollZone(class UUIScrollbar* Sender,float PositionPerc,int PlayerIndex)
{
	static UFieldFunc* pFnClickedScrollZone = NULL;
	if(!pFnClickedScrollZone)
		pFnClickedScrollZone = UObject::FindFunction("Function APBUserInterface.cUILargeList.ClickedScrollZone");

	APBUserInterface_ClickedScrollZone_Parms ClickedScrollZone_Parms;
	ClickedScrollZone_Parms.Sender = Sender;
	ClickedScrollZone_Parms.PositionPerc = PositionPerc;
	ClickedScrollZone_Parms.PlayerIndex = PlayerIndex;
	pFnClickedScrollZone->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClickedScrollZone,NULL,&ClickedScrollZone_Parms,NULL);
	pFnClickedScrollZone->FunctionFlags |= 0x400;
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIRangeLabel::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIRangeLabel.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_FadeInactive_Parms
{
};

void UcUIScene_BaseScene::FadeInactive()
{
	static UFieldFunc* pFnFadeInactive = NULL;
	if(!pFnFadeInactive)
		pFnFadeInactive = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.FadeInactive");

	APBUserInterface_FadeInactive_Parms FadeInactive_Parms;
	ProcessEvent(pFnFadeInactive,NULL,&FadeInactive_Parms,NULL);
}

struct APBUserInterface_UpdateData_Parms
{
};

void UcUIScene_BaseScene::UpdateData()
{
	static UFieldFunc* pFnUpdateData = NULL;
	if(!pFnUpdateData)
		pFnUpdateData = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.UpdateData");

	APBUserInterface_UpdateData_Parms UpdateData_Parms;
	ProcessEvent(pFnUpdateData,NULL,&UpdateData_Parms,NULL);
}

struct APBUserInterface_FadeCompleted_Parms
{
};

void UcUIScene_BaseScene::FadeCompleted()
{
	static UFieldFunc* pFnFadeCompleted = NULL;
	if(!pFnFadeCompleted)
		pFnFadeCompleted = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.FadeCompleted");

	APBUserInterface_FadeCompleted_Parms FadeCompleted_Parms;
	ProcessEvent(pFnFadeCompleted,NULL,&FadeCompleted_Parms,NULL);
}

struct APBUserInterface_OnFadeOutCompleted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UcUIScene_BaseScene::OnFadeOutCompleted()
{
	static UFieldFunc* pFnOnFadeOutCompleted = NULL;
	if(!pFnOnFadeOutCompleted)
		pFnOnFadeOutCompleted = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.OnFadeOutCompleted");

	APBUserInterface_OnFadeOutCompleted_Parms OnFadeOutCompleted_Parms;
	ProcessEvent(pFnOnFadeOutCompleted,NULL,&OnFadeOutCompleted_Parms,NULL);
	return OnFadeOutCompleted_Parms.ReturnValue;
}

struct APBUserInterface_InitScene_Parms
{
};

void UcUIScene_BaseScene::InitScene()
{
	static UFieldFunc* pFnInitScene = NULL;
	if(!pFnInitScene)
		pFnInitScene = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.InitScene");

	APBUserInterface_InitScene_Parms InitScene_Parms;
	ProcessEvent(pFnInitScene,NULL,&InitScene_Parms,NULL);
}

struct APBUserInterface_FadeIn_Parms
{
	unsigned long                                      bResetOpacity : 1;                                		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIScene_BaseScene::FadeIn(bool bResetOpacity)
{
	static UFieldFunc* pFnFadeIn = NULL;
	if(!pFnFadeIn)
		pFnFadeIn = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.FadeIn");

	APBUserInterface_FadeIn_Parms FadeIn_Parms;
	FadeIn_Parms.bResetOpacity = bResetOpacity;
	ProcessEvent(pFnFadeIn,NULL,&FadeIn_Parms,NULL);
}

struct APBUserInterface_FadeScene_Parms
{
	float                                              gTargetOpacity;                                   		// 0x000000 (0x0004)              
	float                                              gTargetTime;                                      		// 0x000004 (0x0004)              
};

void UcUIScene_BaseScene::FadeScene(float gTargetOpacity,float gTargetTime)
{
	static UFieldFunc* pFnFadeScene = NULL;
	if(!pFnFadeScene)
		pFnFadeScene = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.FadeScene");

	APBUserInterface_FadeScene_Parms FadeScene_Parms;
	FadeScene_Parms.gTargetOpacity = gTargetOpacity;
	FadeScene_Parms.gTargetTime = gTargetTime;
	ProcessEvent(pFnFadeScene,NULL,&FadeScene_Parms,NULL);
}

struct APBUserInterface_FadeOut_Parms
{
};

void UcUIScene_BaseScene::FadeOut()
{
	static UFieldFunc* pFnFadeOut = NULL;
	if(!pFnFadeOut)
		pFnFadeOut = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.FadeOut");

	APBUserInterface_FadeOut_Parms FadeOut_Parms;
	ProcessEvent(pFnFadeOut,NULL,&FadeOut_Parms,NULL);
}

struct APBUserInterface_UpdateScene_Parms
{
	float                                              fDeltaTime;                                       		// 0x000000 (0x0004)              
	class AWorldInfo*                                  WorldInfo;                                        		// 0x000004 (0x0004)              
};

void UcUIScene_BaseScene::UpdateScene(float fDeltaTime,class AWorldInfo* WorldInfo)
{
	static UFieldFunc* pFnUpdateScene = NULL;
	if(!pFnUpdateScene)
		pFnUpdateScene = UObject::FindFunction("Function APBUserInterface.cUIScene_BaseScene.UpdateScene");

	APBUserInterface_UpdateScene_Parms UpdateScene_Parms;
	UpdateScene_Parms.fDeltaTime = fDeltaTime;
	UpdateScene_Parms.WorldInfo = WorldInfo;
	ProcessEvent(pFnUpdateScene,NULL,&UpdateScene_Parms,NULL);
}

struct APBUserInterface_SetCancelDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabelButton*                              btn;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetCancelDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetCancelDatastoreBinding = NULL;
	if(!pFnSetCancelDatastoreBinding)
		pFnSetCancelDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetCancelDatastoreBinding");

	APBUserInterface_SetCancelDatastoreBinding_Parms SetCancelDatastoreBinding_Parms;
	memcpy(&SetCancelDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetCancelDatastoreBinding,NULL,&SetCancelDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_ShowDisableOption_Parms
{
	//class UUIPanel*                                    Panel;                                            		// 0x000000 (0x0004)              
};

void UcUIScene_MessageBox::ShowDisableOption()
{
	static UFieldFunc* pFnShowDisableOption = NULL;
	if(!pFnShowDisableOption)
		pFnShowDisableOption = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.ShowDisableOption");

	APBUserInterface_ShowDisableOption_Parms ShowDisableOption_Parms;
	ProcessEvent(pFnShowDisableOption,NULL,&ShowDisableOption_Parms,NULL);
}

struct APBUserInterface_OnBoxClosed_Parms
{
	unsigned char                                      eResult;                                          		// 0x000000 (0x0001)              
	unsigned long                                      bDisableOption : 1;                               		// 0x000004 (0x0004) [0x00000001] 
};

void UcUIScene_MessageBox::OnBoxClosed(unsigned char eResult,bool bDisableOption)
{
	static UFieldFunc* pFnOnBoxClosed = NULL;
	if(!pFnOnBoxClosed)
		pFnOnBoxClosed = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.OnBoxClosed");

	APBUserInterface_OnBoxClosed_Parms OnBoxClosed_Parms;
	OnBoxClosed_Parms.eResult = eResult;
	OnBoxClosed_Parms.bDisableOption = bDisableOption;
	ProcessEvent(pFnOnBoxClosed,NULL,&OnBoxClosed_Parms,NULL);
}

struct APBUserInterface_SetMessage_Parms
{
	struct FString                                     Message;                                          		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetMessage(struct FString Message)
{
	static UFieldFunc* pFnSetMessage = NULL;
	if(!pFnSetMessage)
		pFnSetMessage = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetMessage");

	APBUserInterface_SetMessage_Parms SetMessage_Parms;
	memcpy(&SetMessage_Parms.Message,&Message,0xC);
	ProcessEvent(pFnSetMessage,NULL,&SetMessage_Parms,NULL);
}

struct APBUserInterface_SetTitle_Parms
{
	struct FString                                     Title;                                            		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetTitle(struct FString Title)
{
	static UFieldFunc* pFnSetTitle = NULL;
	if(!pFnSetTitle)
		pFnSetTitle = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetTitle");

	APBUserInterface_SetTitle_Parms SetTitle_Parms;
	memcpy(&SetTitle_Parms.Title,&Title,0xC);
	ProcessEvent(pFnSetTitle,NULL,&SetTitle_Parms,NULL);
}

struct APBUserInterface_OnCloseMessageBox_Parms
{
	class UcUIAction_CloseMessageBox*                  Action;                                           		// 0x000000 (0x0004)              
	//unsigned char                                      eResult;                                          		// 0x000004 (0x0001)              
};

void UcUIScene_MessageBox::OnCloseMessageBox(class UcUIAction_CloseMessageBox* Action)
{
	static UFieldFunc* pFnOnCloseMessageBox = NULL;
	if(!pFnOnCloseMessageBox)
		pFnOnCloseMessageBox = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.OnCloseMessageBox");

	APBUserInterface_OnCloseMessageBox_Parms OnCloseMessageBox_Parms;
	OnCloseMessageBox_Parms.Action = Action;
	ProcessEvent(pFnOnCloseMessageBox,NULL,&OnCloseMessageBox_Parms,NULL);
}

struct APBUserInterface_SetMode_Parms
{
	unsigned char                                      eMessageBoxMode;                                  		// 0x000000 (0x0001)              
	//class UUIPanel*                                    ButtonPanel;                                      		// 0x000004 (0x0004)              
	//class UUIButton*                                   CloseButton;                                      		// 0x000008 (0x0004)              
};

void UcUIScene_MessageBox::SetMode(unsigned char eMessageBoxMode)
{
	static UFieldFunc* pFnSetMode = NULL;
	if(!pFnSetMode)
		pFnSetMode = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetMode");

	APBUserInterface_SetMode_Parms SetMode_Parms;
	SetMode_Parms.eMessageBoxMode = eMessageBoxMode;
	ProcessEvent(pFnSetMode,NULL,&SetMode_Parms,NULL);
}

struct APBUserInterface_SetOKYesDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabelButton*                              btn;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetOKYesDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetOKYesDatastoreBinding = NULL;
	if(!pFnSetOKYesDatastoreBinding)
		pFnSetOKYesDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetOKYesDatastoreBinding");

	APBUserInterface_SetOKYesDatastoreBinding_Parms SetOKYesDatastoreBinding_Parms;
	memcpy(&SetOKYesDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetOKYesDatastoreBinding,NULL,&SetOKYesDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIScene_MessageBox::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_SetNoDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabelButton*                              btn;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetNoDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetNoDatastoreBinding = NULL;
	if(!pFnSetNoDatastoreBinding)
		pFnSetNoDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetNoDatastoreBinding");

	APBUserInterface_SetNoDatastoreBinding_Parms SetNoDatastoreBinding_Parms;
	memcpy(&SetNoDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetNoDatastoreBinding,NULL,&SetNoDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_OnCloseMessageBoxNative_Parms
{
};

void UcUIScene_MessageBox::OnCloseMessageBoxNative()
{
	static UFieldFunc* pFnOnCloseMessageBoxNative = NULL;
	if(!pFnOnCloseMessageBoxNative)
		pFnOnCloseMessageBoxNative = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.OnCloseMessageBoxNative");

	APBUserInterface_OnCloseMessageBoxNative_Parms OnCloseMessageBoxNative_Parms;
	pFnOnCloseMessageBoxNative->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnCloseMessageBoxNative,NULL,&OnCloseMessageBoxNative_Parms,NULL);
	pFnOnCloseMessageBoxNative->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetDefaultCloseResult_Parms
{
	unsigned char                                      eMessageBoxResult;                                		// 0x000000 (0x0001)              
};

void UcUIScene_MessageBox::SetDefaultCloseResult(unsigned char eMessageBoxResult)
{
	static UFieldFunc* pFnSetDefaultCloseResult = NULL;
	if(!pFnSetDefaultCloseResult)
		pFnSetDefaultCloseResult = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetDefaultCloseResult");

	APBUserInterface_SetDefaultCloseResult_Parms SetDefaultCloseResult_Parms;
	SetDefaultCloseResult_Parms.eMessageBoxResult = eMessageBoxResult;
	ProcessEvent(pFnSetDefaultCloseResult,NULL,&SetDefaultCloseResult_Parms,NULL);
}

struct APBUserInterface_SetTitleDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetTitleDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetTitleDatastoreBinding = NULL;
	if(!pFnSetTitleDatastoreBinding)
		pFnSetTitleDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetTitleDatastoreBinding");

	APBUserInterface_SetTitleDatastoreBinding_Parms SetTitleDatastoreBinding_Parms;
	memcpy(&SetTitleDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetTitleDatastoreBinding,NULL,&SetTitleDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_SetMessageDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_MessageBox::SetMessageDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetMessageDatastoreBinding = NULL;
	if(!pFnSetMessageDatastoreBinding)
		pFnSetMessageDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_MessageBox.SetMessageDatastoreBinding");

	APBUserInterface_SetMessageDatastoreBinding_Parms SetMessageDatastoreBinding_Parms;
	memcpy(&SetMessageDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetMessageDatastoreBinding,NULL,&SetMessageDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_SetTitle_Parms
{
	struct FString                                     Title;                                            		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_TextEntry::SetTitle(struct FString Title)
{
	static UFieldFunc* pFnSetTitle = NULL;
	if(!pFnSetTitle)
		pFnSetTitle = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetTitle");

	APBUserInterface_SetTitle_Parms SetTitle_Parms;
	memcpy(&SetTitle_Parms.Title,&Title,0xC);
	ProcessEvent(pFnSetTitle,NULL,&SetTitle_Parms,NULL);
}

struct APBUserInterface_SetMessage_Parms
{
	struct FString                                     Message;                                          		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_TextEntry::SetMessage(struct FString Message)
{
	static UFieldFunc* pFnSetMessage = NULL;
	if(!pFnSetMessage)
		pFnSetMessage = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetMessage");

	APBUserInterface_SetMessage_Parms SetMessage_Parms;
	memcpy(&SetMessage_Parms.Message,&Message,0xC);
	ProcessEvent(pFnSetMessage,NULL,&SetMessage_Parms,NULL);
}

struct APBUserInterface_SetMessageDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_TextEntry::SetMessageDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetMessageDatastoreBinding = NULL;
	if(!pFnSetMessageDatastoreBinding)
		pFnSetMessageDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetMessageDatastoreBinding");

	APBUserInterface_SetMessageDatastoreBinding_Parms SetMessageDatastoreBinding_Parms;
	memcpy(&SetMessageDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetMessageDatastoreBinding,NULL,&SetMessageDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_SetEditBoxCharacterRestrictions_Parms
{
	unsigned char                                      eCharacterRestrictions;                           		// 0x000000 (0x0001)              
	//class UUIEditBox*                                  EditBox;                                          		// 0x000004 (0x0004)              
};

void UcUIScene_TextEntry::SetEditBoxCharacterRestrictions(unsigned char eCharacterRestrictions)
{
	static UFieldFunc* pFnSetEditBoxCharacterRestrictions = NULL;
	if(!pFnSetEditBoxCharacterRestrictions)
		pFnSetEditBoxCharacterRestrictions = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetEditBoxCharacterRestrictions");

	APBUserInterface_SetEditBoxCharacterRestrictions_Parms SetEditBoxCharacterRestrictions_Parms;
	SetEditBoxCharacterRestrictions_Parms.eCharacterRestrictions = eCharacterRestrictions;
	ProcessEvent(pFnSetEditBoxCharacterRestrictions,NULL,&SetEditBoxCharacterRestrictions_Parms,NULL);
}

struct APBUserInterface_SetInitialText_Parms
{
	struct FString                                     sInitialText;                                     		// 0x000000 (0x000C)              
	//class UUIEditBox*                                  EditBox;                                          		// 0x00000C (0x0004)              
};

void UcUIScene_TextEntry::SetInitialText(struct FString sInitialText)
{
	static UFieldFunc* pFnSetInitialText = NULL;
	if(!pFnSetInitialText)
		pFnSetInitialText = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetInitialText");

	APBUserInterface_SetInitialText_Parms SetInitialText_Parms;
	memcpy(&SetInitialText_Parms.sInitialText,&sInitialText,0xC);
	ProcessEvent(pFnSetInitialText,NULL,&SetInitialText_Parms,NULL);
}

struct APBUserInterface_SetTitleDatastoreBinding_Parms
{
	struct FString                                     Markup;                                           		// 0x000000 (0x000C)              
	//class UUILabel*                                    Lbl;                                              		// 0x00000C (0x0004)              
};

void UcUIScene_TextEntry::SetTitleDatastoreBinding(struct FString Markup)
{
	static UFieldFunc* pFnSetTitleDatastoreBinding = NULL;
	if(!pFnSetTitleDatastoreBinding)
		pFnSetTitleDatastoreBinding = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetTitleDatastoreBinding");

	APBUserInterface_SetTitleDatastoreBinding_Parms SetTitleDatastoreBinding_Parms;
	memcpy(&SetTitleDatastoreBinding_Parms.Markup,&Markup,0xC);
	ProcessEvent(pFnSetTitleDatastoreBinding,NULL,&SetTitleDatastoreBinding_Parms,NULL);
}

struct APBUserInterface_SetEditBoxMaxCharacters_Parms
{
	int                                                nMaxCharacters;                                   		// 0x000000 (0x0004)              
	//class UUIEditBox*                                  EditBox;                                          		// 0x000004 (0x0004)              
};

void UcUIScene_TextEntry::SetEditBoxMaxCharacters(int nMaxCharacters)
{
	static UFieldFunc* pFnSetEditBoxMaxCharacters = NULL;
	if(!pFnSetEditBoxMaxCharacters)
		pFnSetEditBoxMaxCharacters = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.SetEditBoxMaxCharacters");

	APBUserInterface_SetEditBoxMaxCharacters_Parms SetEditBoxMaxCharacters_Parms;
	SetEditBoxMaxCharacters_Parms.nMaxCharacters = nMaxCharacters;
	ProcessEvent(pFnSetEditBoxMaxCharacters,NULL,&SetEditBoxMaxCharacters_Parms,NULL);
}

struct APBUserInterface_OnCloseTextEntry_Parms
{
	class UcUIAction_CloseTextEntry*                   Action;                                           		// 0x000000 (0x0004)              
};

void UcUIScene_TextEntry::OnCloseTextEntry(class UcUIAction_CloseTextEntry* Action)
{
	static UFieldFunc* pFnOnCloseTextEntry = NULL;
	if(!pFnOnCloseTextEntry)
		pFnOnCloseTextEntry = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.OnCloseTextEntry");

	APBUserInterface_OnCloseTextEntry_Parms OnCloseTextEntry_Parms;
	OnCloseTextEntry_Parms.Action = Action;
	ProcessEvent(pFnOnCloseTextEntry,NULL,&OnCloseTextEntry_Parms,NULL);
}

struct APBUserInterface_OnBoxClosed_Parms
{
	unsigned long                                      bInAcceptOk : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

void UcUIScene_TextEntry::OnBoxClosed(bool bInAcceptOk)
{
	static UFieldFunc* pFnOnBoxClosed = NULL;
	if(!pFnOnBoxClosed)
		pFnOnBoxClosed = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.OnBoxClosed");

	APBUserInterface_OnBoxClosed_Parms OnBoxClosed_Parms;
	OnBoxClosed_Parms.bInAcceptOk = bInAcceptOk;
	ProcessEvent(pFnOnBoxClosed,NULL,&OnBoxClosed_Parms,NULL);
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIScene_TextEntry::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUIScene_TextEntry.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUISymbolCanvas::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUISymbolCanvas::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUISymbolCanvas::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUISymbolCanvas::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUISymbolCanvas::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUISymbolCanvas::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_ClearBoundDataStores_Parms
{
};

void UcUISymbolCanvas::ClearBoundDataStores()
{
	static UFieldFunc* pFnClearBoundDataStores = NULL;
	if(!pFnClearBoundDataStores)
		pFnClearBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUISymbolCanvas.ClearBoundDataStores");

	APBUserInterface_ClearBoundDataStores_Parms ClearBoundDataStores_Parms;
	pFnClearBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearBoundDataStores,NULL,&ClearBoundDataStores_Parms,NULL);
	pFnClearBoundDataStores->FunctionFlags |= 0x400;
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUIImage_DistrictMap::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIImage_DistrictMap::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUIImage_DistrictMap::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_TickAnim_Parms
{
	float                                              fDeltaTime;                                       		// 0x000000 (0x0004)              
};

void UcUIImage_DistrictMap::TickAnim(float fDeltaTime)
{
	static UFieldFunc* pFnTickAnim = NULL;
	if(!pFnTickAnim)
		pFnTickAnim = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.TickAnim");

	APBUserInterface_TickAnim_Parms TickAnim_Parms;
	TickAnim_Parms.fDeltaTime = fDeltaTime;
	pFnTickAnim->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTickAnim,NULL,&TickAnim_Parms,NULL);
	pFnTickAnim->FunctionFlags |= 0x400;
}

struct APBUserInterface_ClearBoundDataStores_Parms
{
};

void UcUIImage_DistrictMap::ClearBoundDataStores()
{
	static UFieldFunc* pFnClearBoundDataStores = NULL;
	if(!pFnClearBoundDataStores)
		pFnClearBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.ClearBoundDataStores");

	APBUserInterface_ClearBoundDataStores_Parms ClearBoundDataStores_Parms;
	pFnClearBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearBoundDataStores,NULL,&ClearBoundDataStores_Parms,NULL);
	pFnClearBoundDataStores->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUIImage_DistrictMap::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUIImage_DistrictMap::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUIImage_DistrictMap::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_RegisterTickAnim_Parms
{
	//class UGameUISceneClient*                          SClient;                                          		// 0x000000 (0x0004)              
};

void UcUIImage_DistrictMap::RegisterTickAnim()
{
	static UFieldFunc* pFnRegisterTickAnim = NULL;
	if(!pFnRegisterTickAnim)
		pFnRegisterTickAnim = UObject::FindFunction("Function APBUserInterface.cUIImage_DistrictMap.RegisterTickAnim");

	APBUserInterface_RegisterTickAnim_Parms RegisterTickAnim_Parms;
	ProcessEvent(pFnRegisterTickAnim,NULL,&RegisterTickAnim_Parms,NULL);
}

struct APBUserInterface_GetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString UcUISliderCanvas::GetDataStoreBinding(int BindingIndex)
{
	static UFieldFunc* pFnGetDataStoreBinding = NULL;
	if(!pFnGetDataStoreBinding)
		pFnGetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.GetDataStoreBinding");

	APBUserInterface_GetDataStoreBinding_Parms GetDataStoreBinding_Parms;
	GetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnGetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDataStoreBinding,NULL,&GetDataStoreBinding_Parms,NULL);
	pFnGetDataStoreBinding->FunctionFlags |= 0x400;
	return GetDataStoreBinding_Parms.ReturnValue;
}

struct APBUserInterface_GetBoundDataStores_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
};

void UcUISliderCanvas::GetBoundDataStores(TArray<class UUIDataStore*>* out_BoundDataStores)
{
	static UFieldFunc* pFnGetBoundDataStores = NULL;
	if(!pFnGetBoundDataStores)
		pFnGetBoundDataStores = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.GetBoundDataStores");

	APBUserInterface_GetBoundDataStores_Parms GetBoundDataStores_Parms;
	pFnGetBoundDataStores->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundDataStores,NULL,&GetBoundDataStores_Parms,NULL);
	pFnGetBoundDataStores->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&GetBoundDataStores_Parms.out_BoundDataStores,0xC);
}

struct APBUserInterface_OnBindSliderCanvas_Parms
{
	class UcUIAction_BindSliderCanvas*                 Action;                                           		// 0x000000 (0x0004)              
};

void UcUISliderCanvas::OnBindSliderCanvas(class UcUIAction_BindSliderCanvas* Action)
{
	static UFieldFunc* pFnOnBindSliderCanvas = NULL;
	if(!pFnOnBindSliderCanvas)
		pFnOnBindSliderCanvas = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.OnBindSliderCanvas");

	APBUserInterface_OnBindSliderCanvas_Parms OnBindSliderCanvas_Parms;
	OnBindSliderCanvas_Parms.Action = Action;
	ProcessEvent(pFnOnBindSliderCanvas,NULL,&OnBindSliderCanvas_Parms,NULL);
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUISliderCanvas::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	unsigned char                                      eOrientation;                                     		// 0x000000 (0x0001)              
	float                                              NewValue;                                         		// 0x000004 (0x0004)              
	unsigned long                                      bPercentageValue : 1;                             		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool UcUISliderCanvas::SetValue(unsigned char eOrientation,float NewValue,bool bPercentageValue)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.eOrientation = eOrientation;
	SetValue_Parms.NewValue = NewValue;
	SetValue_Parms.bPercentageValue = bPercentageValue;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_RefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUISliderCanvas::RefreshSubscriberValue(int BindingIndex)
{
	static UFieldFunc* pFnRefreshSubscriberValue = NULL;
	if(!pFnRefreshSubscriberValue)
		pFnRefreshSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.RefreshSubscriberValue");

	APBUserInterface_RefreshSubscriberValue_Parms RefreshSubscriberValue_Parms;
	RefreshSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnRefreshSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRefreshSubscriberValue,NULL,&RefreshSubscriberValue_Parms,NULL);
	pFnRefreshSubscriberValue->FunctionFlags |= 0x400;
	return RefreshSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_SetSliderDataStoreMarkup_Parms
{
	unsigned char                                      eOrientation;                                     		// 0x000000 (0x0001)              
	struct FString                                     sNewMarkup;                                       		// 0x000004 (0x000C)              
};

void UcUISliderCanvas::SetSliderDataStoreMarkup(unsigned char eOrientation,struct FString sNewMarkup)
{
	static UFieldFunc* pFnSetSliderDataStoreMarkup = NULL;
	if(!pFnSetSliderDataStoreMarkup)
		pFnSetSliderDataStoreMarkup = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.SetSliderDataStoreMarkup");

	APBUserInterface_SetSliderDataStoreMarkup_Parms SetSliderDataStoreMarkup_Parms;
	SetSliderDataStoreMarkup_Parms.eOrientation = eOrientation;
	memcpy(&SetSliderDataStoreMarkup_Parms.sNewMarkup,&sNewMarkup,0xC);
	pFnSetSliderDataStoreMarkup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetSliderDataStoreMarkup,NULL,&SetSliderDataStoreMarkup_Parms,NULL);
	pFnSetSliderDataStoreMarkup->FunctionFlags |= 0x400;
}

struct APBUserInterface_NotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x000004 (0x0004) [0x00000001] 
	struct FName                                       PropertyTag;                                      		// 0x000008 (0x0008)              
	class UUIDataProvider*                             SourceProvider;                                   		// 0x000010 (0x0004)              
	int                                                ArrayIndex;                                       		// 0x000014 (0x0004)              
};

void UcUISliderCanvas::NotifyDataStoreValueUpdated(class UUIDataStore* SourceDataStore,bool bValuesInvalidated,struct FName PropertyTag,class UUIDataProvider* SourceProvider,int ArrayIndex)
{
	static UFieldFunc* pFnNotifyDataStoreValueUpdated = NULL;
	if(!pFnNotifyDataStoreValueUpdated)
		pFnNotifyDataStoreValueUpdated = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.NotifyDataStoreValueUpdated");

	APBUserInterface_NotifyDataStoreValueUpdated_Parms NotifyDataStoreValueUpdated_Parms;
	NotifyDataStoreValueUpdated_Parms.SourceDataStore = SourceDataStore;
	NotifyDataStoreValueUpdated_Parms.bValuesInvalidated = bValuesInvalidated;
	memcpy(&NotifyDataStoreValueUpdated_Parms.PropertyTag,&PropertyTag,0x8);
	NotifyDataStoreValueUpdated_Parms.SourceProvider = SourceProvider;
	NotifyDataStoreValueUpdated_Parms.ArrayIndex = ArrayIndex;
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNotifyDataStoreValueUpdated,NULL,&NotifyDataStoreValueUpdated_Parms,NULL);
	pFnNotifyDataStoreValueUpdated->FunctionFlags |= 0x400;
}

struct APBUserInterface_SaveSubscriberValue_Parms
{
	TArray<class UUIDataStore*>                        out_BoundDataStores;                              		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool UcUISliderCanvas::SaveSubscriberValue(TArray<class UUIDataStore*>* out_BoundDataStores,int BindingIndex)
{
	static UFieldFunc* pFnSaveSubscriberValue = NULL;
	if(!pFnSaveSubscriberValue)
		pFnSaveSubscriberValue = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.SaveSubscriberValue");

	APBUserInterface_SaveSubscriberValue_Parms SaveSubscriberValue_Parms;
	SaveSubscriberValue_Parms.BindingIndex = BindingIndex;
	pFnSaveSubscriberValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSaveSubscriberValue,NULL,&SaveSubscriberValue_Parms,NULL);
	pFnSaveSubscriberValue->FunctionFlags |= 0x400;
	if(out_BoundDataStores)
		memcpy(out_BoundDataStores,&SaveSubscriberValue_Parms.out_BoundDataStores,0xC);
	return SaveSubscriberValue_Parms.ReturnValue;
}

struct APBUserInterface_SetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x000000 (0x000C)              
	int                                                BindingIndex;                                     		// 0x00000C (0x0004)              
};

void UcUISliderCanvas::SetDataStoreBinding(struct FString MarkupText,int BindingIndex)
{
	static UFieldFunc* pFnSetDataStoreBinding = NULL;
	if(!pFnSetDataStoreBinding)
		pFnSetDataStoreBinding = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.SetDataStoreBinding");

	APBUserInterface_SetDataStoreBinding_Parms SetDataStoreBinding_Parms;
	memcpy(&SetDataStoreBinding_Parms.MarkupText,&MarkupText,0xC);
	SetDataStoreBinding_Parms.BindingIndex = BindingIndex;
	pFnSetDataStoreBinding->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDataStoreBinding,NULL,&SetDataStoreBinding_Parms,NULL);
	pFnSetDataStoreBinding->FunctionFlags |= 0x400;
}

struct APBUserInterface_GetValue_Parms
{
	unsigned char                                      eOrientation;                                     		// 0x000000 (0x0001)              
	unsigned long                                      bPercentageValue : 1;                             		// 0x000004 (0x0004) [0x00000001] 
	float                                              ReturnValue;                                      		// 0x000008 (0x0004)              
};

float UcUISliderCanvas::GetValue(unsigned char eOrientation,bool bPercentageValue)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cUISliderCanvas.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.eOrientation = eOrientation;
	GetValue_Parms.bPercentageValue = bPercentageValue;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_SetOrdering_Parms
{
	struct FName                                       Ordering;                                         		// 0x000000 (0x0008)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UiUIListOrderedElementProvider::SetOrdering(struct FName Ordering)
{
	static UFieldFunc* pFnSetOrdering = NULL;
	if(!pFnSetOrdering)
		pFnSetOrdering = UObject::FindFunction("Function APBUserInterface.iUIListOrderedElementProvider.SetOrdering");

	APBUserInterface_SetOrdering_Parms SetOrdering_Parms;
	memcpy(&SetOrdering_Parms.Ordering,&Ordering,0x8);
	ProcessEvent(pFnSetOrdering,NULL,&SetOrdering_Parms,NULL);
	return SetOrdering_Parms.ReturnValue;
}

struct APBUserInterface_GetCurrentPage_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UiUIListPagedElementProvider::GetCurrentPage()
{
	static UFieldFunc* pFnGetCurrentPage = NULL;
	if(!pFnGetCurrentPage)
		pFnGetCurrentPage = UObject::FindFunction("Function APBUserInterface.iUIListPagedElementProvider.GetCurrentPage");

	APBUserInterface_GetCurrentPage_Parms GetCurrentPage_Parms;
	ProcessEvent(pFnGetCurrentPage,NULL,&GetCurrentPage_Parms,NULL);
	return GetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_GetTotalPages_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UiUIListPagedElementProvider::GetTotalPages()
{
	static UFieldFunc* pFnGetTotalPages = NULL;
	if(!pFnGetTotalPages)
		pFnGetTotalPages = UObject::FindFunction("Function APBUserInterface.iUIListPagedElementProvider.GetTotalPages");

	APBUserInterface_GetTotalPages_Parms GetTotalPages_Parms;
	ProcessEvent(pFnGetTotalPages,NULL,&GetTotalPages_Parms,NULL);
	return GetTotalPages_Parms.ReturnValue;
}

struct APBUserInterface_SetCurrentPage_Parms
{
	int                                                nPage;                                            		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UiUIListPagedElementProvider::SetCurrentPage(int nPage)
{
	static UFieldFunc* pFnSetCurrentPage = NULL;
	if(!pFnSetCurrentPage)
		pFnSetCurrentPage = UObject::FindFunction("Function APBUserInterface.iUIListPagedElementProvider.SetCurrentPage");

	APBUserInterface_SetCurrentPage_Parms SetCurrentPage_Parms;
	SetCurrentPage_Parms.nPage = nPage;
	ProcessEvent(pFnSetCurrentPage,NULL,&SetCurrentPage_Parms,NULL);
	return SetCurrentPage_Parms.ReturnValue;
}

struct APBUserInterface_OnFinishAPBRemoteEvent_Parms
{
	class UcUIAction_FinishAPBRemoteEvent*             Action;                                           		// 0x000000 (0x0004)              
};

void UcUIAction_ActivateAPBRemoteEvent::OnFinishAPBRemoteEvent(class UcUIAction_FinishAPBRemoteEvent* Action)
{
	static UFieldFunc* pFnOnFinishAPBRemoteEvent = NULL;
	if(!pFnOnFinishAPBRemoteEvent)
		pFnOnFinishAPBRemoteEvent = UObject::FindFunction("Function APBUserInterface.cUIAction_ActivateAPBRemoteEvent.OnFinishAPBRemoteEvent");

	APBUserInterface_OnFinishAPBRemoteEvent_Parms OnFinishAPBRemoteEvent_Parms;
	OnFinishAPBRemoteEvent_Parms.Action = Action;
	pFnOnFinishAPBRemoteEvent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnFinishAPBRemoteEvent,NULL,&OnFinishAPBRemoteEvent_Parms,NULL);
	pFnOnFinishAPBRemoteEvent->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UcUIAction_ActivateAPBRemoteEvent::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function APBUserInterface.cUIAction_ActivateAPBRemoteEvent.OnSequenceAction");

	APBUserInterface_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct APBUserInterface_SetupScene_Parms
{
	class UcUIScene_MessageBox*                        Scene;                                            		// 0x000000 (0x0004)              
};

void UcUIAction_DisplayMessageBox::SetupScene(class UcUIScene_MessageBox* Scene)
{
	static UFieldFunc* pFnSetupScene = NULL;
	if(!pFnSetupScene)
		pFnSetupScene = UObject::FindFunction("Function APBUserInterface.cUIAction_DisplayMessageBox.SetupScene");

	APBUserInterface_SetupScene_Parms SetupScene_Parms;
	SetupScene_Parms.Scene = Scene;
	ProcessEvent(pFnSetupScene,NULL,&SetupScene_Parms,NULL);
}

struct APBUserInterface_OnBoxClosed_Parms
{
	unsigned char                                      eResult;                                          		// 0x000000 (0x0001)              
	unsigned long                                      bDisableMessage : 1;                              		// 0x000004 (0x0004) [0x00000001] 
};

void UcUIAction_DisplayMessageBox::OnBoxClosed(unsigned char eResult,bool bDisableMessage)
{
	static UFieldFunc* pFnOnBoxClosed = NULL;
	if(!pFnOnBoxClosed)
		pFnOnBoxClosed = UObject::FindFunction("Function APBUserInterface.cUIAction_DisplayMessageBox.OnBoxClosed");

	APBUserInterface_OnBoxClosed_Parms OnBoxClosed_Parms;
	OnBoxClosed_Parms.eResult = eResult;
	OnBoxClosed_Parms.bDisableMessage = bDisableMessage;
	ProcessEvent(pFnOnBoxClosed,NULL,&OnBoxClosed_Parms,NULL);
}

struct APBUserInterface_OnGetHUDMarkerPosition_Parms
{
	unsigned long                                      bSuccess : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	FVector3                                           Position;                                         		// 0x000004 (0x000C)              
};

void UcUIAction_SetDisplayPointWaypoint::OnGetHUDMarkerPosition(bool bSuccess,FVector3 Position)
{
	static UFieldFunc* pFnOnGetHUDMarkerPosition = NULL;
	if(!pFnOnGetHUDMarkerPosition)
		pFnOnGetHUDMarkerPosition = UObject::FindFunction("Function APBUserInterface.cUIAction_SetDisplayPointWaypoint.OnGetHUDMarkerPosition");

	APBUserInterface_OnGetHUDMarkerPosition_Parms OnGetHUDMarkerPosition_Parms;
	OnGetHUDMarkerPosition_Parms.bSuccess = bSuccess;
	memcpy(&OnGetHUDMarkerPosition_Parms.Position,&Position,0xC);
	pFnOnGetHUDMarkerPosition->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnGetHUDMarkerPosition,NULL,&OnGetHUDMarkerPosition_Parms,NULL);
	pFnOnGetHUDMarkerPosition->FunctionFlags |= 0x400;
}

struct APBUserInterface_OnSceneDeactivated_Parms
{
	class UUIScene*                                    DeactivatedScene;                                 		// 0x000000 (0x0004)              
};

void UcUIAction_OpenContextPanel::OnSceneDeactivated(class UUIScene* DeactivatedScene)
{
	static UFieldFunc* pFnOnSceneDeactivated = NULL;
	if(!pFnOnSceneDeactivated)
		pFnOnSceneDeactivated = UObject::FindFunction("Function APBUserInterface.cUIAction_OpenContextPanel.OnSceneDeactivated");

	APBUserInterface_OnSceneDeactivated_Parms OnSceneDeactivated_Parms;
	OnSceneDeactivated_Parms.DeactivatedScene = DeactivatedScene;
	pFnOnSceneDeactivated->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnSceneDeactivated,NULL,&OnSceneDeactivated_Parms,NULL);
	pFnOnSceneDeactivated->FunctionFlags |= 0x400;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_RemoveItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nArrayIndex;                                      		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_ArrayVariable::RemoveItem(class UObject* pObject,int nArrayIndex)
{
	static UFieldFunc* pFnRemoveItem = NULL;
	if(!pFnRemoveItem)
		pFnRemoveItem = UObject::FindFunction("Function APBUserInterface.cAttribute_ArrayVariable.RemoveItem");

	APBUserInterface_RemoveItem_Parms RemoveItem_Parms;
	RemoveItem_Parms.pObject = pObject;
	RemoveItem_Parms.nArrayIndex = nArrayIndex;
	pFnRemoveItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRemoveItem,NULL,&RemoveItem_Parms,NULL);
	pFnRemoveItem->FunctionFlags |= 0x400;
	return RemoveItem_Parms.ReturnValue;
}

struct APBUserInterface_InsertZeroedItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nInsertIndex;                                     		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_ArrayVariable::InsertZeroedItem(class UObject* pObject,int nInsertIndex)
{
	static UFieldFunc* pFnInsertZeroedItem = NULL;
	if(!pFnInsertZeroedItem)
		pFnInsertZeroedItem = UObject::FindFunction("Function APBUserInterface.cAttribute_ArrayVariable.InsertZeroedItem");

	APBUserInterface_InsertZeroedItem_Parms InsertZeroedItem_Parms;
	InsertZeroedItem_Parms.pObject = pObject;
	InsertZeroedItem_Parms.nInsertIndex = nInsertIndex;
	pFnInsertZeroedItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInsertZeroedItem,NULL,&InsertZeroedItem_Parms,NULL);
	pFnInsertZeroedItem->FunctionFlags |= 0x400;
	return InsertZeroedItem_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_ArrayVariable::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_ArrayVariable.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_ArrayVariable::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_ArrayVariable.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_BaseArrayLocalisedString::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_BaseArrayLocalisedString.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_BaseArrayLocalisedString::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_BaseArrayLocalisedString.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_InsertZeroedItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nInsertIndex;                                     		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_FacialHair::InsertZeroedItem(class UObject* pObject,int nInsertIndex)
{
	static UFieldFunc* pFnInsertZeroedItem = NULL;
	if(!pFnInsertZeroedItem)
		pFnInsertZeroedItem = UObject::FindFunction("Function APBUserInterface.cAttribute_FacialHair.InsertZeroedItem");

	APBUserInterface_InsertZeroedItem_Parms InsertZeroedItem_Parms;
	InsertZeroedItem_Parms.pObject = pObject;
	InsertZeroedItem_Parms.nInsertIndex = nInsertIndex;
	pFnInsertZeroedItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInsertZeroedItem,NULL,&InsertZeroedItem_Parms,NULL);
	pFnInsertZeroedItem->FunctionFlags |= 0x400;
	return InsertZeroedItem_Parms.ReturnValue;
}

struct APBUserInterface_RemoveItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nArrayIndex;                                      		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_FacialHair::RemoveItem(class UObject* pObject,int nArrayIndex)
{
	static UFieldFunc* pFnRemoveItem = NULL;
	if(!pFnRemoveItem)
		pFnRemoveItem = UObject::FindFunction("Function APBUserInterface.cAttribute_FacialHair.RemoveItem");

	APBUserInterface_RemoveItem_Parms RemoveItem_Parms;
	RemoveItem_Parms.pObject = pObject;
	RemoveItem_Parms.nArrayIndex = nArrayIndex;
	pFnRemoveItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRemoveItem,NULL,&RemoveItem_Parms,NULL);
	pFnRemoveItem->FunctionFlags |= 0x400;
	return RemoveItem_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_FacialHair::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_FacialHair.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_FacialHair::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_FacialHair.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_RemoveItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nArrayIndex;                                      		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_TESTexture::RemoveItem(class UObject* pObject,int nArrayIndex)
{
	static UFieldFunc* pFnRemoveItem = NULL;
	if(!pFnRemoveItem)
		pFnRemoveItem = UObject::FindFunction("Function APBUserInterface.cAttribute_TESTexture.RemoveItem");

	APBUserInterface_RemoveItem_Parms RemoveItem_Parms;
	RemoveItem_Parms.pObject = pObject;
	RemoveItem_Parms.nArrayIndex = nArrayIndex;
	pFnRemoveItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRemoveItem,NULL,&RemoveItem_Parms,NULL);
	pFnRemoveItem->FunctionFlags |= 0x400;
	return RemoveItem_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_TESTexture::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_TESTexture.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_TESTexture::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_TESTexture.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_InsertZeroedItem_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	int                                                nInsertIndex;                                     		// 0x000004 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UcAttribute_TESTexture::InsertZeroedItem(class UObject* pObject,int nInsertIndex)
{
	static UFieldFunc* pFnInsertZeroedItem = NULL;
	if(!pFnInsertZeroedItem)
		pFnInsertZeroedItem = UObject::FindFunction("Function APBUserInterface.cAttribute_TESTexture.InsertZeroedItem");

	APBUserInterface_InsertZeroedItem_Parms InsertZeroedItem_Parms;
	InsertZeroedItem_Parms.pObject = pObject;
	InsertZeroedItem_Parms.nInsertIndex = nInsertIndex;
	pFnInsertZeroedItem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInsertZeroedItem,NULL,&InsertZeroedItem_Parms,NULL);
	pFnInsertZeroedItem->FunctionFlags |= 0x400;
	return InsertZeroedItem_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_Morph::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_Morph.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_Morph::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_Morph.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetValue,NULL,&SetValue_Parms,NULL);
	pFnSetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&SetValue_Parms.Value,0x48);
	return SetValue_Parms.ReturnValue;
}

struct APBUserInterface_GetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_Variable::GetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnGetValue = NULL;
	if(!pFnGetValue)
		pFnGetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_Variable.GetValue");

	APBUserInterface_GetValue_Parms GetValue_Parms;
	GetValue_Parms.pObject = pObject;
	GetValue_Parms.nArrayIndex = nArrayIndex;
	pFnGetValue->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetValue,NULL,&GetValue_Parms,NULL);
	pFnGetValue->FunctionFlags |= 0x400;
	if(Value)
		memcpy(Value,&GetValue_Parms.Value,0x48);
	return GetValue_Parms.ReturnValue;
}

struct APBUserInterface_SetValue_Parms
{
	class UObject*                                     pObject;                                          		// 0x000000 (0x0004)              
	struct FAttributeValue                             Value;                                            		// 0x000004 (0x0048)              
	int                                                nArrayIndex;                                      		// 0x00004C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000050 (0x0004) [0x00000001] 
};

bool UcAttribute_Variable::SetValue(class UObject* pObject,struct FAttributeValue* Value,int nArrayIndex)
{
	static UFieldFunc* pFnSetValue = NULL;
	if(!pFnSetValue)
		pFnSetValue = UObject::FindFunction("Function APBUserInterface.cAttribute_Variable.SetValue");

	APBUserInterface_SetValue_Parms SetValue_Parms;
	SetValue_Parms.pObject = pObject;
	SetValue_Parms.nArrayIndex = nArrayIndex;
	pFnSetValue->FunctionFlags |= ~0x400;
