
struct Engine_ForceUpdate_Parms
{
	unsigned long                                      bTransformOnly : 1;                               		// 0x000000 (0x0004) [0x00000001] 
};

void UActorComponent::ForceUpdate(bool bTransformOnly)
{
	static UFieldFunc* pFnForceUpdate = NULL;
	if(!pFnForceUpdate)
		pFnForceUpdate = UObject::FindFunction("Function Engine.ActorComponent.ForceUpdate");

	Engine_ForceUpdate_Parms ForceUpdate_Parms;
	ForceUpdate_Parms.bTransformOnly = bTransformOnly;
	pFnForceUpdate->FunctionFlags |= ~0x400;
	ProcessEvent(pFnForceUpdate,NULL,&ForceUpdate_Parms,NULL);
	pFnForceUpdate->FunctionFlags |= 0x400;
}

struct Engine_SetComponentRBFixed_Parms
{
	unsigned long                                      bFixed : 1;                                       		// 0x000000 (0x0004) [0x00000001] 
};

void UActorComponent::SetComponentRBFixed(bool bFixed)
{
	static UFieldFunc* pFnSetComponentRBFixed = NULL;
	if(!pFnSetComponentRBFixed)
		pFnSetComponentRBFixed = UObject::FindFunction("Function Engine.ActorComponent.SetComponentRBFixed");

	Engine_SetComponentRBFixed_Parms SetComponentRBFixed_Parms;
	SetComponentRBFixed_Parms.bFixed = bFixed;
	pFnSetComponentRBFixed->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetComponentRBFixed,NULL,&SetComponentRBFixed_Parms,NULL);
	pFnSetComponentRBFixed->FunctionFlags |= 0x400;
}

struct Engine_SetTickGroup_Parms
{
	unsigned char                                      NewTickGroup;                                     		// 0x000000 (0x0001)              
};

void UActorComponent::SetTickGroup(unsigned char NewTickGroup)
{
	static UFieldFunc* pFnSetTickGroup = NULL;
	if(!pFnSetTickGroup)
		pFnSetTickGroup = UObject::FindFunction("Function Engine.ActorComponent.SetTickGroup");

	Engine_SetTickGroup_Parms SetTickGroup_Parms;
	SetTickGroup_Parms.NewTickGroup = NewTickGroup;
	pFnSetTickGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTickGroup,NULL,&SetTickGroup_Parms,NULL);
	pFnSetTickGroup->FunctionFlags |= 0x400;
}

struct Engine_RecalcLocalToWorld_Parms
{
};

void UcBlobShadowComponent::RecalcLocalToWorld()
{
	static UFieldFunc* pFnRecalcLocalToWorld = NULL;
	if(!pFnRecalcLocalToWorld)
		pFnRecalcLocalToWorld = UObject::FindFunction("Function Engine.cBlobShadowComponent.RecalcLocalToWorld");

	Engine_RecalcLocalToWorld_Parms RecalcLocalToWorld_Parms;
	pFnRecalcLocalToWorld->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRecalcLocalToWorld,NULL,&RecalcLocalToWorld_Parms,NULL);
	pFnRecalcLocalToWorld->FunctionFlags |= 0x400;
}

struct Engine_SetScale3D_Parms
{
	FVector3                                           Scale3D;                                          		// 0x000000 (0x000C)              
};

void UcBlobShadowComponent::SetScale3D(FVector3 Scale3D)
{
	static UFieldFunc* pFnSetScale3D = NULL;
	if(!pFnSetScale3D)
		pFnSetScale3D = UObject::FindFunction("Function Engine.cBlobShadowComponent.SetScale3D");

	Engine_SetScale3D_Parms SetScale3D_Parms;
	memcpy(&SetScale3D_Parms.Scale3D,&Scale3D,0xC);
	pFnSetScale3D->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetScale3D,NULL,&SetScale3D_Parms,NULL);
	pFnSetScale3D->FunctionFlags |= 0x400;
}

struct Engine_SetTranslation_Parms
{
	FVector3                                           Translation;                                      		// 0x000000 (0x000C)              
};

void UcBlobShadowComponent::SetTranslation(FVector3 Translation)
{
	static UFieldFunc* pFnSetTranslation = NULL;
	if(!pFnSetTranslation)
		pFnSetTranslation = UObject::FindFunction("Function Engine.cBlobShadowComponent.SetTranslation");

	Engine_SetTranslation_Parms SetTranslation_Parms;
	memcpy(&SetTranslation_Parms.Translation,&Translation,0xC);
	pFnSetTranslation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTranslation,NULL,&SetTranslation_Parms,NULL);
	pFnSetTranslation->FunctionFlags |= 0x400;
}

struct Engine_OcclusionChanged_Parms
{
	unsigned long                                      bNowOccluded : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
};

void UAudioComponent::OcclusionChanged(bool bNowOccluded)
{
	static UFieldFunc* pFnOcclusionChanged = NULL;
	if(!pFnOcclusionChanged)
		pFnOcclusionChanged = UObject::FindFunction("Function Engine.AudioComponent.OcclusionChanged");

	Engine_OcclusionChanged_Parms OcclusionChanged_Parms;
	OcclusionChanged_Parms.bNowOccluded = bNowOccluded;
	ProcessEvent(pFnOcclusionChanged,NULL,&OcclusionChanged_Parms,NULL);
}

struct Engine_Play_Parms
{
};

void UAudioComponent::Play()
{
	static UFieldFunc* pFnPlay = NULL;
	if(!pFnPlay)
		pFnPlay = UObject::FindFunction("Function Engine.AudioComponent.Play");

	Engine_Play_Parms Play_Parms;
	pFnPlay->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPlay,NULL,&Play_Parms,NULL);
	pFnPlay->FunctionFlags |= 0x400;
}

struct Engine_Stop_Parms
{
};

void UAudioComponent::Stop()
{
	static UFieldFunc* pFnStop = NULL;
	if(!pFnStop)
		pFnStop = UObject::FindFunction("Function Engine.AudioComponent.Stop");

	Engine_Stop_Parms Stop_Parms;
	pFnStop->FunctionFlags |= ~0x400;
	ProcessEvent(pFnStop,NULL,&Stop_Parms,NULL);
	pFnStop->FunctionFlags |= 0x400;
}

struct Engine_IsPlaying_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UAudioComponent::IsPlaying()
{
	static UFieldFunc* pFnIsPlaying = NULL;
	if(!pFnIsPlaying)
		pFnIsPlaying = UObject::FindFunction("Function Engine.AudioComponent.IsPlaying");

	Engine_IsPlaying_Parms IsPlaying_Parms;
	pFnIsPlaying->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsPlaying,NULL,&IsPlaying_Parms,NULL);
	pFnIsPlaying->FunctionFlags |= 0x400;
	return IsPlaying_Parms.ReturnValue;
}

struct Engine_FadeOut_Parms
{
	float                                              FadeOutDuration;                                  		// 0x000000 (0x0004)              
	float                                              FadeVolumeLevel;                                  		// 0x000004 (0x0004)              
};

void UAudioComponent::FadeOut(float FadeOutDuration,float FadeVolumeLevel)
{
	static UFieldFunc* pFnFadeOut = NULL;
	if(!pFnFadeOut)
		pFnFadeOut = UObject::FindFunction("Function Engine.AudioComponent.FadeOut");

	Engine_FadeOut_Parms FadeOut_Parms;
	FadeOut_Parms.FadeOutDuration = FadeOutDuration;
	FadeOut_Parms.FadeVolumeLevel = FadeVolumeLevel;
	pFnFadeOut->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFadeOut,NULL,&FadeOut_Parms,NULL);
	pFnFadeOut->FunctionFlags |= 0x400;
}

struct Engine_FadeIn_Parms
{
	float                                              FadeInDuration;                                   		// 0x000000 (0x0004)              
	float                                              FadeVolumeLevel;                                  		// 0x000004 (0x0004)              
};

void UAudioComponent::FadeIn(float FadeInDuration,float FadeVolumeLevel)
{
	static UFieldFunc* pFnFadeIn = NULL;
	if(!pFnFadeIn)
		pFnFadeIn = UObject::FindFunction("Function Engine.AudioComponent.FadeIn");

	Engine_FadeIn_Parms FadeIn_Parms;
	FadeIn_Parms.FadeInDuration = FadeInDuration;
	FadeIn_Parms.FadeVolumeLevel = FadeVolumeLevel;
	pFnFadeIn->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFadeIn,NULL,&FadeIn_Parms,NULL);
	pFnFadeIn->FunctionFlags |= 0x400;
}

struct Engine_OnAudioFinished_Parms
{
	class UAudioComponent*                             AC;                                               		// 0x000000 (0x0004)              
};

void UAudioComponent::OnAudioFinished(class UAudioComponent* AC)
{
	static UFieldFunc* pFnOnAudioFinished = NULL;
	if(!pFnOnAudioFinished)
		pFnOnAudioFinished = UObject::FindFunction("Function Engine.AudioComponent.OnAudioFinished");

	Engine_OnAudioFinished_Parms OnAudioFinished_Parms;
	OnAudioFinished_Parms.AC = AC;
	ProcessEvent(pFnOnAudioFinished,NULL,&OnAudioFinished_Parms,NULL);
}

struct Engine_AdjustVolume_Parms
{
	float                                              AdjustVolumeDuration;                             		// 0x000000 (0x0004)              
	float                                              AdjustVolumeLevel;                                		// 0x000004 (0x0004)              
};

void UAudioComponent::AdjustVolume(float AdjustVolumeDuration,float AdjustVolumeLevel)
{
	static UFieldFunc* pFnAdjustVolume = NULL;
	if(!pFnAdjustVolume)
		pFnAdjustVolume = UObject::FindFunction("Function Engine.AudioComponent.AdjustVolume");

	Engine_AdjustVolume_Parms AdjustVolume_Parms;
	AdjustVolume_Parms.AdjustVolumeDuration = AdjustVolumeDuration;
	AdjustVolume_Parms.AdjustVolumeLevel = AdjustVolumeLevel;
	pFnAdjustVolume->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAdjustVolume,NULL,&AdjustVolume_Parms,NULL);
	pFnAdjustVolume->FunctionFlags |= 0x400;
}

struct Engine_SetWaveParameter_Parms
{
	struct FName                                       InName;                                           		// 0x000000 (0x0008)              
	class USoundNodeWave*                              InWave;                                           		// 0x000008 (0x0004)              
};

void UAudioComponent::SetWaveParameter(struct FName InName,class USoundNodeWave* InWave)
{
	static UFieldFunc* pFnSetWaveParameter = NULL;
	if(!pFnSetWaveParameter)
		pFnSetWaveParameter = UObject::FindFunction("Function Engine.AudioComponent.SetWaveParameter");

	Engine_SetWaveParameter_Parms SetWaveParameter_Parms;
	memcpy(&SetWaveParameter_Parms.InName,&InName,0x8);
	SetWaveParameter_Parms.InWave = InWave;
	pFnSetWaveParameter->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetWaveParameter,NULL,&SetWaveParameter_Parms,NULL);
	pFnSetWaveParameter->FunctionFlags |= 0x400;
}

struct Engine_SetFloatParameter_Parms
{
	struct FName                                       InName;                                           		// 0x000000 (0x0008)              
	float                                              InFloat;                                          		// 0x000008 (0x0004)              
};

void UAudioComponent::SetFloatParameter(struct FName InName,float InFloat)
{
	static UFieldFunc* pFnSetFloatParameter = NULL;
	if(!pFnSetFloatParameter)
		pFnSetFloatParameter = UObject::FindFunction("Function Engine.AudioComponent.SetFloatParameter");

	Engine_SetFloatParameter_Parms SetFloatParameter_Parms;
	memcpy(&SetFloatParameter_Parms.InName,&InName,0x8);
	SetFloatParameter_Parms.InFloat = InFloat;
	pFnSetFloatParameter->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetFloatParameter,NULL,&SetFloatParameter_Parms,NULL);
	pFnSetFloatParameter->FunctionFlags |= 0x400;
}

struct Engine_ResetToDefaults_Parms
{
};

void UAudioComponent::ResetToDefaults()
{
	static UFieldFunc* pFnResetToDefaults = NULL;
	if(!pFnResetToDefaults)
		pFnResetToDefaults = UObject::FindFunction("Function Engine.AudioComponent.ResetToDefaults");

	Engine_ResetToDefaults_Parms ResetToDefaults_Parms;
	pFnResetToDefaults->FunctionFlags |= ~0x400;
	ProcessEvent(pFnResetToDefaults,NULL,&ResetToDefaults_Parms,NULL);
	pFnResetToDefaults->FunctionFlags |= 0x400;
}

struct Engine_SetIgnoreOwnerHidden_Parms
{
	unsigned long                                      bNewIgnoreOwnerHidden : 1;                        		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetIgnoreOwnerHidden(bool bNewIgnoreOwnerHidden)
{
	static UFieldFunc* pFnSetIgnoreOwnerHidden = NULL;
	if(!pFnSetIgnoreOwnerHidden)
		pFnSetIgnoreOwnerHidden = UObject::FindFunction("Function Engine.PrimitiveComponent.SetIgnoreOwnerHidden");

	Engine_SetIgnoreOwnerHidden_Parms SetIgnoreOwnerHidden_Parms;
	SetIgnoreOwnerHidden_Parms.bNewIgnoreOwnerHidden = bNewIgnoreOwnerHidden;
	pFnSetIgnoreOwnerHidden->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetIgnoreOwnerHidden,NULL,&SetIgnoreOwnerHidden_Parms,NULL);
	pFnSetIgnoreOwnerHidden->FunctionFlags |= 0x400;
}

struct Engine_SetAbsolute_Parms
{
	unsigned long                                      NewAbsoluteTranslation : 1;                       		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      NewAbsoluteRotation : 1;                          		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      NewAbsoluteScale : 1;                             		// 0x000008 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetAbsolute(bool NewAbsoluteTranslation,bool NewAbsoluteRotation,bool NewAbsoluteScale)
{
	static UFieldFunc* pFnSetAbsolute = NULL;
	if(!pFnSetAbsolute)
		pFnSetAbsolute = UObject::FindFunction("Function Engine.PrimitiveComponent.SetAbsolute");

	Engine_SetAbsolute_Parms SetAbsolute_Parms;
	SetAbsolute_Parms.NewAbsoluteTranslation = NewAbsoluteTranslation;
	SetAbsolute_Parms.NewAbsoluteRotation = NewAbsoluteRotation;
	SetAbsolute_Parms.NewAbsoluteScale = NewAbsoluteScale;
	pFnSetAbsolute->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetAbsolute,NULL,&SetAbsolute_Parms,NULL);
	pFnSetAbsolute->FunctionFlags |= 0x400;
}

struct Engine_SetRotation_Parms
{
	FRotator                                           NewRotation;                                      		// 0x000000 (0x000C)              
};

void UPrimitiveComponent::SetRotation(FRotator NewRotation)
{
	static UFieldFunc* pFnSetRotation = NULL;
	if(!pFnSetRotation)
		pFnSetRotation = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRotation");

	Engine_SetRotation_Parms SetRotation_Parms;
	memcpy(&SetRotation_Parms.NewRotation,&NewRotation,0xC);
	pFnSetRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRotation,NULL,&SetRotation_Parms,NULL);
	pFnSetRotation->FunctionFlags |= 0x400;
}

struct Engine_AddForce_Parms
{
	FVector3                                           Force;                                            		// 0x000000 (0x000C)              
	FVector3                                           Position;                                         		// 0x00000C (0x000C)              
	struct FName                                       BoneName;                                         		// 0x000018 (0x0008)              
};

void UPrimitiveComponent::AddForce(FVector3 Force,FVector3 Position,struct FName BoneName)
{
	static UFieldFunc* pFnAddForce = NULL;
	if(!pFnAddForce)
		pFnAddForce = UObject::FindFunction("Function Engine.PrimitiveComponent.AddForce");

	Engine_AddForce_Parms AddForce_Parms;
	memcpy(&AddForce_Parms.Force,&Force,0xC);
	memcpy(&AddForce_Parms.Position,&Position,0xC);
	memcpy(&AddForce_Parms.BoneName,&BoneName,0x8);
	pFnAddForce->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddForce,NULL,&AddForce_Parms,NULL);
	pFnAddForce->FunctionFlags |= 0x400;
}

struct Engine_SetHidden_Parms
{
	unsigned long                                      NewHidden : 1;                                    		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetHidden(bool NewHidden)
{
	static UFieldFunc* pFnSetHidden = NULL;
	if(!pFnSetHidden)
		pFnSetHidden = UObject::FindFunction("Function Engine.PrimitiveComponent.SetHidden");

	Engine_SetHidden_Parms SetHidden_Parms;
	SetHidden_Parms.NewHidden = NewHidden;
	pFnSetHidden->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetHidden,NULL,&SetHidden_Parms,NULL);
	pFnSetHidden->FunctionFlags |= 0x400;
}

struct Engine_SetTranslation_Parms
{
	FVector3                                           NewTranslation;                                   		// 0x000000 (0x000C)              
};

void UPrimitiveComponent::SetTranslation(FVector3 NewTranslation)
{
	static UFieldFunc* pFnSetTranslation = NULL;
	if(!pFnSetTranslation)
		pFnSetTranslation = UObject::FindFunction("Function Engine.PrimitiveComponent.SetTranslation");

	Engine_SetTranslation_Parms SetTranslation_Parms;
	memcpy(&SetTranslation_Parms.NewTranslation,&NewTranslation,0xC);
	pFnSetTranslation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTranslation,NULL,&SetTranslation_Parms,NULL);
	pFnSetTranslation->FunctionFlags |= 0x400;
}

struct Engine_SetRBLinearVelocity_Parms
{
	FVector3                                           NewVel;                                           		// 0x000000 (0x000C)              
	unsigned long                                      bAddToCurrent : 1;                                		// 0x00000C (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRBLinearVelocity(FVector3 NewVel,bool bAddToCurrent)
{
	static UFieldFunc* pFnSetRBLinearVelocity = NULL;
	if(!pFnSetRBLinearVelocity)
		pFnSetRBLinearVelocity = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBLinearVelocity");

	Engine_SetRBLinearVelocity_Parms SetRBLinearVelocity_Parms;
	memcpy(&SetRBLinearVelocity_Parms.NewVel,&NewVel,0xC);
	SetRBLinearVelocity_Parms.bAddToCurrent = bAddToCurrent;
	pFnSetRBLinearVelocity->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBLinearVelocity,NULL,&SetRBLinearVelocity_Parms,NULL);
	pFnSetRBLinearVelocity->FunctionFlags |= 0x400;
}

struct Engine_SetCastShadow_Parms
{
	unsigned long                                      bNewCastShadow : 1;                               		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetCastShadow(bool bNewCastShadow)
{
	static UFieldFunc* pFnSetCastShadow = NULL;
	if(!pFnSetCastShadow)
		pFnSetCastShadow = UObject::FindFunction("Function Engine.PrimitiveComponent.SetCastShadow");

	Engine_SetCastShadow_Parms SetCastShadow_Parms;
	SetCastShadow_Parms.bNewCastShadow = bNewCastShadow;
	pFnSetCastShadow->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCastShadow,NULL,&SetCastShadow_Parms,NULL);
	pFnSetCastShadow->FunctionFlags |= 0x400;
}

struct Engine_SetRBRotation_Parms
{
	FRotator                                           NewRot;                                           		// 0x000000 (0x000C)              
	struct FName                                       BoneName;                                         		// 0x00000C (0x0008)              
};

void UPrimitiveComponent::SetRBRotation(FRotator NewRot,struct FName BoneName)
{
	static UFieldFunc* pFnSetRBRotation = NULL;
	if(!pFnSetRBRotation)
		pFnSetRBRotation = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBRotation");

	Engine_SetRBRotation_Parms SetRBRotation_Parms;
	memcpy(&SetRBRotation_Parms.NewRot,&NewRot,0xC);
	memcpy(&SetRBRotation_Parms.BoneName,&BoneName,0x8);
	pFnSetRBRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBRotation,NULL,&SetRBRotation_Parms,NULL);
	pFnSetRBRotation->FunctionFlags |= 0x400;
}

struct Engine_RetCullDistance_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float UPrimitiveComponent::RetCullDistance()
{
	static UFieldFunc* pFnRetCullDistance = NULL;
	if(!pFnRetCullDistance)
		pFnRetCullDistance = UObject::FindFunction("Function Engine.PrimitiveComponent.RetCullDistance");

	Engine_RetCullDistance_Parms RetCullDistance_Parms;
	pFnRetCullDistance->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRetCullDistance,NULL,&RetCullDistance_Parms,NULL);
	pFnRetCullDistance->FunctionFlags |= 0x400;
	return RetCullDistance_Parms.ReturnValue;
}

struct Engine_SetLightEnvironment_Parms
{
	class ULightEnvironmentComponent*                  NewLightEnvironment;                              		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetLightEnvironment(class ULightEnvironmentComponent* NewLightEnvironment)
{
	static UFieldFunc* pFnSetLightEnvironment = NULL;
	if(!pFnSetLightEnvironment)
		pFnSetLightEnvironment = UObject::FindFunction("Function Engine.PrimitiveComponent.SetLightEnvironment");

	Engine_SetLightEnvironment_Parms SetLightEnvironment_Parms;
	SetLightEnvironment_Parms.NewLightEnvironment = NewLightEnvironment;
	pFnSetLightEnvironment->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetLightEnvironment,NULL,&SetLightEnvironment_Parms,NULL);
	pFnSetLightEnvironment->FunctionFlags |= 0x400;
}

struct Engine_SetShadowParent_Parms
{
	class UPrimitiveComponent*                         NewShadowParent;                                  		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetShadowParent(class UPrimitiveComponent* NewShadowParent)
{
	static UFieldFunc* pFnSetShadowParent = NULL;
	if(!pFnSetShadowParent)
		pFnSetShadowParent = UObject::FindFunction("Function Engine.PrimitiveComponent.SetShadowParent");

	Engine_SetShadowParent_Parms SetShadowParent_Parms;
	SetShadowParent_Parms.NewShadowParent = NewShadowParent;
	pFnSetShadowParent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetShadowParent,NULL,&SetShadowParent_Parms,NULL);
	pFnSetShadowParent->FunctionFlags |= 0x400;
}

struct Engine_GetRootBodyInstance_Parms
{
	class URB_BodyInstance*                            ReturnValue;                                      		// 0x000000 (0x0004)              
};

class URB_BodyInstance* UPrimitiveComponent::GetRootBodyInstance()
{
	static UFieldFunc* pFnGetRootBodyInstance = NULL;
	if(!pFnGetRootBodyInstance)
		pFnGetRootBodyInstance = UObject::FindFunction("Function Engine.PrimitiveComponent.GetRootBodyInstance");

	Engine_GetRootBodyInstance_Parms GetRootBodyInstance_Parms;
	pFnGetRootBodyInstance->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetRootBodyInstance,NULL,&GetRootBodyInstance_Parms,NULL);
	pFnGetRootBodyInstance->FunctionFlags |= 0x400;
	return GetRootBodyInstance_Parms.ReturnValue;
}

struct Engine_SetRigidBodyIsTrigger_Parms
{
	unsigned long                                      bNewIsTrigger : 1;                                		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRigidBodyIsTrigger(bool bNewIsTrigger)
{
	static UFieldFunc* pFnSetRigidBodyIsTrigger = NULL;
	if(!pFnSetRigidBodyIsTrigger)
		pFnSetRigidBodyIsTrigger = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRigidBodyIsTrigger");

	Engine_SetRigidBodyIsTrigger_Parms SetRigidBodyIsTrigger_Parms;
	SetRigidBodyIsTrigger_Parms.bNewIsTrigger = bNewIsTrigger;
	pFnSetRigidBodyIsTrigger->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRigidBodyIsTrigger,NULL,&SetRigidBodyIsTrigger_Parms,NULL);
	pFnSetRigidBodyIsTrigger->FunctionFlags |= 0x400;
}

struct Engine_PutRigidBodyToSleep_Parms
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
};

void UPrimitiveComponent::PutRigidBodyToSleep(struct FName BoneName)
{
	static UFieldFunc* pFnPutRigidBodyToSleep = NULL;
	if(!pFnPutRigidBodyToSleep)
		pFnPutRigidBodyToSleep = UObject::FindFunction("Function Engine.PrimitiveComponent.PutRigidBodyToSleep");

	Engine_PutRigidBodyToSleep_Parms PutRigidBodyToSleep_Parms;
	memcpy(&PutRigidBodyToSleep_Parms.BoneName,&BoneName,0x8);
	pFnPutRigidBodyToSleep->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPutRigidBodyToSleep,NULL,&PutRigidBodyToSleep_Parms,NULL);
	pFnPutRigidBodyToSleep->FunctionFlags |= 0x400;
}

struct Engine_AddImpulse_Parms
{
	FVector3                                           Impulse;                                          		// 0x000000 (0x000C)              
	FVector3                                           Position;                                         		// 0x00000C (0x000C)              
	struct FName                                       BoneName;                                         		// 0x000018 (0x0008)              
	unsigned long                                      bVelChange : 1;                                   		// 0x000020 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::AddImpulse(FVector3 Impulse,FVector3 Position,struct FName BoneName,bool bVelChange)
{
	static UFieldFunc* pFnAddImpulse = NULL;
	if(!pFnAddImpulse)
		pFnAddImpulse = UObject::FindFunction("Function Engine.PrimitiveComponent.AddImpulse");

	Engine_AddImpulse_Parms AddImpulse_Parms;
	memcpy(&AddImpulse_Parms.Impulse,&Impulse,0xC);
	memcpy(&AddImpulse_Parms.Position,&Position,0xC);
	memcpy(&AddImpulse_Parms.BoneName,&BoneName,0x8);
	AddImpulse_Parms.bVelChange = bVelChange;
	pFnAddImpulse->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddImpulse,NULL,&AddImpulse_Parms,NULL);
	pFnAddImpulse->FunctionFlags |= 0x400;
}

struct Engine_SetRBPosition_Parms
{
	FVector3                                           NewPos;                                           		// 0x000000 (0x000C)              
	struct FName                                       BoneName;                                         		// 0x00000C (0x0008)              
};

void UPrimitiveComponent::SetRBPosition(FVector3 NewPos,struct FName BoneName)
{
	static UFieldFunc* pFnSetRBPosition = NULL;
	if(!pFnSetRBPosition)
		pFnSetRBPosition = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBPosition");

	Engine_SetRBPosition_Parms SetRBPosition_Parms;
	memcpy(&SetRBPosition_Parms.NewPos,&NewPos,0xC);
	memcpy(&SetRBPosition_Parms.BoneName,&BoneName,0x8);
	pFnSetRBPosition->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBPosition,NULL,&SetRBPosition_Parms,NULL);
	pFnSetRBPosition->FunctionFlags |= 0x400;
}

struct Engine_SetScale3D_Parms
{
	FVector3                                           NewScale3D;                                       		// 0x000000 (0x000C)              
};

void UPrimitiveComponent::SetScale3D(FVector3 NewScale3D)
{
	static UFieldFunc* pFnSetScale3D = NULL;
	if(!pFnSetScale3D)
		pFnSetScale3D = UObject::FindFunction("Function Engine.PrimitiveComponent.SetScale3D");

	Engine_SetScale3D_Parms SetScale3D_Parms;
	memcpy(&SetScale3D_Parms.NewScale3D,&NewScale3D,0xC);
	pFnSetScale3D->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetScale3D,NULL,&SetScale3D_Parms,NULL);
	pFnSetScale3D->FunctionFlags |= 0x400;
}

struct Engine_SetAPBCollision_Parms
{
	struct FsAPBCollision                              newAPBCollision;                                  		// 0x000000 (0x0014)              
};

void UPrimitiveComponent::SetAPBCollision(struct FsAPBCollision newAPBCollision)
{
	static UFieldFunc* pFnSetAPBCollision = NULL;
	if(!pFnSetAPBCollision)
		pFnSetAPBCollision = UObject::FindFunction("Function Engine.PrimitiveComponent.SetAPBCollision");

	Engine_SetAPBCollision_Parms SetAPBCollision_Parms;
	memcpy(&SetAPBCollision_Parms.newAPBCollision,&newAPBCollision,0x14);
	pFnSetAPBCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetAPBCollision,NULL,&SetAPBCollision_Parms,NULL);
	pFnSetAPBCollision->FunctionFlags |= 0x400;
}

struct Engine_SetBlockRigidBody_Parms
{
	unsigned long                                      bNewBlockRigidBody : 1;                           		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetBlockRigidBody(bool bNewBlockRigidBody)
{
	static UFieldFunc* pFnSetBlockRigidBody = NULL;
	if(!pFnSetBlockRigidBody)
		pFnSetBlockRigidBody = UObject::FindFunction("Function Engine.PrimitiveComponent.SetBlockRigidBody");

	Engine_SetBlockRigidBody_Parms SetBlockRigidBody_Parms;
	SetBlockRigidBody_Parms.bNewBlockRigidBody = bNewBlockRigidBody;
	pFnSetBlockRigidBody->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetBlockRigidBody,NULL,&SetBlockRigidBody_Parms,NULL);
	pFnSetBlockRigidBody->FunctionFlags |= 0x400;
}

struct Engine_InitRBPhys_Parms
{
};

void UPrimitiveComponent::InitRBPhys()
{
	static UFieldFunc* pFnInitRBPhys = NULL;
	if(!pFnInitRBPhys)
		pFnInitRBPhys = UObject::FindFunction("Function Engine.PrimitiveComponent.InitRBPhys");

	Engine_InitRBPhys_Parms InitRBPhys_Parms;
	pFnInitRBPhys->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInitRBPhys,NULL,&InitRBPhys_Parms,NULL);
	pFnInitRBPhys->FunctionFlags |= 0x400;
}

struct Engine_SetRBChannel_Parms
{
	unsigned char                                      Channel;                                          		// 0x000000 (0x0001)              
};

void UPrimitiveComponent::SetRBChannel(unsigned char Channel)
{
	static UFieldFunc* pFnSetRBChannel = NULL;
	if(!pFnSetRBChannel)
		pFnSetRBChannel = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBChannel");

	Engine_SetRBChannel_Parms SetRBChannel_Parms;
	SetRBChannel_Parms.Channel = Channel;
	pFnSetRBChannel->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBChannel,NULL,&SetRBChannel_Parms,NULL);
	pFnSetRBChannel->FunctionFlags |= 0x400;
}

struct Engine_SetRBDominanceGroup_Parms
{
	unsigned char                                      InDomGroup;                                       		// 0x000000 (0x0001)              
};

void UPrimitiveComponent::SetRBDominanceGroup(unsigned char InDomGroup)
{
	static UFieldFunc* pFnSetRBDominanceGroup = NULL;
	if(!pFnSetRBDominanceGroup)
		pFnSetRBDominanceGroup = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBDominanceGroup");

	Engine_SetRBDominanceGroup_Parms SetRBDominanceGroup_Parms;
	SetRBDominanceGroup_Parms.InDomGroup = InDomGroup;
	pFnSetRBDominanceGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBDominanceGroup,NULL,&SetRBDominanceGroup_Parms,NULL);
	pFnSetRBDominanceGroup->FunctionFlags |= 0x400;
}

struct Engine_SetOnlyOwnerSee_Parms
{
	unsigned long                                      bNewOnlyOwnerSee : 1;                             		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetOnlyOwnerSee(bool bNewOnlyOwnerSee)
{
	static UFieldFunc* pFnSetOnlyOwnerSee = NULL;
	if(!pFnSetOnlyOwnerSee)
		pFnSetOnlyOwnerSee = UObject::FindFunction("Function Engine.PrimitiveComponent.SetOnlyOwnerSee");

	Engine_SetOnlyOwnerSee_Parms SetOnlyOwnerSee_Parms;
	SetOnlyOwnerSee_Parms.bNewOnlyOwnerSee = bNewOnlyOwnerSee;
	pFnSetOnlyOwnerSee->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOnlyOwnerSee,NULL,&SetOnlyOwnerSee_Parms,NULL);
	pFnSetOnlyOwnerSee->FunctionFlags |= 0x400;
}

struct Engine_SetNotifyRigidBodyCollision_Parms
{
	unsigned long                                      bNewNotifyRigidBodyCollision : 1;                 		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision)
{
	static UFieldFunc* pFnSetNotifyRigidBodyCollision = NULL;
	if(!pFnSetNotifyRigidBodyCollision)
		pFnSetNotifyRigidBodyCollision = UObject::FindFunction("Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision");

	Engine_SetNotifyRigidBodyCollision_Parms SetNotifyRigidBodyCollision_Parms;
	SetNotifyRigidBodyCollision_Parms.bNewNotifyRigidBodyCollision = bNewNotifyRigidBodyCollision;
	pFnSetNotifyRigidBodyCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetNotifyRigidBodyCollision,NULL,&SetNotifyRigidBodyCollision_Parms,NULL);
	pFnSetNotifyRigidBodyCollision->FunctionFlags |= 0x400;
}

struct Engine_SetRBCollidesWithChannel_Parms
{
	unsigned char                                      Channel;                                          		// 0x000000 (0x0001)              
	unsigned long                                      bNewCollides : 1;                                 		// 0x000004 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRBCollidesWithChannel(unsigned char Channel,bool bNewCollides)
{
	static UFieldFunc* pFnSetRBCollidesWithChannel = NULL;
	if(!pFnSetRBCollidesWithChannel)
		pFnSetRBCollidesWithChannel = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBCollidesWithChannel");

	Engine_SetRBCollidesWithChannel_Parms SetRBCollidesWithChannel_Parms;
	SetRBCollidesWithChannel_Parms.Channel = Channel;
	SetRBCollidesWithChannel_Parms.bNewCollides = bNewCollides;
	pFnSetRBCollidesWithChannel->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBCollidesWithChannel,NULL,&SetRBCollidesWithChannel_Parms,NULL);
	pFnSetRBCollidesWithChannel->FunctionFlags |= 0x400;
}

struct Engine_WakeRigidBody_Parms
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
};

void UPrimitiveComponent::WakeRigidBody(struct FName BoneName)
{
	static UFieldFunc* pFnWakeRigidBody = NULL;
	if(!pFnWakeRigidBody)
		pFnWakeRigidBody = UObject::FindFunction("Function Engine.PrimitiveComponent.WakeRigidBody");

	Engine_WakeRigidBody_Parms WakeRigidBody_Parms;
	memcpy(&WakeRigidBody_Parms.BoneName,&BoneName,0x8);
	pFnWakeRigidBody->FunctionFlags |= ~0x400;
	ProcessEvent(pFnWakeRigidBody,NULL,&WakeRigidBody_Parms,NULL);
	pFnWakeRigidBody->FunctionFlags |= 0x400;
}

struct Engine_SetRigidBodyGravityResponse_Parms
{
	unsigned long                                      bGravityResponse : 1;                             		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRigidBodyGravityResponse(bool bGravityResponse)
{
	static UFieldFunc* pFnSetRigidBodyGravityResponse = NULL;
	if(!pFnSetRigidBodyGravityResponse)
		pFnSetRigidBodyGravityResponse = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRigidBodyGravityResponse");

	Engine_SetRigidBodyGravityResponse_Parms SetRigidBodyGravityResponse_Parms;
	SetRigidBodyGravityResponse_Parms.bGravityResponse = bGravityResponse;
	pFnSetRigidBodyGravityResponse->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRigidBodyGravityResponse,NULL,&SetRigidBodyGravityResponse_Parms,NULL);
	pFnSetRigidBodyGravityResponse->FunctionFlags |= 0x400;
}

struct Engine_AddRadialImpulse_Parms
{
	FVector3                                           Origin;                                           		// 0x000000 (0x000C)              
	float                                              Radius;                                           		// 0x00000C (0x0004)              
	float                                              Strength;                                         		// 0x000010 (0x0004)              
	unsigned char                                      Falloff;                                          		// 0x000014 (0x0001)              
	unsigned long                                      bVelChange : 1;                                   		// 0x000018 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::AddRadialImpulse(FVector3 Origin,float Radius,float Strength,unsigned char Falloff,bool bVelChange)
{
	static UFieldFunc* pFnAddRadialImpulse = NULL;
	if(!pFnAddRadialImpulse)
		pFnAddRadialImpulse = UObject::FindFunction("Function Engine.PrimitiveComponent.AddRadialImpulse");

	Engine_AddRadialImpulse_Parms AddRadialImpulse_Parms;
	memcpy(&AddRadialImpulse_Parms.Origin,&Origin,0xC);
	AddRadialImpulse_Parms.Radius = Radius;
	AddRadialImpulse_Parms.Strength = Strength;
	AddRadialImpulse_Parms.Falloff = Falloff;
	AddRadialImpulse_Parms.bVelChange = bVelChange;
	pFnAddRadialImpulse->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddRadialImpulse,NULL,&AddRadialImpulse_Parms,NULL);
	pFnAddRadialImpulse->FunctionFlags |= 0x400;
}

struct Engine_SetScale_Parms
{
	float                                              NewScale;                                         		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetScale(float NewScale)
{
	static UFieldFunc* pFnSetScale = NULL;
	if(!pFnSetScale)
		pFnSetScale = UObject::FindFunction("Function Engine.PrimitiveComponent.SetScale");

	Engine_SetScale_Parms SetScale_Parms;
	SetScale_Parms.NewScale = NewScale;
	pFnSetScale->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetScale,NULL,&SetScale_Parms,NULL);
	pFnSetScale->FunctionFlags |= 0x400;
}

struct Engine_SetLightingChannels_Parms
{
	struct FLightingChannelContainer                   NewLightingChannels;                              		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetLightingChannels(struct FLightingChannelContainer NewLightingChannels)
{
	static UFieldFunc* pFnSetLightingChannels = NULL;
	if(!pFnSetLightingChannels)
		pFnSetLightingChannels = UObject::FindFunction("Function Engine.PrimitiveComponent.SetLightingChannels");

	Engine_SetLightingChannels_Parms SetLightingChannels_Parms;
	memcpy(&SetLightingChannels_Parms.NewLightingChannels,&NewLightingChannels,0x4);
	pFnSetLightingChannels->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetLightingChannels,NULL,&SetLightingChannels_Parms,NULL);
	pFnSetLightingChannels->FunctionFlags |= 0x400;
}

struct Engine_GetRotation_Parms
{
	FRotator                                           ReturnValue;                                      		// 0x000000 (0x000C)              
};

FRotator UPrimitiveComponent::GetRotation()
{
	static UFieldFunc* pFnGetRotation = NULL;
	if(!pFnGetRotation)
		pFnGetRotation = UObject::FindFunction("Function Engine.PrimitiveComponent.GetRotation");

	Engine_GetRotation_Parms GetRotation_Parms;
	pFnGetRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetRotation,NULL,&GetRotation_Parms,NULL);
	pFnGetRotation->FunctionFlags |= 0x400;
	return GetRotation_Parms.ReturnValue;
}

struct Engine_SetRigidBodyAwake_Parms
{
	unsigned long                                      bAwake : 1;                                       		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRigidBodyAwake(bool bAwake)
{
	static UFieldFunc* pFnSetRigidBodyAwake = NULL;
	if(!pFnSetRigidBodyAwake)
		pFnSetRigidBodyAwake = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRigidBodyAwake");

	Engine_SetRigidBodyAwake_Parms SetRigidBodyAwake_Parms;
	SetRigidBodyAwake_Parms.bAwake = bAwake;
	pFnSetRigidBodyAwake->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRigidBodyAwake,NULL,&SetRigidBodyAwake_Parms,NULL);
	pFnSetRigidBodyAwake->FunctionFlags |= 0x400;
}

struct Engine_RigidBodyIsAwake_Parms
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000008 (0x0004) [0x00000001] 
};

bool UPrimitiveComponent::RigidBodyIsAwake(struct FName BoneName)
{
	static UFieldFunc* pFnRigidBodyIsAwake = NULL;
	if(!pFnRigidBodyIsAwake)
		pFnRigidBodyIsAwake = UObject::FindFunction("Function Engine.PrimitiveComponent.RigidBodyIsAwake");

	Engine_RigidBodyIsAwake_Parms RigidBodyIsAwake_Parms;
	memcpy(&RigidBodyIsAwake_Parms.BoneName,&BoneName,0x8);
	pFnRigidBodyIsAwake->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRigidBodyIsAwake,NULL,&RigidBodyIsAwake_Parms,NULL);
	pFnRigidBodyIsAwake->FunctionFlags |= 0x400;
	return RigidBodyIsAwake_Parms.ReturnValue;
}

struct Engine_AddRadialForce_Parms
{
	FVector3                                           Origin;                                           		// 0x000000 (0x000C)              
	float                                              Radius;                                           		// 0x00000C (0x0004)              
	float                                              Strength;                                         		// 0x000010 (0x0004)              
	unsigned char                                      Falloff;                                          		// 0x000014 (0x0001)              
};

void UPrimitiveComponent::AddRadialForce(FVector3 Origin,float Radius,float Strength,unsigned char Falloff)
{
	static UFieldFunc* pFnAddRadialForce = NULL;
	if(!pFnAddRadialForce)
		pFnAddRadialForce = UObject::FindFunction("Function Engine.PrimitiveComponent.AddRadialForce");

	Engine_AddRadialForce_Parms AddRadialForce_Parms;
	memcpy(&AddRadialForce_Parms.Origin,&Origin,0xC);
	AddRadialForce_Parms.Radius = Radius;
	AddRadialForce_Parms.Strength = Strength;
	AddRadialForce_Parms.Falloff = Falloff;
	pFnAddRadialForce->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddRadialForce,NULL,&AddRadialForce_Parms,NULL);
	pFnAddRadialForce->FunctionFlags |= 0x400;
}

struct Engine_SetViewOwnerDepthPriorityGroup_Parms
{
	unsigned long                                      bNewUseViewOwnerDepthPriorityGroup : 1;           		// 0x000000 (0x0004) [0x00000001] 
	unsigned char                                      NewViewOwnerDepthPriorityGroup;                   		// 0x000004 (0x0001)              
};

void UPrimitiveComponent::SetViewOwnerDepthPriorityGroup(bool bNewUseViewOwnerDepthPriorityGroup,unsigned char NewViewOwnerDepthPriorityGroup)
{
	static UFieldFunc* pFnSetViewOwnerDepthPriorityGroup = NULL;
	if(!pFnSetViewOwnerDepthPriorityGroup)
		pFnSetViewOwnerDepthPriorityGroup = UObject::FindFunction("Function Engine.PrimitiveComponent.SetViewOwnerDepthPriorityGroup");

	Engine_SetViewOwnerDepthPriorityGroup_Parms SetViewOwnerDepthPriorityGroup_Parms;
	SetViewOwnerDepthPriorityGroup_Parms.bNewUseViewOwnerDepthPriorityGroup = bNewUseViewOwnerDepthPriorityGroup;
	SetViewOwnerDepthPriorityGroup_Parms.NewViewOwnerDepthPriorityGroup = NewViewOwnerDepthPriorityGroup;
	pFnSetViewOwnerDepthPriorityGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetViewOwnerDepthPriorityGroup,NULL,&SetViewOwnerDepthPriorityGroup_Parms,NULL);
	pFnSetViewOwnerDepthPriorityGroup->FunctionFlags |= 0x400;
}

struct Engine_SetCullDistance_Parms
{
	float                                              NewCullDistance;                                  		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetCullDistance(float NewCullDistance)
{
	static UFieldFunc* pFnSetCullDistance = NULL;
	if(!pFnSetCullDistance)
		pFnSetCullDistance = UObject::FindFunction("Function Engine.PrimitiveComponent.SetCullDistance");

	Engine_SetCullDistance_Parms SetCullDistance_Parms;
	SetCullDistance_Parms.NewCullDistance = NewCullDistance;
	pFnSetCullDistance->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCullDistance,NULL,&SetCullDistance_Parms,NULL);
	pFnSetCullDistance->FunctionFlags |= 0x400;
}

struct Engine_SetActorCollision_Parms
{
	unsigned long                                      NewCollideActors : 1;                             		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      NewBlockActors : 1;                               		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      NewAlwaysCheckCollision : 1;                      		// 0x000008 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetActorCollision(bool NewCollideActors,bool NewBlockActors,bool NewAlwaysCheckCollision)
{
	static UFieldFunc* pFnSetActorCollision = NULL;
	if(!pFnSetActorCollision)
		pFnSetActorCollision = UObject::FindFunction("Function Engine.PrimitiveComponent.SetActorCollision");

	Engine_SetActorCollision_Parms SetActorCollision_Parms;
	SetActorCollision_Parms.NewCollideActors = NewCollideActors;
	SetActorCollision_Parms.NewBlockActors = NewBlockActors;
	SetActorCollision_Parms.NewAlwaysCheckCollision = NewAlwaysCheckCollision;
	pFnSetActorCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetActorCollision,NULL,&SetActorCollision_Parms,NULL);
	pFnSetActorCollision->FunctionFlags |= 0x400;
}

struct Engine_GetPosition_Parms
{
	FVector3                                           ReturnValue;                                      		// 0x000000 (0x000C)              
	//FVector3                                           Position;                                         		// 0x00000C (0x000C)              
};

FVector3 UPrimitiveComponent::GetPosition()
{
	static UFieldFunc* pFnGetPosition = NULL;
	if(!pFnGetPosition)
		pFnGetPosition = UObject::FindFunction("Function Engine.PrimitiveComponent.GetPosition");

	Engine_GetPosition_Parms GetPosition_Parms;
	ProcessEvent(pFnGetPosition,NULL,&GetPosition_Parms,NULL);
	return GetPosition_Parms.ReturnValue;
}

struct Engine_SetRBAngularVelocity_Parms
{
	FVector3                                           NewAngVel;                                        		// 0x000000 (0x000C)              
	unsigned long                                      bAddToCurrent : 1;                                		// 0x00000C (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetRBAngularVelocity(FVector3 NewAngVel,bool bAddToCurrent)
{
	static UFieldFunc* pFnSetRBAngularVelocity = NULL;
	if(!pFnSetRBAngularVelocity)
		pFnSetRBAngularVelocity = UObject::FindFunction("Function Engine.PrimitiveComponent.SetRBAngularVelocity");

	Engine_SetRBAngularVelocity_Parms SetRBAngularVelocity_Parms;
	memcpy(&SetRBAngularVelocity_Parms.NewAngVel,&NewAngVel,0xC);
	SetRBAngularVelocity_Parms.bAddToCurrent = bAddToCurrent;
	pFnSetRBAngularVelocity->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRBAngularVelocity,NULL,&SetRBAngularVelocity_Parms,NULL);
	pFnSetRBAngularVelocity->FunctionFlags |= 0x400;
}

struct Engine_SetOwnerNoSee_Parms
{
	unsigned long                                      bNewOwnerNoSee : 1;                               		// 0x000000 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetOwnerNoSee(bool bNewOwnerNoSee)
{
	static UFieldFunc* pFnSetOwnerNoSee = NULL;
	if(!pFnSetOwnerNoSee)
		pFnSetOwnerNoSee = UObject::FindFunction("Function Engine.PrimitiveComponent.SetOwnerNoSee");

	Engine_SetOwnerNoSee_Parms SetOwnerNoSee_Parms;
	SetOwnerNoSee_Parms.bNewOwnerNoSee = bNewOwnerNoSee;
	pFnSetOwnerNoSee->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOwnerNoSee,NULL,&SetOwnerNoSee_Parms,NULL);
	pFnSetOwnerNoSee->FunctionFlags |= 0x400;
}

struct Engine_SetPhysMaterialOverride_Parms
{
	class UPhysicalMaterial*                           NewPhysMaterial;                                  		// 0x000000 (0x0004)              
};

void UPrimitiveComponent::SetPhysMaterialOverride(class UPhysicalMaterial* NewPhysMaterial)
{
	static UFieldFunc* pFnSetPhysMaterialOverride = NULL;
	if(!pFnSetPhysMaterialOverride)
		pFnSetPhysMaterialOverride = UObject::FindFunction("Function Engine.PrimitiveComponent.SetPhysMaterialOverride");

	Engine_SetPhysMaterialOverride_Parms SetPhysMaterialOverride_Parms;
	SetPhysMaterialOverride_Parms.NewPhysMaterial = NewPhysMaterial;
	pFnSetPhysMaterialOverride->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetPhysMaterialOverride,NULL,&SetPhysMaterialOverride_Parms,NULL);
	pFnSetPhysMaterialOverride->FunctionFlags |= 0x400;
}

struct Engine_SetTraceBlocking_Parms
{
	unsigned long                                      NewBlockZeroExtent : 1;                           		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      NewBlockNonZeroExtent : 1;                        		// 0x000004 (0x0004) [0x00000001] 
};

void UPrimitiveComponent::SetTraceBlocking(bool NewBlockZeroExtent,bool NewBlockNonZeroExtent)
{
	static UFieldFunc* pFnSetTraceBlocking = NULL;
	if(!pFnSetTraceBlocking)
		pFnSetTraceBlocking = UObject::FindFunction("Function Engine.PrimitiveComponent.SetTraceBlocking");

	Engine_SetTraceBlocking_Parms SetTraceBlocking_Parms;
	SetTraceBlocking_Parms.NewBlockZeroExtent = NewBlockZeroExtent;
	SetTraceBlocking_Parms.NewBlockNonZeroExtent = NewBlockNonZeroExtent;
	pFnSetTraceBlocking->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTraceBlocking,NULL,&SetTraceBlocking_Parms,NULL);
	pFnSetTraceBlocking->FunctionFlags |= 0x400;
}

struct Engine_SetDepthPriorityGroup_Parms
{
	unsigned char                                      NewDepthPriorityGroup;                            		// 0x000000 (0x0001)              
};

void UPrimitiveComponent::SetDepthPriorityGroup(unsigned char NewDepthPriorityGroup)
{
	static UFieldFunc* pFnSetDepthPriorityGroup = NULL;
	if(!pFnSetDepthPriorityGroup)
		pFnSetDepthPriorityGroup = UObject::FindFunction("Function Engine.PrimitiveComponent.SetDepthPriorityGroup");

	Engine_SetDepthPriorityGroup_Parms SetDepthPriorityGroup_Parms;
	SetDepthPriorityGroup_Parms.NewDepthPriorityGroup = NewDepthPriorityGroup;
	pFnSetDepthPriorityGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDepthPriorityGroup,NULL,&SetDepthPriorityGroup_Parms,NULL);
	pFnSetDepthPriorityGroup->FunctionFlags |= 0x400;
}

struct Engine_UpdateCosmeticCollision_Parms
{
};

void UCylinderComponent::UpdateCosmeticCollision()
{
	static UFieldFunc* pFnUpdateCosmeticCollision = NULL;
	if(!pFnUpdateCosmeticCollision)
		pFnUpdateCosmeticCollision = UObject::FindFunction("Function Engine.CylinderComponent.UpdateCosmeticCollision");

	Engine_UpdateCosmeticCollision_Parms UpdateCosmeticCollision_Parms;
	pFnUpdateCosmeticCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUpdateCosmeticCollision,NULL,&UpdateCosmeticCollision_Parms,NULL);
	pFnUpdateCosmeticCollision->FunctionFlags |= 0x400;
}

struct Engine_SetCylinderSize_Parms
{
	float                                              NewRadius;                                        		// 0x000000 (0x0004)              
	float                                              NewHeight;                                        		// 0x000004 (0x0004)              
};

void UCylinderComponent::SetCylinderSize(float NewRadius,float NewHeight)
{
	static UFieldFunc* pFnSetCylinderSize = NULL;
	if(!pFnSetCylinderSize)
		pFnSetCylinderSize = UObject::FindFunction("Function Engine.CylinderComponent.SetCylinderSize");

	Engine_SetCylinderSize_Parms SetCylinderSize_Parms;
	SetCylinderSize_Parms.NewRadius = NewRadius;
	SetCylinderSize_Parms.NewHeight = NewHeight;
	pFnSetCylinderSize->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCylinderSize,NULL,&SetCylinderSize_Parms,NULL);
	pFnSetCylinderSize->FunctionFlags |= 0x400;
}

struct Engine_DestroyVFX_Parms
{
};

void UcVisualFXComponent::DestroyVFX()
{
	static UFieldFunc* pFnDestroyVFX = NULL;
	if(!pFnDestroyVFX)
		pFnDestroyVFX = UObject::FindFunction("Function Engine.cVisualFXComponent.DestroyVFX");

	Engine_DestroyVFX_Parms DestroyVFX_Parms;
	pFnDestroyVFX->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDestroyVFX,NULL,&DestroyVFX_Parms,NULL);
	pFnDestroyVFX->FunctionFlags |= 0x400;
}

struct Engine_SetEnabled_Parms
{
	unsigned long                                      bNewEnabled : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

void ULightEnvironmentComponent::SetEnabled(bool bNewEnabled)
{
	static UFieldFunc* pFnSetEnabled = NULL;
	if(!pFnSetEnabled)
		pFnSetEnabled = UObject::FindFunction("Function Engine.LightEnvironmentComponent.SetEnabled");

	Engine_SetEnabled_Parms SetEnabled_Parms;
	SetEnabled_Parms.bNewEnabled = bNewEnabled;
	pFnSetEnabled->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetEnabled,NULL,&SetEnabled_Parms,NULL);
	pFnSetEnabled->FunctionFlags |= 0x400;
}

struct Engine_GetNumElements_Parms
{
	int                                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

int UMeshComponent::GetNumElements()
{
	static UFieldFunc* pFnGetNumElements = NULL;
	if(!pFnGetNumElements)
		pFnGetNumElements = UObject::FindFunction("Function Engine.MeshComponent.GetNumElements");

	Engine_GetNumElements_Parms GetNumElements_Parms;
	pFnGetNumElements->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetNumElements,NULL,&GetNumElements_Parms,NULL);
	pFnGetNumElements->FunctionFlags |= 0x400;
	return GetNumElements_Parms.ReturnValue;
}

struct Engine_CreateAndSetMaterialInstanceTimeVarying_Parms
{
	int                                                ElementIndex;                                     		// 0x000000 (0x0004)              
	class UMaterialInstanceTimeVarying*                ReturnValue;                                      		// 0x000004 (0x0004)              
	//class UMaterialInstanceTimeVarying*                Instance;                                         		// 0x000008 (0x0004)              
};

class UMaterialInstanceTimeVarying* UMeshComponent::CreateAndSetMaterialInstanceTimeVarying(int ElementIndex)
{
	static UFieldFunc* pFnCreateAndSetMaterialInstanceTimeVarying = NULL;
	if(!pFnCreateAndSetMaterialInstanceTimeVarying)
		pFnCreateAndSetMaterialInstanceTimeVarying = UObject::FindFunction("Function Engine.MeshComponent.CreateAndSetMaterialInstanceTimeVarying");

	Engine_CreateAndSetMaterialInstanceTimeVarying_Parms CreateAndSetMaterialInstanceTimeVarying_Parms;
	CreateAndSetMaterialInstanceTimeVarying_Parms.ElementIndex = ElementIndex;
	ProcessEvent(pFnCreateAndSetMaterialInstanceTimeVarying,NULL,&CreateAndSetMaterialInstanceTimeVarying_Parms,NULL);
	return CreateAndSetMaterialInstanceTimeVarying_Parms.ReturnValue;
}

struct Engine_GetMaterial_Parms
{
	int                                                ElementIndex;                                     		// 0x000000 (0x0004)              
	class UMaterialInterface*                          ReturnValue;                                      		// 0x000004 (0x0004)              
};

class UMaterialInterface* UMeshComponent::GetMaterial(int ElementIndex)
{
	static UFieldFunc* pFnGetMaterial = NULL;
	if(!pFnGetMaterial)
		pFnGetMaterial = UObject::FindFunction("Function Engine.MeshComponent.GetMaterial");

	Engine_GetMaterial_Parms GetMaterial_Parms;
	GetMaterial_Parms.ElementIndex = ElementIndex;
	pFnGetMaterial->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetMaterial,NULL,&GetMaterial_Parms,NULL);
	pFnGetMaterial->FunctionFlags |= 0x400;
	return GetMaterial_Parms.ReturnValue;
}

struct Engine_SetMaterial_Parms
{
	int                                                ElementIndex;                                     		// 0x000000 (0x0004)              
	class UMaterialInterface*                          Material;                                         		// 0x000004 (0x0004)              
};

void UMeshComponent::SetMaterial(int ElementIndex,class UMaterialInterface* Material)
{
	static UFieldFunc* pFnSetMaterial = NULL;
	if(!pFnSetMaterial)
		pFnSetMaterial = UObject::FindFunction("Function Engine.MeshComponent.SetMaterial");

	Engine_SetMaterial_Parms SetMaterial_Parms;
	SetMaterial_Parms.ElementIndex = ElementIndex;
	SetMaterial_Parms.Material = Material;
	pFnSetMaterial->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetMaterial,NULL,&SetMaterial_Parms,NULL);
	pFnSetMaterial->FunctionFlags |= 0x400;
}

struct Engine_CreateAndSetMaterialInstanceConstant_Parms
{
	int                                                ElementIndex;                                     		// 0x000000 (0x0004)              
	class UMaterialInstanceConstant*                   ReturnValue;                                      		// 0x000004 (0x0004)              
	//class UMaterialInstanceConstant*                   Instance;                                         		// 0x000008 (0x0004)              
};

class UMaterialInstanceConstant* UMeshComponent::CreateAndSetMaterialInstanceConstant(int ElementIndex)
{
	static UFieldFunc* pFnCreateAndSetMaterialInstanceConstant = NULL;
	if(!pFnCreateAndSetMaterialInstanceConstant)
		pFnCreateAndSetMaterialInstanceConstant = UObject::FindFunction("Function Engine.MeshComponent.CreateAndSetMaterialInstanceConstant");

	Engine_CreateAndSetMaterialInstanceConstant_Parms CreateAndSetMaterialInstanceConstant_Parms;
	CreateAndSetMaterialInstanceConstant_Parms.ElementIndex = ElementIndex;
	ProcessEvent(pFnCreateAndSetMaterialInstanceConstant,NULL,&CreateAndSetMaterialInstanceConstant_Parms,NULL);
	return CreateAndSetMaterialInstanceConstant_Parms.ReturnValue;
}

struct Engine_SetStaticMesh_Parms
{
	class UStaticMesh*                                 NewMesh;                                          		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool UStaticMeshComponent::SetStaticMesh(class UStaticMesh* NewMesh)
{
	static UFieldFunc* pFnSetStaticMesh = NULL;
	if(!pFnSetStaticMesh)
		pFnSetStaticMesh = UObject::FindFunction("Function Engine.StaticMeshComponent.SetStaticMesh");

	Engine_SetStaticMesh_Parms SetStaticMesh_Parms;
	SetStaticMesh_Parms.NewMesh = NewMesh;
	pFnSetStaticMesh->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetStaticMesh,NULL,&SetStaticMesh_Parms,NULL);
	pFnSetStaticMesh->FunctionFlags |= 0x400;
	return SetStaticMesh_Parms.ReturnValue;
}

struct Engine_DisableRBCollisionWithSMC_Parms
{
	class UStaticMeshComponent*                        OtherSMC;                                         		// 0x000000 (0x0004)              
	unsigned long                                      bDisabled : 1;                                    		// 0x000004 (0x0004) [0x00000001] 
};

void UStaticMeshComponent::DisableRBCollisionWithSMC(class UStaticMeshComponent* OtherSMC,bool bDisabled)
{
	static UFieldFunc* pFnDisableRBCollisionWithSMC = NULL;
	if(!pFnDisableRBCollisionWithSMC)
		pFnDisableRBCollisionWithSMC = UObject::FindFunction("Function Engine.StaticMeshComponent.DisableRBCollisionWithSMC");

	Engine_DisableRBCollisionWithSMC_Parms DisableRBCollisionWithSMC_Parms;
	DisableRBCollisionWithSMC_Parms.OtherSMC = OtherSMC;
	DisableRBCollisionWithSMC_Parms.bDisabled = bDisabled;
	pFnDisableRBCollisionWithSMC->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDisableRBCollisionWithSMC,NULL,&DisableRBCollisionWithSMC_Parms,NULL);
	pFnDisableRBCollisionWithSMC->FunctionFlags |= 0x400;
}

struct Engine_GetMediumFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UFont* UEngine::GetMediumFont()
{
	static UFieldFunc* pFnGetMediumFont = NULL;
	if(!pFnGetMediumFont)
		pFnGetMediumFont = UObject::FindFunction("Function Engine.Engine.GetMediumFont");

	Engine_GetMediumFont_Parms GetMediumFont_Parms;
	pFnGetMediumFont->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetMediumFont,NULL,&GetMediumFont_Parms,NULL);
	pFnGetMediumFont->FunctionFlags |= 0x400;
	return GetMediumFont_Parms.ReturnValue;
}

struct Engine_GetEngine_Parms
{
	class UEngine*                                     ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UEngine* UEngine::GetEngine()
{
	static UFieldFunc* pFnGetEngine = NULL;
	if(!pFnGetEngine)
		pFnGetEngine = UObject::FindFunction("Function Engine.Engine.GetEngine");

	Engine_GetEngine_Parms GetEngine_Parms;
	pFnGetEngine->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetEngine,NULL,&GetEngine_Parms,NULL);
	pFnGetEngine->FunctionFlags |= 0x400;
	return GetEngine_Parms.ReturnValue;
}

struct Engine_OnConnectSuccess_Parms
{
};

void UEngine::OnConnectSuccess()
{
	static UFieldFunc* pFnOnConnectSuccess = NULL;
	if(!pFnOnConnectSuccess)
		pFnOnConnectSuccess = UObject::FindFunction("Function Engine.Engine.OnConnectSuccess");

	Engine_OnConnectSuccess_Parms OnConnectSuccess_Parms;
	ProcessEvent(pFnOnConnectSuccess,NULL,&OnConnectSuccess_Parms,NULL);
}

struct Engine_GetGEngine_Parms
{
	class UEngine*                                     ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UEngine* UEngine::GetGEngine()
{
	static UFieldFunc* pFnGetGEngine = NULL;
	if(!pFnGetGEngine)
		pFnGetGEngine = UObject::FindFunction("Function Engine.Engine.GetGEngine");

	Engine_GetGEngine_Parms GetGEngine_Parms;
	pFnGetGEngine->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetGEngine,NULL,&GetGEngine_Parms,NULL);
	pFnGetGEngine->FunctionFlags |= 0x400;
	return GetGEngine_Parms.ReturnValue;
}

struct Engine_OnBeginPlay_Parms
{
};

void UEngine::OnBeginPlay()
{
	static UFieldFunc* pFnOnBeginPlay = NULL;
	if(!pFnOnBeginPlay)
		pFnOnBeginPlay = UObject::FindFunction("Function Engine.Engine.OnBeginPlay");

	Engine_OnBeginPlay_Parms OnBeginPlay_Parms;
	ProcessEvent(pFnOnBeginPlay,NULL,&OnBeginPlay_Parms,NULL);
}

struct Engine_GetAdditionalFont_Parms
{
	int                                                AdditionalFontIndex;                              		// 0x000000 (0x0004)              
	class UFont*                                       ReturnValue;                                      		// 0x000004 (0x0004)              
};

class UFont* UEngine::GetAdditionalFont(int AdditionalFontIndex)
{
	static UFieldFunc* pFnGetAdditionalFont = NULL;
	if(!pFnGetAdditionalFont)
		pFnGetAdditionalFont = UObject::FindFunction("Function Engine.Engine.GetAdditionalFont");

	Engine_GetAdditionalFont_Parms GetAdditionalFont_Parms;
	GetAdditionalFont_Parms.AdditionalFontIndex = AdditionalFontIndex;
	pFnGetAdditionalFont->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetAdditionalFont,NULL,&GetAdditionalFont_Parms,NULL);
	pFnGetAdditionalFont->FunctionFlags |= 0x400;
	return GetAdditionalFont_Parms.ReturnValue;
}

struct Engine_GetTinyFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UFont* UEngine::GetTinyFont()
{
	static UFieldFunc* pFnGetTinyFont = NULL;
	if(!pFnGetTinyFont)
		pFnGetTinyFont = UObject::FindFunction("Function Engine.Engine.GetTinyFont");

	Engine_GetTinyFont_Parms GetTinyFont_Parms;
	pFnGetTinyFont->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTinyFont,NULL,&GetTinyFont_Parms,NULL);
	pFnGetTinyFont->FunctionFlags |= 0x400;
	return GetTinyFont_Parms.ReturnValue;
}

struct Engine_GetSmallFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UFont* UEngine::GetSmallFont()
{
	static UFieldFunc* pFnGetSmallFont = NULL;
	if(!pFnGetSmallFont)
		pFnGetSmallFont = UObject::FindFunction("Function Engine.Engine.GetSmallFont");

	Engine_GetSmallFont_Parms GetSmallFont_Parms;
	pFnGetSmallFont->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetSmallFont,NULL,&GetSmallFont_Parms,NULL);
	pFnGetSmallFont->FunctionFlags |= 0x400;
	return GetSmallFont_Parms.ReturnValue;
}

struct Engine_AddOverlay_Parms
{
	class UFont*                                       Font;                                             		// 0x000000 (0x0004)              
	struct FString                                     Text;                                             		// 0x000004 (0x000C)              
	float                                              X;                                                		// 0x000010 (0x0004)              
	float                                              Y;                                                		// 0x000014 (0x0004)              
	float                                              ScaleX;                                           		// 0x000018 (0x0004)              
	float                                              ScaleY;                                           		// 0x00001C (0x0004)              
	unsigned long                                      bIsCentered : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

void UEngine::AddOverlay(class UFont* Font,struct FString Text,float X,float Y,float ScaleX,float ScaleY,bool bIsCentered)
{
	static UFieldFunc* pFnAddOverlay = NULL;
	if(!pFnAddOverlay)
		pFnAddOverlay = UObject::FindFunction("Function Engine.Engine.AddOverlay");

	Engine_AddOverlay_Parms AddOverlay_Parms;
	AddOverlay_Parms.Font = Font;
	memcpy(&AddOverlay_Parms.Text,&Text,0xC);
	AddOverlay_Parms.X = X;
	AddOverlay_Parms.Y = Y;
	AddOverlay_Parms.ScaleX = ScaleX;
	AddOverlay_Parms.ScaleY = ScaleY;
	AddOverlay_Parms.bIsCentered = bIsCentered;
	pFnAddOverlay->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddOverlay,NULL,&AddOverlay_Parms,NULL);
	pFnAddOverlay->FunctionFlags |= 0x400;
}

struct Engine_ReportScriptVersion_Parms
{
};

void UEngine::ReportScriptVersion()
{
	static UFieldFunc* pFnReportScriptVersion = NULL;
	if(!pFnReportScriptVersion)
		pFnReportScriptVersion = UObject::FindFunction("Function Engine.Engine.ReportScriptVersion");

	Engine_ReportScriptVersion_Parms ReportScriptVersion_Parms;
	ProcessEvent(pFnReportScriptVersion,NULL,&ReportScriptVersion_Parms,NULL);
}

struct Engine_GetLastMovieName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x000000 (0x000C)              
};

struct FString UEngine::GetLastMovieName()
{
	static UFieldFunc* pFnGetLastMovieName = NULL;
	if(!pFnGetLastMovieName)
		pFnGetLastMovieName = UObject::FindFunction("Function Engine.Engine.GetLastMovieName");

	Engine_GetLastMovieName_Parms GetLastMovieName_Parms;
	pFnGetLastMovieName->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetLastMovieName,NULL,&GetLastMovieName_Parms,NULL);
	pFnGetLastMovieName->FunctionFlags |= 0x400;
	return GetLastMovieName_Parms.ReturnValue;
}

struct Engine_IsSplitScreen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UEngine::IsSplitScreen()
{
	static UFieldFunc* pFnIsSplitScreen = NULL;
	if(!pFnIsSplitScreen)
		pFnIsSplitScreen = UObject::FindFunction("Function Engine.Engine.IsSplitScreen");

	Engine_IsSplitScreen_Parms IsSplitScreen_Parms;
	pFnIsSplitScreen->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsSplitScreen,NULL,&IsSplitScreen_Parms,NULL);
	pFnIsSplitScreen->FunctionFlags |= 0x400;
	return IsSplitScreen_Parms.ReturnValue;
}

struct Engine_GetCurrentWorldInfo_Parms
{
	class AWorldInfo*                                  ReturnValue;                                      		// 0x000000 (0x0004)              
};

class AWorldInfo* UEngine::GetCurrentWorldInfo()
{
	static UFieldFunc* pFnGetCurrentWorldInfo = NULL;
	if(!pFnGetCurrentWorldInfo)
		pFnGetCurrentWorldInfo = UObject::FindFunction("Function Engine.Engine.GetCurrentWorldInfo");

	Engine_GetCurrentWorldInfo_Parms GetCurrentWorldInfo_Parms;
	pFnGetCurrentWorldInfo->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetCurrentWorldInfo,NULL,&GetCurrentWorldInfo_Parms,NULL);
	pFnGetCurrentWorldInfo->FunctionFlags |= 0x400;
	return GetCurrentWorldInfo_Parms.ReturnValue;
}

struct Engine_GetAudioDevice_Parms
{
	class UAudioDevice*                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UAudioDevice* UEngine::GetAudioDevice()
{
	static UFieldFunc* pFnGetAudioDevice = NULL;
	if(!pFnGetAudioDevice)
		pFnGetAudioDevice = UObject::FindFunction("Function Engine.Engine.GetAudioDevice");

	Engine_GetAudioDevice_Parms GetAudioDevice_Parms;
	pFnGetAudioDevice->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetAudioDevice,NULL,&GetAudioDevice_Parms,NULL);
	pFnGetAudioDevice->FunctionFlags |= 0x400;
	return GetAudioDevice_Parms.ReturnValue;
}

struct Engine_RemoveAllOverlays_Parms
{
};

void UEngine::RemoveAllOverlays()
{
	static UFieldFunc* pFnRemoveAllOverlays = NULL;
	if(!pFnRemoveAllOverlays)
		pFnRemoveAllOverlays = UObject::FindFunction("Function Engine.Engine.RemoveAllOverlays");

	Engine_RemoveAllOverlays_Parms RemoveAllOverlays_Parms;
	pFnRemoveAllOverlays->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRemoveAllOverlays,NULL,&RemoveAllOverlays_Parms,NULL);
	pFnRemoveAllOverlays->FunctionFlags |= 0x400;
}

struct Engine_GetLargeFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UFont* UEngine::GetLargeFont()
{
	static UFieldFunc* pFnGetLargeFont = NULL;
	if(!pFnGetLargeFont)
		pFnGetLargeFont = UObject::FindFunction("Function Engine.Engine.GetLargeFont");

	Engine_GetLargeFont_Parms GetLargeFont_Parms;
	pFnGetLargeFont->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetLargeFont,NULL,&GetLargeFont_Parms,NULL);
	pFnGetLargeFont->FunctionFlags |= 0x400;
	return GetLargeFont_Parms.ReturnValue;
}

struct Engine_OnConnectFailed_Parms
{
	int                                                nError;                                           		// 0x000000 (0x0004)              
};

void UEngine::OnConnectFailed(int nError)
{
	static UFieldFunc* pFnOnConnectFailed = NULL;
	if(!pFnOnConnectFailed)
		pFnOnConnectFailed = UObject::FindFunction("Function Engine.Engine.OnConnectFailed");

	Engine_OnConnectFailed_Parms OnConnectFailed_Parms;
	OnConnectFailed_Parms.nError = nError;
	ProcessEvent(pFnOnConnectFailed,NULL,&OnConnectFailed_Parms,NULL);
}

struct Engine_OnWorldCleanup_Parms
{
};

void UEngine::OnWorldCleanup()
{
	static UFieldFunc* pFnOnWorldCleanup = NULL;
	if(!pFnOnWorldCleanup)
		pFnOnWorldCleanup = UObject::FindFunction("Function Engine.Engine.OnWorldCleanup");

	Engine_OnWorldCleanup_Parms OnWorldCleanup_Parms;
	pFnOnWorldCleanup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOnWorldCleanup,NULL,&OnWorldCleanup_Parms,NULL);
	pFnOnWorldCleanup->FunctionFlags |= 0x400;
}

struct Engine_PlayLoadMapMovie_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool UEngine::PlayLoadMapMovie()
{
	static UFieldFunc* pFnPlayLoadMapMovie = NULL;
	if(!pFnPlayLoadMapMovie)
		pFnPlayLoadMapMovie = UObject::FindFunction("Function Engine.Engine.PlayLoadMapMovie");

	Engine_PlayLoadMapMovie_Parms PlayLoadMapMovie_Parms;
	pFnPlayLoadMapMovie->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPlayLoadMapMovie,NULL,&PlayLoadMapMovie_Parms,NULL);
	pFnPlayLoadMapMovie->FunctionFlags |= 0x400;
	return PlayLoadMapMovie_Parms.ReturnValue;
}

struct Engine_AddOverlayWrapped_Parms
{
	class UFont*                                       Font;                                             		// 0x000000 (0x0004)              
	struct FString                                     Text;                                             		// 0x000004 (0x000C)              
	float                                              X;                                                		// 0x000010 (0x0004)              
	float                                              Y;                                                		// 0x000014 (0x0004)              
	float                                              ScaleX;                                           		// 0x000018 (0x0004)              
	float                                              ScaleY;                                           		// 0x00001C (0x0004)              
	float                                              WrapWidth;                                        		// 0x000020 (0x0004)              
};

void UEngine::AddOverlayWrapped(class UFont* Font,struct FString Text,float X,float Y,float ScaleX,float ScaleY,float WrapWidth)
{
	static UFieldFunc* pFnAddOverlayWrapped = NULL;
	if(!pFnAddOverlayWrapped)
		pFnAddOverlayWrapped = UObject::FindFunction("Function Engine.Engine.AddOverlayWrapped");

	Engine_AddOverlayWrapped_Parms AddOverlayWrapped_Parms;
	AddOverlayWrapped_Parms.Font = Font;
	memcpy(&AddOverlayWrapped_Parms.Text,&Text,0xC);
	AddOverlayWrapped_Parms.X = X;
	AddOverlayWrapped_Parms.Y = Y;
	AddOverlayWrapped_Parms.ScaleX = ScaleX;
	AddOverlayWrapped_Parms.ScaleY = ScaleY;
	AddOverlayWrapped_Parms.WrapWidth = WrapWidth;
	pFnAddOverlayWrapped->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAddOverlayWrapped,NULL,&AddOverlayWrapped_Parms,NULL);
	pFnAddOverlayWrapped->FunctionFlags |= 0x400;
}

struct Engine_StopMovie_Parms
{
	unsigned long                                      bDelayStopUntilGameHasRendered : 1;               		// 0x000000 (0x0004) [0x00000001] 
};

void UEngine::StopMovie(bool bDelayStopUntilGameHasRendered)
{
	static UFieldFunc* pFnStopMovie = NULL;
	if(!pFnStopMovie)
		pFnStopMovie = UObject::FindFunction("Function Engine.Engine.StopMovie");

	Engine_StopMovie_Parms StopMovie_Parms;
	StopMovie_Parms.bDelayStopUntilGameHasRendered = bDelayStopUntilGameHasRendered;
	pFnStopMovie->FunctionFlags |= ~0x400;
	ProcessEvent(pFnStopMovie,NULL,&StopMovie_Parms,NULL);
	pFnStopMovie->FunctionFlags |= 0x400;
}

struct Engine_GetOnlineSubsystem_Parms
{
	class UOnlineSubsystem*                            ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UOnlineSubsystem* UGameEngine::GetOnlineSubsystem()
{
	static UFieldFunc* pFnGetOnlineSubsystem = NULL;
	if(!pFnGetOnlineSubsystem)
		pFnGetOnlineSubsystem = UObject::FindFunction("Function Engine.GameEngine.GetOnlineSubsystem");

	Engine_GetOnlineSubsystem_Parms GetOnlineSubsystem_Parms;
	pFnGetOnlineSubsystem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetOnlineSubsystem,NULL,&GetOnlineSubsystem_Parms,NULL);
	pFnGetOnlineSubsystem->FunctionFlags |= 0x400;
	return GetOnlineSubsystem_Parms.ReturnValue;
}

struct Engine_GetTargetLocation_Parms
{
	class AActor*                                      RequestedBy;                                      		// 0x000000 (0x0004)              
	unsigned long                                      bRequestAlternateLoc : 1;                         		// 0x000004 (0x0004) [0x00000001] 
	FVector3                                           ReturnValue;                                      		// 0x000008 (0x000C)              
};

FVector3 AActor::GetTargetLocation(class AActor* RequestedBy,bool bRequestAlternateLoc)
{
	static UFieldFunc* pFnGetTargetLocation = NULL;
	if(!pFnGetTargetLocation)
		pFnGetTargetLocation = UObject::FindFunction("Function Engine.Actor.GetTargetLocation");

	Engine_GetTargetLocation_Parms GetTargetLocation_Parms;
	GetTargetLocation_Parms.RequestedBy = RequestedBy;
	GetTargetLocation_Parms.bRequestAlternateLoc = bRequestAlternateLoc;
	pFnGetTargetLocation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTargetLocation,NULL,&GetTargetLocation_Parms,NULL);
	pFnGetTargetLocation->FunctionFlags |= 0x400;
	return GetTargetLocation_Parms.ReturnValue;
}

struct Engine_CheckHitInfo_Parms
{
	struct FTraceHitInfo                               HitInfo;                                          		// 0x000000 (0x001C)              
	class UPrimitiveComponent*                         FallBackComponent;                                		// 0x00001C (0x0004)              
	FVector3                                           Dir;                                              		// 0x000020 (0x000C)              
	FVector3                                           out_HitLocation;                                  		// 0x00002C (0x000C)              
	//FVector3                                           out_NewHitLocation;                               		// 0x000038 (0x000C)              
	//FVector3                                           out_HitNormal;                                    		// 0x000044 (0x000C)              
	//FVector3                                           TraceEnd;                                         		// 0x000050 (0x000C)              
	//FVector3                                           TraceStart;                                       		// 0x00005C (0x000C)              
	//struct FTraceHitInfo                               newHitInfo;                                       		// 0x000068 (0x001C)              
};

void AActor::CheckHitInfo(struct FTraceHitInfo* HitInfo,class UPrimitiveComponent* FallBackComponent,FVector3 Dir,FVector3* out_HitLocation)
{
	static UFieldFunc* pFnCheckHitInfo = NULL;
	if(!pFnCheckHitInfo)
		pFnCheckHitInfo = UObject::FindFunction("Function Engine.Actor.CheckHitInfo");

	Engine_CheckHitInfo_Parms CheckHitInfo_Parms;
	CheckHitInfo_Parms.FallBackComponent = FallBackComponent;
	memcpy(&CheckHitInfo_Parms.Dir,&Dir,0xC);
	ProcessEvent(pFnCheckHitInfo,NULL,&CheckHitInfo_Parms,NULL);
	if(HitInfo)
		memcpy(HitInfo,&CheckHitInfo_Parms.HitInfo,0x1C);
	if(out_HitLocation)
		memcpy(out_HitLocation,&CheckHitInfo_Parms.out_HitLocation,0xC);
}

struct Engine_EncroachingOn_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::EncroachingOn(class AActor* Other)
{
	static UFieldFunc* pFnEncroachingOn = NULL;
	if(!pFnEncroachingOn)
		pFnEncroachingOn = UObject::FindFunction("Function Engine.Actor.EncroachingOn");

	Engine_EncroachingOn_Parms EncroachingOn_Parms;
	EncroachingOn_Parms.Other = Other;
	ProcessEvent(pFnEncroachingOn,NULL,&EncroachingOn_Parms,NULL);
	return EncroachingOn_Parms.ReturnValue;
}

struct Engine_OnDestroy_Parms
{
	class USeqAct_Destroy*                             Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnDestroy(class USeqAct_Destroy* Action)
{
	static UFieldFunc* pFnOnDestroy = NULL;
	if(!pFnOnDestroy)
		pFnOnDestroy = UObject::FindFunction("Function Engine.Actor.OnDestroy");

	Engine_OnDestroy_Parms OnDestroy_Parms;
	OnDestroy_Parms.Action = Action;
	ProcessEvent(pFnOnDestroy,NULL,&OnDestroy_Parms,NULL);
}

struct Engine_GetVFXComponent_Parms
{
	class UcVisualFXComponent*                         ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UcVisualFXComponent* AActor::GetVFXComponent()
{
	static UFieldFunc* pFnGetVFXComponent = NULL;
	if(!pFnGetVFXComponent)
		pFnGetVFXComponent = UObject::FindFunction("Function Engine.Actor.GetVFXComponent");

	Engine_GetVFXComponent_Parms GetVFXComponent_Parms;
	pFnGetVFXComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetVFXComponent,NULL,&GetVFXComponent_Parms,NULL);
	pFnGetVFXComponent->FunctionFlags |= 0x400;
	return GetVFXComponent_Parms.ReturnValue;
}

struct Engine_OnRanOver_Parms
{
	class ASVehicle*                                   Vehicle;                                          		// 0x000000 (0x0004)              
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x000004 (0x0004)              
	int                                                WheelIndex;                                       		// 0x000008 (0x0004)              
};

void AActor::OnRanOver(class ASVehicle* Vehicle,class UPrimitiveComponent* RunOverComponent,int WheelIndex)
{
	static UFieldFunc* pFnOnRanOver = NULL;
	if(!pFnOnRanOver)
		pFnOnRanOver = UObject::FindFunction("Function Engine.Actor.OnRanOver");

	Engine_OnRanOver_Parms OnRanOver_Parms;
	OnRanOver_Parms.Vehicle = Vehicle;
	OnRanOver_Parms.RunOverComponent = RunOverComponent;
	OnRanOver_Parms.WheelIndex = WheelIndex;
	ProcessEvent(pFnOnRanOver,NULL,&OnRanOver_Parms,NULL);
}

struct Engine_FindSpot_Parms
{
	FVector3                                           BoxExtent;                                        		// 0x000000 (0x000C)              
	FVector3                                           SpotLocation;                                     		// 0x00000C (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool AActor::FindSpot(FVector3 BoxExtent,FVector3* SpotLocation)
{
	static UFieldFunc* pFnFindSpot = NULL;
	if(!pFnFindSpot)
		pFnFindSpot = UObject::FindFunction("Function Engine.Actor.FindSpot");

	Engine_FindSpot_Parms FindSpot_Parms;
	memcpy(&FindSpot_Parms.BoxExtent,&BoxExtent,0xC);
	pFnFindSpot->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFindSpot,NULL,&FindSpot_Parms,NULL);
	pFnFindSpot->FunctionFlags |= 0x400;
	if(SpotLocation)
		memcpy(SpotLocation,&FindSpot_Parms.SpotLocation,0xC);
	return FindSpot_Parms.ReturnValue;
}

struct Engine_DrawDebugSphere_Parms
{
	FVector3                                           Center;                                           		// 0x000000 (0x000C)              
	float                                              Radius;                                           		// 0x00000C (0x0004)              
	int                                                Segments;                                         		// 0x000010 (0x0004)              
	unsigned char                                      R;                                                		// 0x000014 (0x0001)              
	unsigned char                                      G;                                                		// 0x000015 (0x0001)              
	unsigned char                                      B;                                                		// 0x000016 (0x0001)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x000018 (0x0004) [0x00000001] 
};

void AActor::DrawDebugSphere(FVector3 Center,float Radius,int Segments,unsigned char R,unsigned char G,unsigned char B,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugSphere = NULL;
	if(!pFnDrawDebugSphere)
		pFnDrawDebugSphere = UObject::FindFunction("Function Engine.Actor.DrawDebugSphere");

	Engine_DrawDebugSphere_Parms DrawDebugSphere_Parms;
	memcpy(&DrawDebugSphere_Parms.Center,&Center,0xC);
	DrawDebugSphere_Parms.Radius = Radius;
	DrawDebugSphere_Parms.Segments = Segments;
	DrawDebugSphere_Parms.R = R;
	DrawDebugSphere_Parms.G = G;
	DrawDebugSphere_Parms.B = B;
	DrawDebugSphere_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugSphere->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugSphere,NULL,&DrawDebugSphere_Parms,NULL);
	pFnDrawDebugSphere->FunctionFlags |= 0x400;
}

struct Engine_InIllegalLocation_APB_Parms
{
	struct FString                                     sErrorMessage;                                    		// 0x000000 (0x000C)              
};

void AActor::InIllegalLocation_APB(struct FString sErrorMessage)
{
	static UFieldFunc* pFnInIllegalLocation_APB = NULL;
	if(!pFnInIllegalLocation_APB)
		pFnInIllegalLocation_APB = UObject::FindFunction("Function Engine.Actor.InIllegalLocation_APB");

	Engine_InIllegalLocation_APB_Parms InIllegalLocation_APB_Parms;
	memcpy(&InIllegalLocation_APB_Parms.sErrorMessage,&sErrorMessage,0xC);
	pFnInIllegalLocation_APB->FunctionFlags |= ~0x400;
	ProcessEvent(pFnInIllegalLocation_APB,NULL,&InIllegalLocation_APB_Parms,NULL);
	pFnInIllegalLocation_APB->FunctionFlags |= 0x400;
}

struct Engine_ForceNetRelevant_Parms
{
};

void AActor::ForceNetRelevant()
{
	static UFieldFunc* pFnForceNetRelevant = NULL;
	if(!pFnForceNetRelevant)
		pFnForceNetRelevant = UObject::FindFunction("Function Engine.Actor.ForceNetRelevant");

	Engine_ForceNetRelevant_Parms ForceNetRelevant_Parms;
	ProcessEvent(pFnForceNetRelevant,NULL,&ForceNetRelevant_Parms,NULL);
}

struct Engine_OnHealDamage_Parms
{
	class USeqAct_HealDamage*                          Action;                                           		// 0x000000 (0x0004)              
	//class AController*                                 InstigatorController;                             		// 0x000004 (0x0004)              
	//class APawn*                                       InstigatorPawn;                                   		// 0x000008 (0x0004)              
};

void AActor::OnHealDamage(class USeqAct_HealDamage* Action)
{
	static UFieldFunc* pFnOnHealDamage = NULL;
	if(!pFnOnHealDamage)
		pFnOnHealDamage = UObject::FindFunction("Function Engine.Actor.OnHealDamage");

	Engine_OnHealDamage_Parms OnHealDamage_Parms;
	OnHealDamage_Parms.Action = Action;
	ProcessEvent(pFnOnHealDamage,NULL,&OnHealDamage_Parms,NULL);
}

struct Engine_ReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x000000 (0x0008)              
};

void AActor::ReplicatedEvent(struct FName VarName)
{
	static UFieldFunc* pFnReplicatedEvent = NULL;
	if(!pFnReplicatedEvent)
		pFnReplicatedEvent = UObject::FindFunction("Function Engine.Actor.ReplicatedEvent");

	Engine_ReplicatedEvent_Parms ReplicatedEvent_Parms;
	memcpy(&ReplicatedEvent_Parms.VarName,&VarName,0x8);
	ProcessEvent(pFnReplicatedEvent,NULL,&ReplicatedEvent_Parms,NULL);
}

struct Engine_SourceActorAllowCameraBlockingTest_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::SourceActorAllowCameraBlockingTest()
{
	static UFieldFunc* pFnSourceActorAllowCameraBlockingTest = NULL;
	if(!pFnSourceActorAllowCameraBlockingTest)
		pFnSourceActorAllowCameraBlockingTest = UObject::FindFunction("Function Engine.Actor.SourceActorAllowCameraBlockingTest");

	Engine_SourceActorAllowCameraBlockingTest_Parms SourceActorAllowCameraBlockingTest_Parms;
	pFnSourceActorAllowCameraBlockingTest->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSourceActorAllowCameraBlockingTest,NULL,&SourceActorAllowCameraBlockingTest_Parms,NULL);
	pFnSourceActorAllowCameraBlockingTest->FunctionFlags |= 0x400;
	return SourceActorAllowCameraBlockingTest_Parms.ReturnValue;
}

struct Engine_FinishAnim_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x000000 (0x0004)              
};

void AActor::FinishAnim(class UAnimNodeSequence* SeqNode)
{
	static UFieldFunc* pFnFinishAnim = NULL;
	if(!pFnFinishAnim)
		pFnFinishAnim = UObject::FindFunction("Function Engine.Actor.FinishAnim");

	Engine_FinishAnim_Parms FinishAnim_Parms;
	FinishAnim_Parms.SeqNode = SeqNode;

	unsigned short NativeIndex = pFnFinishAnim->iNative;
	pFnFinishAnim->iNative = 0;
	pFnFinishAnim->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFinishAnim,NULL,&FinishAnim_Parms,NULL);
	pFnFinishAnim->FunctionFlags |= 0x400;
	pFnFinishAnim->iNative = NativeIndex;
}

struct Engine_LocalPlayerControllers_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class APlayerController*                           PC;                                               		// 0x000004 (0x0004)              
};

void AActor::LocalPlayerControllers(class UClass* BaseClass,class APlayerController** PC)
{
	static UFieldFunc* pFnLocalPlayerControllers = NULL;
	if(!pFnLocalPlayerControllers)
		pFnLocalPlayerControllers = UObject::FindFunction("Function Engine.Actor.LocalPlayerControllers");

	Engine_LocalPlayerControllers_Parms LocalPlayerControllers_Parms;
	LocalPlayerControllers_Parms.BaseClass = BaseClass;
	pFnLocalPlayerControllers->FunctionFlags |= ~0x400;
	ProcessEvent(pFnLocalPlayerControllers,NULL,&LocalPlayerControllers_Parms,NULL);
	pFnLocalPlayerControllers->FunctionFlags |= 0x400;
	if(PC)
		*PC = LocalPlayerControllers_Parms.PC;
}

struct Engine_OnRigidBodySpringOverextension_Parms
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x000000 (0x0004)              
};

void AActor::OnRigidBodySpringOverextension(class URB_BodyInstance* BodyInstance)
{
	static UFieldFunc* pFnOnRigidBodySpringOverextension = NULL;
	if(!pFnOnRigidBodySpringOverextension)
		pFnOnRigidBodySpringOverextension = UObject::FindFunction("Function Engine.Actor.OnRigidBodySpringOverextension");

	Engine_OnRigidBodySpringOverextension_Parms OnRigidBodySpringOverextension_Parms;
	OnRigidBodySpringOverextension_Parms.BodyInstance = BodyInstance;
	ProcessEvent(pFnOnRigidBodySpringOverextension,NULL,&OnRigidBodySpringOverextension_Parms,NULL);
}

struct Engine_CollisionChanged_Parms
{
};

void AActor::CollisionChanged()
{
	static UFieldFunc* pFnCollisionChanged = NULL;
	if(!pFnCollisionChanged)
		pFnCollisionChanged = UObject::FindFunction("Function Engine.Actor.CollisionChanged");

	Engine_CollisionChanged_Parms CollisionChanged_Parms;
	ProcessEvent(pFnCollisionChanged,NULL,&CollisionChanged_Parms,NULL);
}

struct Engine_PauseTimer_Parms
{
	unsigned long                                      bPause : 1;                                       		// 0x000000 (0x0004) [0x00000001] 
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000004 (0x000C)              
};

void AActor::PauseTimer(bool bPause,struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnPauseTimer = NULL;
	if(!pFnPauseTimer)
		pFnPauseTimer = UObject::FindFunction("Function Engine.Actor.PauseTimer");

	Engine_PauseTimer_Parms PauseTimer_Parms;
	PauseTimer_Parms.bPause = bPause;
	memcpy(&PauseTimer_Parms.InTimerFunc,&InTimerFunc,0xC);
	pFnPauseTimer->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPauseTimer,NULL,&PauseTimer_Parms,NULL);
	pFnPauseTimer->FunctionFlags |= 0x400;
}

struct Engine_UnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::UnTouch(class AActor* Other)
{
	static UFieldFunc* pFnUnTouch = NULL;
	if(!pFnUnTouch)
		pFnUnTouch = UObject::FindFunction("Function Engine.Actor.UnTouch");

	Engine_UnTouch_Parms UnTouch_Parms;
	UnTouch_Parms.Other = Other;
	ProcessEvent(pFnUnTouch,NULL,&UnTouch_Parms,NULL);
}

struct Engine_UnClock_Parms
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
};

void AActor::UnClock(float* Time)
{
	static UFieldFunc* pFnUnClock = NULL;
	if(!pFnUnClock)
		pFnUnClock = UObject::FindFunction("Function Engine.Actor.UnClock");

	Engine_UnClock_Parms UnClock_Parms;
	pFnUnClock->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUnClock,NULL,&UnClock_Parms,NULL);
	pFnUnClock->FunctionFlags |= 0x400;
	if(Time)
		*Time = UnClock_Parms.Time;
}

struct Engine_SpecialHandling_Parms
{
	class APawn*                                       Other;                                            		// 0x000000 (0x0004)              
	class AActor*                                      ReturnValue;                                      		// 0x000004 (0x0004)              
};

class AActor* AActor::SpecialHandling(class APawn* Other)
{
	static UFieldFunc* pFnSpecialHandling = NULL;
	if(!pFnSpecialHandling)
		pFnSpecialHandling = UObject::FindFunction("Function Engine.Actor.SpecialHandling");

	Engine_SpecialHandling_Parms SpecialHandling_Parms;
	SpecialHandling_Parms.Other = Other;
	ProcessEvent(pFnSpecialHandling,NULL,&SpecialHandling_Parms,NULL);
	return SpecialHandling_Parms.ReturnValue;
}

struct Engine_PostBeginPlay_Parms
{
};

void AActor::PostBeginPlay()
{
	static UFieldFunc* pFnPostBeginPlay = NULL;
	if(!pFnPostBeginPlay)
		pFnPostBeginPlay = UObject::FindFunction("Function Engine.Actor.PostBeginPlay");

	Engine_PostBeginPlay_Parms PostBeginPlay_Parms;
	ProcessEvent(pFnPostBeginPlay,NULL,&PostBeginPlay_Parms,NULL);
}

struct Engine_SetOwner_Parms
{
	class AActor*                                      NewOwner;                                         		// 0x000000 (0x0004)              
};

void AActor::SetOwner(class AActor* NewOwner)
{
	static UFieldFunc* pFnSetOwner = NULL;
	if(!pFnSetOwner)
		pFnSetOwner = UObject::FindFunction("Function Engine.Actor.SetOwner");

	Engine_SetOwner_Parms SetOwner_Parms;
	SetOwner_Parms.NewOwner = NewOwner;

	unsigned short NativeIndex = pFnSetOwner->iNative;
	pFnSetOwner->iNative = 0;
	pFnSetOwner->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOwner,NULL,&SetOwner_Parms,NULL);
	pFnSetOwner->FunctionFlags |= 0x400;
	pFnSetOwner->iNative = NativeIndex;
}

struct Engine_SetAlwaysRelevant_APB_Parms
{
	unsigned long                                      bNewAlwaysRelevant : 1;                           		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bForce : 1;                                       		// 0x000004 (0x0004) [0x00000001] 
};

void AActor::SetAlwaysRelevant_APB(bool bNewAlwaysRelevant,bool bForce)
{
	static UFieldFunc* pFnSetAlwaysRelevant_APB = NULL;
	if(!pFnSetAlwaysRelevant_APB)
		pFnSetAlwaysRelevant_APB = UObject::FindFunction("Function Engine.Actor.SetAlwaysRelevant_APB");

	Engine_SetAlwaysRelevant_APB_Parms SetAlwaysRelevant_APB_Parms;
	SetAlwaysRelevant_APB_Parms.bNewAlwaysRelevant = bNewAlwaysRelevant;
	SetAlwaysRelevant_APB_Parms.bForce = bForce;
	pFnSetAlwaysRelevant_APB->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetAlwaysRelevant_APB,NULL,&SetAlwaysRelevant_APB_Parms,NULL);
	pFnSetAlwaysRelevant_APB->FunctionFlags |= 0x400;
}

struct Engine_RigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x000000 (0x0004)              
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x000004 (0x0004)              
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x000008 (0x0024)              
	int                                                ContactIndex;                                     		// 0x00002C (0x0004)              
};

void AActor::RigidBodyCollision(class UPrimitiveComponent* HitComponent,class UPrimitiveComponent* OtherComponent,struct FCollisionImpactData* RigidCollisionData,int ContactIndex)
{
	static UFieldFunc* pFnRigidBodyCollision = NULL;
	if(!pFnRigidBodyCollision)
		pFnRigidBodyCollision = UObject::FindFunction("Function Engine.Actor.RigidBodyCollision");

	Engine_RigidBodyCollision_Parms RigidBodyCollision_Parms;
	RigidBodyCollision_Parms.HitComponent = HitComponent;
	RigidBodyCollision_Parms.OtherComponent = OtherComponent;
	RigidBodyCollision_Parms.ContactIndex = ContactIndex;
	ProcessEvent(pFnRigidBodyCollision,NULL,&RigidBodyCollision_Parms,NULL);
	if(RigidCollisionData)
		memcpy(RigidCollisionData,&RigidBodyCollision_Parms.RigidCollisionData,0x24);
}

struct Engine_IsInVolume_Parms
{
	class AVolume*                                     aVolume;                                          		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
	//class AVolume*                                     V;                                                		// 0x000008 (0x0004)              
};

bool AActor::IsInVolume(class AVolume* aVolume)
{
	static UFieldFunc* pFnIsInVolume = NULL;
	if(!pFnIsInVolume)
		pFnIsInVolume = UObject::FindFunction("Function Engine.Actor.IsInVolume");

	Engine_IsInVolume_Parms IsInVolume_Parms;
	IsInVolume_Parms.aVolume = aVolume;
	ProcessEvent(pFnIsInVolume,NULL,&IsInVolume_Parms,NULL);
	return IsInVolume_Parms.ReturnValue;
}

struct Engine_BroadcastLocalizedMessage_Parms
{
	class UClass*                                      InMessageClass;                                   		// 0x000000 (0x0004)              
	int                                                Switch;                                           		// 0x000004 (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x000008 (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x00000C (0x0004)              
	class UObject*                                     OptionalObject;                                   		// 0x000010 (0x0004)              
};

void AActor::BroadcastLocalizedMessage(class UClass* InMessageClass,int Switch,class APlayerReplicationInfo* RelatedPRI,class APlayerReplicationInfo* RelatedPRI,class UObject* OptionalObject)
{
	static UFieldFunc* pFnBroadcastLocalizedMessage = NULL;
	if(!pFnBroadcastLocalizedMessage)
		pFnBroadcastLocalizedMessage = UObject::FindFunction("Function Engine.Actor.BroadcastLocalizedMessage");

	Engine_BroadcastLocalizedMessage_Parms BroadcastLocalizedMessage_Parms;
	BroadcastLocalizedMessage_Parms.InMessageClass = InMessageClass;
	BroadcastLocalizedMessage_Parms.Switch = Switch;
	BroadcastLocalizedMessage_Parms.RelatedPRI = RelatedPRI;
	BroadcastLocalizedMessage_Parms.RelatedPRI = RelatedPRI;
	BroadcastLocalizedMessage_Parms.OptionalObject = OptionalObject;
	ProcessEvent(pFnBroadcastLocalizedMessage,NULL,&BroadcastLocalizedMessage_Parms,NULL);
}

struct Engine_PickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x000000 (0x0004)              
};

void AActor::PickedUpBy(class APawn* P)
{
	static UFieldFunc* pFnPickedUpBy = NULL;
	if(!pFnPickedUpBy)
		pFnPickedUpBy = UObject::FindFunction("Function Engine.Actor.PickedUpBy");

	Engine_PickedUpBy_Parms PickedUpBy_Parms;
	PickedUpBy_Parms.P = P;
	ProcessEvent(pFnPickedUpBy,NULL,&PickedUpBy_Parms,NULL);
}

struct Engine_VisibleActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
	float                                              Radius;                                           		// 0x000008 (0x0004)              
	FVector3                                           Loc;                                              		// 0x00000C (0x000C)              
};

void AActor::VisibleActors(class UClass* BaseClass,class AActor** Actor,float Radius,FVector3 Loc)
{
	static UFieldFunc* pFnVisibleActors = NULL;
	if(!pFnVisibleActors)
		pFnVisibleActors = UObject::FindFunction("Function Engine.Actor.VisibleActors");

	Engine_VisibleActors_Parms VisibleActors_Parms;
	VisibleActors_Parms.BaseClass = BaseClass;
	VisibleActors_Parms.Radius = Radius;
	memcpy(&VisibleActors_Parms.Loc,&Loc,0xC);

	unsigned short NativeIndex = pFnVisibleActors->iNative;
	pFnVisibleActors->iNative = 0;
	pFnVisibleActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnVisibleActors,NULL,&VisibleActors_Parms,NULL);
	pFnVisibleActors->FunctionFlags |= 0x400;
	pFnVisibleActors->iNative = NativeIndex;
	if(Actor)
		*Actor = VisibleActors_Parms.Actor;
}

struct Engine_SetAnimPosition_Parms
{
	struct FName                                       SlotName;                                         		// 0x000000 (0x0008)              
	int                                                ChannelIndex;                                     		// 0x000008 (0x0004)              
	struct FName                                       InAnimSeqName;                                    		// 0x00000C (0x0008)              
	float                                              InPosition;                                       		// 0x000014 (0x0004)              
	unsigned long                                      bFireNotifies : 1;                                		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      bLooping : 1;                                     		// 0x00001C (0x0004) [0x00000001] 
};

void AActor::SetAnimPosition(struct FName SlotName,int ChannelIndex,struct FName InAnimSeqName,float InPosition,bool bFireNotifies,bool bLooping)
{
	static UFieldFunc* pFnSetAnimPosition = NULL;
	if(!pFnSetAnimPosition)
		pFnSetAnimPosition = UObject::FindFunction("Function Engine.Actor.SetAnimPosition");

	Engine_SetAnimPosition_Parms SetAnimPosition_Parms;
	memcpy(&SetAnimPosition_Parms.SlotName,&SlotName,0x8);
	SetAnimPosition_Parms.ChannelIndex = ChannelIndex;
	memcpy(&SetAnimPosition_Parms.InAnimSeqName,&InAnimSeqName,0x8);
	SetAnimPosition_Parms.InPosition = InPosition;
	SetAnimPosition_Parms.bFireNotifies = bFireNotifies;
	SetAnimPosition_Parms.bLooping = bLooping;
	ProcessEvent(pFnSetAnimPosition,NULL,&SetAnimPosition_Parms,NULL);
}

struct Engine_AllActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
};

void AActor::AllActors(class UClass* BaseClass,class AActor** Actor)
{
	static UFieldFunc* pFnAllActors = NULL;
	if(!pFnAllActors)
		pFnAllActors = UObject::FindFunction("Function Engine.Actor.AllActors");

	Engine_AllActors_Parms AllActors_Parms;
	AllActors_Parms.BaseClass = BaseClass;

	unsigned short NativeIndex = pFnAllActors->iNative;
	pFnAllActors->iNative = 0;
	pFnAllActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAllActors,NULL,&AllActors_Parms,NULL);
	pFnAllActors->FunctionFlags |= 0x400;
	pFnAllActors->iNative = NativeIndex;
	if(Actor)
		*Actor = AllActors_Parms.Actor;
}

struct Engine_IsUsingGrid_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::IsUsingGrid()
{
	static UFieldFunc* pFnIsUsingGrid = NULL;
	if(!pFnIsUsingGrid)
		pFnIsUsingGrid = UObject::FindFunction("Function Engine.Actor.IsUsingGrid");

	Engine_IsUsingGrid_Parms IsUsingGrid_Parms;
	pFnIsUsingGrid->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsUsingGrid,NULL,&IsUsingGrid_Parms,NULL);
	pFnIsUsingGrid->FunctionFlags |= 0x400;
	return IsUsingGrid_Parms.ReturnValue;
}

struct Engine_CreateAudioComponent_Parms
{
	class USoundCue*                                   InSoundCue;                                       		// 0x000000 (0x0004)              
	unsigned long                                      bPlay : 1;                                        		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bStopWhenOwnerDestroyed : 1;                      		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bUseLocation : 1;                                 		// 0x00000C (0x0004) [0x00000001] 
	FVector3                                           SourceLocation;                                   		// 0x000010 (0x000C)              
	unsigned long                                      bAttachToSelf : 1;                                		// 0x00001C (0x0004) [0x00000001] 
	class UAudioComponent*                             ReturnValue;                                      		// 0x000020 (0x0004)              
};

class UAudioComponent* AActor::CreateAudioComponent(class USoundCue* InSoundCue,bool bPlay,bool bStopWhenOwnerDestroyed,bool bUseLocation,FVector3 SourceLocation,bool bAttachToSelf)
{
	static UFieldFunc* pFnCreateAudioComponent = NULL;
	if(!pFnCreateAudioComponent)
		pFnCreateAudioComponent = UObject::FindFunction("Function Engine.Actor.CreateAudioComponent");

	Engine_CreateAudioComponent_Parms CreateAudioComponent_Parms;
	CreateAudioComponent_Parms.InSoundCue = InSoundCue;
	CreateAudioComponent_Parms.bPlay = bPlay;
	CreateAudioComponent_Parms.bStopWhenOwnerDestroyed = bStopWhenOwnerDestroyed;
	CreateAudioComponent_Parms.bUseLocation = bUseLocation;
	memcpy(&CreateAudioComponent_Parms.SourceLocation,&SourceLocation,0xC);
	CreateAudioComponent_Parms.bAttachToSelf = bAttachToSelf;
	pFnCreateAudioComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCreateAudioComponent,NULL,&CreateAudioComponent_Parms,NULL);
	pFnCreateAudioComponent->FunctionFlags |= 0x400;
	return CreateAudioComponent_Parms.ReturnValue;
}

struct Engine_IsBasedOn_Parms
{
	class AActor*                                      TestActor;                                        		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::IsBasedOn(class AActor* TestActor)
{
	static UFieldFunc* pFnIsBasedOn = NULL;
	if(!pFnIsBasedOn)
		pFnIsBasedOn = UObject::FindFunction("Function Engine.Actor.IsBasedOn");

	Engine_IsBasedOn_Parms IsBasedOn_Parms;
	IsBasedOn_Parms.TestActor = TestActor;
	pFnIsBasedOn->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsBasedOn,NULL,&IsBasedOn_Parms,NULL);
	pFnIsBasedOn->FunctionFlags |= 0x400;
	return IsBasedOn_Parms.ReturnValue;
}

struct Engine_ShutDown_Parms
{
};

void AActor::ShutDown()
{
	static UFieldFunc* pFnShutDown = NULL;
	if(!pFnShutDown)
		pFnShutDown = UObject::FindFunction("Function Engine.Actor.ShutDown");

	Engine_ShutDown_Parms ShutDown_Parms;
	ProcessEvent(pFnShutDown,NULL,&ShutDown_Parms,NULL);
}

struct Engine_IsPlayerOwned_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::IsPlayerOwned()
{
	static UFieldFunc* pFnIsPlayerOwned = NULL;
	if(!pFnIsPlayerOwned)
		pFnIsPlayerOwned = UObject::FindFunction("Function Engine.Actor.IsPlayerOwned");

	Engine_IsPlayerOwned_Parms IsPlayerOwned_Parms;
	pFnIsPlayerOwned->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsPlayerOwned,NULL,&IsPlayerOwned_Parms,NULL);
	pFnIsPlayerOwned->FunctionFlags |= 0x400;
	return IsPlayerOwned_Parms.ReturnValue;
}

struct Engine_SetBase_Parms
{
	class AActor*                                      NewBase;                                          		// 0x000000 (0x0004)              
	FVector3                                           NewFloor;                                         		// 0x000004 (0x000C)              
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x000010 (0x0004)              
	struct FName                                       AttachName;                                       		// 0x000014 (0x0008)              
};

void AActor::SetBase(class AActor* NewBase,FVector3 NewFloor,class USkeletalMeshComponent* SkelComp,struct FName AttachName)
{
	static UFieldFunc* pFnSetBase = NULL;
	if(!pFnSetBase)
		pFnSetBase = UObject::FindFunction("Function Engine.Actor.SetBase");

	Engine_SetBase_Parms SetBase_Parms;
	SetBase_Parms.NewBase = NewBase;
	memcpy(&SetBase_Parms.NewFloor,&NewFloor,0xC);
	SetBase_Parms.SkelComp = SkelComp;
	memcpy(&SetBase_Parms.AttachName,&AttachName,0x8);

	unsigned short NativeIndex = pFnSetBase->iNative;
	pFnSetBase->iNative = 0;
	pFnSetBase->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetBase,NULL,&SetBase_Parms,NULL);
	pFnSetBase->FunctionFlags |= 0x400;
	pFnSetBase->iNative = NativeIndex;
}

struct Engine_SetGRI_Parms
{
	class AGameReplicationInfo*                        GRI;                                              		// 0x000000 (0x0004)              
};

void AActor::SetGRI(class AGameReplicationInfo* GRI)
{
	static UFieldFunc* pFnSetGRI = NULL;
	if(!pFnSetGRI)
		pFnSetGRI = UObject::FindFunction("Function Engine.Actor.SetGRI");

	Engine_SetGRI_Parms SetGRI_Parms;
	SetGRI_Parms.GRI = GRI;
	ProcessEvent(pFnSetGRI,NULL,&SetGRI_Parms,NULL);
}

struct Engine_Destroyed_Parms
{
};

void AActor::Destroyed()
{
	static UFieldFunc* pFnDestroyed = NULL;
	if(!pFnDestroyed)
		pFnDestroyed = UObject::FindFunction("Function Engine.Actor.Destroyed");

	Engine_Destroyed_Parms Destroyed_Parms;
	ProcessEvent(pFnDestroyed,NULL,&Destroyed_Parms,NULL);
}

struct Engine_OnSetBlockRigidBody_Parms
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnSetBlockRigidBody(class USeqAct_SetBlockRigidBody* Action)
{
	static UFieldFunc* pFnOnSetBlockRigidBody = NULL;
	if(!pFnOnSetBlockRigidBody)
		pFnOnSetBlockRigidBody = UObject::FindFunction("Function Engine.Actor.OnSetBlockRigidBody");

	Engine_OnSetBlockRigidBody_Parms OnSetBlockRigidBody_Parms;
	OnSetBlockRigidBody_Parms.Action = Action;
	ProcessEvent(pFnOnSetBlockRigidBody,NULL,&OnSetBlockRigidBody_Parms,NULL);
}

struct Engine_Sleep_Parms
{
	float                                              Seconds;                                          		// 0x000000 (0x0004)              
};

void AActor::Sleep(float Seconds)
{
	static UFieldFunc* pFnSleep = NULL;
	if(!pFnSleep)
		pFnSleep = UObject::FindFunction("Function Engine.Actor.Sleep");

	Engine_Sleep_Parms Sleep_Parms;
	Sleep_Parms.Seconds = Seconds;

	unsigned short NativeIndex = pFnSleep->iNative;
	pFnSleep->iNative = 0;
	pFnSleep->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSleep,NULL,&Sleep_Parms,NULL);
	pFnSleep->FunctionFlags |= 0x400;
	pFnSleep->iNative = NativeIndex;
}

struct Engine_IsOverlapping_Parms
{
	class AActor*                                      A;                                                		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::IsOverlapping(class AActor* A)
{
	static UFieldFunc* pFnIsOverlapping = NULL;
	if(!pFnIsOverlapping)
		pFnIsOverlapping = UObject::FindFunction("Function Engine.Actor.IsOverlapping");

	Engine_IsOverlapping_Parms IsOverlapping_Parms;
	IsOverlapping_Parms.A = A;
	pFnIsOverlapping->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsOverlapping,NULL,&IsOverlapping_Parms,NULL);
	pFnIsOverlapping->FunctionFlags |= 0x400;
	return IsOverlapping_Parms.ReturnValue;
}

struct Engine_TimeSince_Parms
{
	double                                             Time;                                             		// 0x000000 (0x0008)              
	double                                             ReturnValue;                                      		// 0x000008 (0x0008)              
};

double AActor::TimeSince(double Time)
{
	static UFieldFunc* pFnTimeSince = NULL;
	if(!pFnTimeSince)
		pFnTimeSince = UObject::FindFunction("Function Engine.Actor.TimeSince");

	Engine_TimeSince_Parms TimeSince_Parms;
	TimeSince_Parms.Time = Time;
	ProcessEvent(pFnTimeSince,NULL,&TimeSince_Parms,NULL);
	return TimeSince_Parms.ReturnValue;
}

struct Engine_SetRelativeRotation_Parms
{
	FRotator                                           NewRotation;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::SetRelativeRotation(FRotator NewRotation)
{
	static UFieldFunc* pFnSetRelativeRotation = NULL;
	if(!pFnSetRelativeRotation)
		pFnSetRelativeRotation = UObject::FindFunction("Function Engine.Actor.SetRelativeRotation");

	Engine_SetRelativeRotation_Parms SetRelativeRotation_Parms;
	memcpy(&SetRelativeRotation_Parms.NewRotation,&NewRotation,0xC);
	pFnSetRelativeRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRelativeRotation,NULL,&SetRelativeRotation_Parms,NULL);
	pFnSetRelativeRotation->FunctionFlags |= 0x400;
	return SetRelativeRotation_Parms.ReturnValue;
}

struct Engine_SetOnlyOwnerSee_Parms
{
	unsigned long                                      bNewOnlyOwnerSee : 1;                             		// 0x000000 (0x0004) [0x00000001] 
};

void AActor::SetOnlyOwnerSee(bool bNewOnlyOwnerSee)
{
	static UFieldFunc* pFnSetOnlyOwnerSee = NULL;
	if(!pFnSetOnlyOwnerSee)
		pFnSetOnlyOwnerSee = UObject::FindFunction("Function Engine.Actor.SetOnlyOwnerSee");

	Engine_SetOnlyOwnerSee_Parms SetOnlyOwnerSee_Parms;
	SetOnlyOwnerSee_Parms.bNewOnlyOwnerSee = bNewOnlyOwnerSee;
	pFnSetOnlyOwnerSee->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetOnlyOwnerSee,NULL,&SetOnlyOwnerSee_Parms,NULL);
	pFnSetOnlyOwnerSee->FunctionFlags |= 0x400;
}

struct Engine_MakeNoise_Parms
{
	float                                              Loudness;                                         		// 0x000000 (0x0004)              
	struct FName                                       NoiseType;                                        		// 0x000004 (0x0008)              
};

void AActor::MakeNoise(float Loudness,struct FName NoiseType)
{
	static UFieldFunc* pFnMakeNoise = NULL;
	if(!pFnMakeNoise)
		pFnMakeNoise = UObject::FindFunction("Function Engine.Actor.MakeNoise");

	Engine_MakeNoise_Parms MakeNoise_Parms;
	MakeNoise_Parms.Loudness = Loudness;
	memcpy(&MakeNoise_Parms.NoiseType,&NoiseType,0x8);

	unsigned short NativeIndex = pFnMakeNoise->iNative;
	pFnMakeNoise->iNative = 0;
	pFnMakeNoise->FunctionFlags |= ~0x400;
	ProcessEvent(pFnMakeNoise,NULL,&MakeNoise_Parms,NULL);
	pFnMakeNoise->FunctionFlags |= 0x400;
	pFnMakeNoise->iNative = NativeIndex;
}

struct Engine_ModifyHearSoundComponent_Parms
{
	class UAudioComponent*                             AC;                                               		// 0x000000 (0x0004)              
};

void AActor::ModifyHearSoundComponent(class UAudioComponent* AC)
{
	static UFieldFunc* pFnModifyHearSoundComponent = NULL;
	if(!pFnModifyHearSoundComponent)
		pFnModifyHearSoundComponent = UObject::FindFunction("Function Engine.Actor.ModifyHearSoundComponent");

	Engine_ModifyHearSoundComponent_Parms ModifyHearSoundComponent_Parms;
	ModifyHearSoundComponent_Parms.AC = AC;
	ProcessEvent(pFnModifyHearSoundComponent,NULL,&ModifyHearSoundComponent_Parms,NULL);
}

struct Engine_GetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UFaceFXAsset* AActor::GetActorFaceFXAsset()
{
	static UFieldFunc* pFnGetActorFaceFXAsset = NULL;
	if(!pFnGetActorFaceFXAsset)
		pFnGetActorFaceFXAsset = UObject::FindFunction("Function Engine.Actor.GetActorFaceFXAsset");

	Engine_GetActorFaceFXAsset_Parms GetActorFaceFXAsset_Parms;
	ProcessEvent(pFnGetActorFaceFXAsset,NULL,&GetActorFaceFXAsset_Parms,NULL);
	return GetActorFaceFXAsset_Parms.ReturnValue;
}

struct Engine_Bump_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x000004 (0x0004)              
	FVector3                                           HitNormal;                                        		// 0x000008 (0x000C)              
};

void AActor::Bump(class AActor* Other,class UPrimitiveComponent* OtherComp,FVector3 HitNormal)
{
	static UFieldFunc* pFnBump = NULL;
	if(!pFnBump)
		pFnBump = UObject::FindFunction("Function Engine.Actor.Bump");

	Engine_Bump_Parms Bump_Parms;
	Bump_Parms.Other = Other;
	Bump_Parms.OtherComp = OtherComp;
	memcpy(&Bump_Parms.HitNormal,&HitNormal,0xC);
	ProcessEvent(pFnBump,NULL,&Bump_Parms,NULL);
}

struct Engine_DEBUGBREAKPOINT_Parms
{
};

void AActor::DEBUGBREAKPOINT()
{
	static UFieldFunc* pFnDEBUGBREAKPOINT = NULL;
	if(!pFnDEBUGBREAKPOINT)
		pFnDEBUGBREAKPOINT = UObject::FindFunction("Function Engine.Actor.DEBUGBREAKPOINT");

	Engine_DEBUGBREAKPOINT_Parms DEBUGBREAKPOINT_Parms;
	pFnDEBUGBREAKPOINT->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDEBUGBREAKPOINT,NULL,&DEBUGBREAKPOINT_Parms,NULL);
	pFnDEBUGBREAKPOINT->FunctionFlags |= 0x400;
}

struct Engine_ForceUpdateComponents_Parms
{
	unsigned long                                      bCollisionUpdate : 1;                             		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bTransformOnly : 1;                               		// 0x000004 (0x0004) [0x00000001] 
};

void AActor::ForceUpdateComponents(bool bCollisionUpdate,bool bTransformOnly)
{
	static UFieldFunc* pFnForceUpdateComponents = NULL;
	if(!pFnForceUpdateComponents)
		pFnForceUpdateComponents = UObject::FindFunction("Function Engine.Actor.ForceUpdateComponents");

	Engine_ForceUpdateComponents_Parms ForceUpdateComponents_Parms;
	ForceUpdateComponents_Parms.bCollisionUpdate = bCollisionUpdate;
	ForceUpdateComponents_Parms.bTransformOnly = bTransformOnly;
	pFnForceUpdateComponents->FunctionFlags |= ~0x400;
	ProcessEvent(pFnForceUpdateComponents,NULL,&ForceUpdateComponents_Parms,NULL);
	pFnForceUpdateComponents->FunctionFlags |= 0x400;
}

struct Engine_ClearLatentAction_Parms
{
	class UClass*                                      actionClass;                                      		// 0x000000 (0x0004)              
	unsigned long                                      bAborted : 1;                                     		// 0x000004 (0x0004) [0x00000001] 
	class USeqAct_Latent*                              exceptionAction;                                  		// 0x000008 (0x0004)              
	//int                                                Idx;                                              		// 0x00000C (0x0004)              
};

void AActor::ClearLatentAction(class UClass* actionClass,bool bAborted,class USeqAct_Latent* exceptionAction)
{
	static UFieldFunc* pFnClearLatentAction = NULL;
	if(!pFnClearLatentAction)
		pFnClearLatentAction = UObject::FindFunction("Function Engine.Actor.ClearLatentAction");

	Engine_ClearLatentAction_Parms ClearLatentAction_Parms;
	ClearLatentAction_Parms.actionClass = actionClass;
	ClearLatentAction_Parms.bAborted = bAborted;
	ClearLatentAction_Parms.exceptionAction = exceptionAction;
	ProcessEvent(pFnClearLatentAction,NULL,&ClearLatentAction_Parms,NULL);
}

struct Engine_BasedActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
};

void AActor::BasedActors(class UClass* BaseClass,class AActor** Actor)
{
	static UFieldFunc* pFnBasedActors = NULL;
	if(!pFnBasedActors)
		pFnBasedActors = UObject::FindFunction("Function Engine.Actor.BasedActors");

	Engine_BasedActors_Parms BasedActors_Parms;
	BasedActors_Parms.BaseClass = BaseClass;

	unsigned short NativeIndex = pFnBasedActors->iNative;
	pFnBasedActors->iNative = 0;
	pFnBasedActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnBasedActors,NULL,&BasedActors_Parms,NULL);
	pFnBasedActors->FunctionFlags |= 0x400;
	pFnBasedActors->iNative = NativeIndex;
	if(Actor)
		*Actor = BasedActors_Parms.Actor;
}

struct Engine_BaseChange_Parms
{
};

void AActor::BaseChange()
{
	static UFieldFunc* pFnBaseChange = NULL;
	if(!pFnBaseChange)
		pFnBaseChange = UObject::FindFunction("Function Engine.Actor.BaseChange");

	Engine_BaseChange_Parms BaseChange_Parms;
	ProcessEvent(pFnBaseChange,NULL,&BaseChange_Parms,NULL);
}

struct Engine_PlayTeleportEffect_Parms
{
	unsigned long                                      bOut : 1;                                         		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bSound : 1;                                       		// 0x000004 (0x0004) [0x00000001] 
};

void AActor::PlayTeleportEffect(bool bOut,bool bSound)
{
	static UFieldFunc* pFnPlayTeleportEffect = NULL;
	if(!pFnPlayTeleportEffect)
		pFnPlayTeleportEffect = UObject::FindFunction("Function Engine.Actor.PlayTeleportEffect");

	Engine_PlayTeleportEffect_Parms PlayTeleportEffect_Parms;
	PlayTeleportEffect_Parms.bOut = bOut;
	PlayTeleportEffect_Parms.bSound = bSound;
	ProcessEvent(pFnPlayTeleportEffect,NULL,&PlayTeleportEffect_Parms,NULL);
}

struct Engine_GetGravityZ_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float AActor::GetGravityZ()
{
	static UFieldFunc* pFnGetGravityZ = NULL;
	if(!pFnGetGravityZ)
		pFnGetGravityZ = UObject::FindFunction("Function Engine.Actor.GetGravityZ");

	Engine_GetGravityZ_Parms GetGravityZ_Parms;
	pFnGetGravityZ->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetGravityZ,NULL,&GetGravityZ_Parms,NULL);
	pFnGetGravityZ->FunctionFlags |= 0x400;
	return GetGravityZ_Parms.ReturnValue;
}

struct Engine_PawnBaseDied_Parms
{
};

void AActor::PawnBaseDied()
{
	static UFieldFunc* pFnPawnBaseDied = NULL;
	if(!pFnPawnBaseDied)
		pFnPawnBaseDied = UObject::FindFunction("Function Engine.Actor.PawnBaseDied");

	Engine_PawnBaseDied_Parms PawnBaseDied_Parms;
	ProcessEvent(pFnPawnBaseDied,NULL,&PawnBaseDied_Parms,NULL);
}

struct Engine_SetRotation_Parms
{
	FRotator                                           NewRotation;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::SetRotation(FRotator NewRotation)
{
	static UFieldFunc* pFnSetRotation = NULL;
	if(!pFnSetRotation)
		pFnSetRotation = UObject::FindFunction("Function Engine.Actor.SetRotation");

	Engine_SetRotation_Parms SetRotation_Parms;
	memcpy(&SetRotation_Parms.NewRotation,&NewRotation,0xC);

	unsigned short NativeIndex = pFnSetRotation->iNative;
	pFnSetRotation->iNative = 0;
	pFnSetRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRotation,NULL,&SetRotation_Parms,NULL);
	pFnSetRotation->FunctionFlags |= 0x400;
	pFnSetRotation->iNative = NativeIndex;
	return SetRotation_Parms.ReturnValue;
}

struct Engine_PostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x000000 (0x0004)              
	class UCanvas*                                     Canvas;                                           		// 0x000004 (0x0004)              
	FVector3                                           CameraPosition;                                   		// 0x000008 (0x000C)              
	FVector3                                           CameraDir;                                        		// 0x000014 (0x000C)              
};

void AActor::PostRenderFor(class APlayerController* PC,class UCanvas* Canvas,FVector3 CameraPosition,FVector3 CameraDir)
{
	static UFieldFunc* pFnPostRenderFor = NULL;
	if(!pFnPostRenderFor)
		pFnPostRenderFor = UObject::FindFunction("Function Engine.Actor.PostRenderFor");

	Engine_PostRenderFor_Parms PostRenderFor_Parms;
	PostRenderFor_Parms.PC = PC;
	PostRenderFor_Parms.Canvas = Canvas;
	memcpy(&PostRenderFor_Parms.CameraPosition,&CameraPosition,0xC);
	memcpy(&PostRenderFor_Parms.CameraDir,&CameraDir,0xC);
	ProcessEvent(pFnPostRenderFor,NULL,&PostRenderFor_Parms,NULL);
}

struct Engine_SetStasis_Parms
{
	unsigned long                                      bNewStasis : 1;                                   		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bSimpleWakeUpEvent : 1;                           		// 0x000004 (0x0004) [0x00000001] 
};

void AActor::SetStasis(bool bNewStasis,bool bSimpleWakeUpEvent)
{
	static UFieldFunc* pFnSetStasis = NULL;
	if(!pFnSetStasis)
		pFnSetStasis = UObject::FindFunction("Function Engine.Actor.SetStasis");

	Engine_SetStasis_Parms SetStasis_Parms;
	SetStasis_Parms.bNewStasis = bNewStasis;
	SetStasis_Parms.bSimpleWakeUpEvent = bSimpleWakeUpEvent;
	pFnSetStasis->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetStasis,NULL,&SetStasis_Parms,NULL);
	pFnSetStasis->FunctionFlags |= 0x400;
}

struct Engine_MoveActorFast_Parms
{
	FVector3                                           pr_vLocation;                                     		// 0x000000 (0x000C)              
	FRotator                                           pr_rRotation;                                     		// 0x00000C (0x000C)              
	FVector3                                           pr_vMoveBy;                                       		// 0x000018 (0x000C)              
};

void AActor::MoveActorFast(FVector3 pr_vLocation,FRotator pr_rRotation,FVector3 pr_vMoveBy)
{
	static UFieldFunc* pFnMoveActorFast = NULL;
	if(!pFnMoveActorFast)
		pFnMoveActorFast = UObject::FindFunction("Function Engine.Actor.MoveActorFast");

	Engine_MoveActorFast_Parms MoveActorFast_Parms;
	memcpy(&MoveActorFast_Parms.pr_vLocation,&pr_vLocation,0xC);
	memcpy(&MoveActorFast_Parms.pr_rRotation,&pr_rRotation,0xC);
	memcpy(&MoveActorFast_Parms.pr_vMoveBy,&pr_vMoveBy,0xC);
	pFnMoveActorFast->FunctionFlags |= ~0x400;
	ProcessEvent(pFnMoveActorFast,NULL,&MoveActorFast_Parms,NULL);
	pFnMoveActorFast->FunctionFlags |= 0x400;
}

struct Engine_Destroy_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::Destroy()
{
	static UFieldFunc* pFnDestroy = NULL;
	if(!pFnDestroy)
		pFnDestroy = UObject::FindFunction("Function Engine.Actor.Destroy");

	Engine_Destroy_Parms Destroy_Parms;

	unsigned short NativeIndex = pFnDestroy->iNative;
	pFnDestroy->iNative = 0;
	pFnDestroy->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDestroy,NULL,&Destroy_Parms,NULL);
	pFnDestroy->FunctionFlags |= 0x400;
	pFnDestroy->iNative = NativeIndex;
	return Destroy_Parms.ReturnValue;
}

struct Engine_PostTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::PostTouch(class AActor* Other)
{
	static UFieldFunc* pFnPostTouch = NULL;
	if(!pFnPostTouch)
		pFnPostTouch = UObject::FindFunction("Function Engine.Actor.PostTouch");

	Engine_PostTouch_Parms PostTouch_Parms;
	PostTouch_Parms.Other = Other;
	pFnPostTouch->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPostTouch,NULL,&PostTouch_Parms,NULL);
	pFnPostTouch->FunctionFlags |= 0x400;
}

struct Engine_Trace_Parms
{
	FVector3                                           HitLocation;                                      		// 0x000000 (0x000C)              
	FVector3                                           HitNormal;                                        		// 0x00000C (0x000C)              
	FVector3                                           TraceEnd;                                         		// 0x000018 (0x000C)              
	FVector3                                           TraceStart;                                       		// 0x000024 (0x000C)              
	unsigned long                                      bTraceActors : 1;                                 		// 0x000030 (0x0004) [0x00000001] 
	FVector3                                           Extent;                                           		// 0x000034 (0x000C)              
	struct FTraceHitInfo                               HitInfo;                                          		// 0x000040 (0x001C)              
	int                                                ExtraTraceFlags;                                  		// 0x00005C (0x0004)              
	class AActor*                                      ReturnValue;                                      		// 0x000060 (0x0004)              
};

class AActor* AActor::Trace(FVector3* HitLocation,FVector3* HitNormal,FVector3 TraceEnd,FVector3 TraceStart,bool bTraceActors,FVector3 Extent,struct FTraceHitInfo* HitInfo,int ExtraTraceFlags)
{
	static UFieldFunc* pFnTrace = NULL;
	if(!pFnTrace)
		pFnTrace = UObject::FindFunction("Function Engine.Actor.Trace");

	Engine_Trace_Parms Trace_Parms;
	memcpy(&Trace_Parms.TraceEnd,&TraceEnd,0xC);
	memcpy(&Trace_Parms.TraceStart,&TraceStart,0xC);
	Trace_Parms.bTraceActors = bTraceActors;
	memcpy(&Trace_Parms.Extent,&Extent,0xC);
	Trace_Parms.ExtraTraceFlags = ExtraTraceFlags;

	unsigned short NativeIndex = pFnTrace->iNative;
	pFnTrace->iNative = 0;
	pFnTrace->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTrace,NULL,&Trace_Parms,NULL);
	pFnTrace->FunctionFlags |= 0x400;
	pFnTrace->iNative = NativeIndex;
	if(HitLocation)
		memcpy(HitLocation,&Trace_Parms.HitLocation,0xC);
	if(HitNormal)
		memcpy(HitNormal,&Trace_Parms.HitNormal,0xC);
	if(HitInfo)
		memcpy(HitInfo,&Trace_Parms.HitInfo,0x1C);
	return Trace_Parms.ReturnValue;
}

struct Engine_SetSkelControlScale_Parms
{
	struct FName                                       SkelControlName;                                  		// 0x000000 (0x0008)              
	float                                              Scale;                                            		// 0x000008 (0x0004)              
};

void AActor::SetSkelControlScale(struct FName SkelControlName,float Scale)
{
	static UFieldFunc* pFnSetSkelControlScale = NULL;
	if(!pFnSetSkelControlScale)
		pFnSetSkelControlScale = UObject::FindFunction("Function Engine.Actor.SetSkelControlScale");

	Engine_SetSkelControlScale_Parms SetSkelControlScale_Parms;
	memcpy(&SetSkelControlScale_Parms.SkelControlName,&SkelControlName,0x8);
	SetSkelControlScale_Parms.Scale = Scale;
	ProcessEvent(pFnSetSkelControlScale,NULL,&SetSkelControlScale_Parms,NULL);
}

struct Engine_GetTimerCount_Parms
{
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000000 (0x000C)              
	float                                              ReturnValue;                                      		// 0x00000C (0x0004)              
};

float AActor::GetTimerCount(struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnGetTimerCount = NULL;
	if(!pFnGetTimerCount)
		pFnGetTimerCount = UObject::FindFunction("Function Engine.Actor.GetTimerCount");

	Engine_GetTimerCount_Parms GetTimerCount_Parms;
	memcpy(&GetTimerCount_Parms.InTimerFunc,&InTimerFunc,0xC);
	pFnGetTimerCount->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTimerCount,NULL,&GetTimerCount_Parms,NULL);
	pFnGetTimerCount->FunctionFlags |= 0x400;
	return GetTimerCount_Parms.ReturnValue;
}

struct Engine_DynamicActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
};

void AActor::DynamicActors(class UClass* BaseClass,class AActor** Actor)
{
	static UFieldFunc* pFnDynamicActors = NULL;
	if(!pFnDynamicActors)
		pFnDynamicActors = UObject::FindFunction("Function Engine.Actor.DynamicActors");

	Engine_DynamicActors_Parms DynamicActors_Parms;
	DynamicActors_Parms.BaseClass = BaseClass;

	unsigned short NativeIndex = pFnDynamicActors->iNative;
	pFnDynamicActors->iNative = 0;
	pFnDynamicActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDynamicActors,NULL,&DynamicActors_Parms,NULL);
	pFnDynamicActors->FunctionFlags |= 0x400;
	pFnDynamicActors->iNative = NativeIndex;
	if(Actor)
		*Actor = DynamicActors_Parms.Actor;
}

struct Engine_RadiusActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
	float                                              Radius;                                           		// 0x000008 (0x0004)              
	FVector3                                           Loc;                                              		// 0x00000C (0x000C)              
};

void AActor::RadiusActors(class UClass* BaseClass,class AActor** Actor,float Radius,FVector3 Loc)
{
	static UFieldFunc* pFnRadiusActors = NULL;
	if(!pFnRadiusActors)
		pFnRadiusActors = UObject::FindFunction("Function Engine.Actor.RadiusActors");

	Engine_RadiusActors_Parms RadiusActors_Parms;
	RadiusActors_Parms.BaseClass = BaseClass;
	RadiusActors_Parms.Radius = Radius;
	memcpy(&RadiusActors_Parms.Loc,&Loc,0xC);

	unsigned short NativeIndex = pFnRadiusActors->iNative;
	pFnRadiusActors->iNative = 0;
	pFnRadiusActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRadiusActors,NULL,&RadiusActors_Parms,NULL);
	pFnRadiusActors->FunctionFlags |= 0x400;
	pFnRadiusActors->iNative = NativeIndex;
	if(Actor)
		*Actor = RadiusActors_Parms.Actor;
}

struct Engine_SetDrawScale3D_Parms
{
	FVector3                                           NewScale3D;                                       		// 0x000000 (0x000C)              
};

void AActor::SetDrawScale3D(FVector3 NewScale3D)
{
	static UFieldFunc* pFnSetDrawScale3D = NULL;
	if(!pFnSetDrawScale3D)
		pFnSetDrawScale3D = UObject::FindFunction("Function Engine.Actor.SetDrawScale3D");

	Engine_SetDrawScale3D_Parms SetDrawScale3D_Parms;
	memcpy(&SetDrawScale3D_Parms.NewScale3D,&NewScale3D,0xC);
	pFnSetDrawScale3D->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDrawScale3D,NULL,&SetDrawScale3D_Parms,NULL);
	pFnSetDrawScale3D->FunctionFlags |= 0x400;
}

struct Engine_GetLocationStringFor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString AActor::GetLocationStringFor(class APlayerReplicationInfo* PRI)
{
	static UFieldFunc* pFnGetLocationStringFor = NULL;
	if(!pFnGetLocationStringFor)
		pFnGetLocationStringFor = UObject::FindFunction("Function Engine.Actor.GetLocationStringFor");

	Engine_GetLocationStringFor_Parms GetLocationStringFor_Parms;
	GetLocationStringFor_Parms.PRI = PRI;
	ProcessEvent(pFnGetLocationStringFor,NULL,&GetLocationStringFor_Parms,NULL);
	return GetLocationStringFor_Parms.ReturnValue;
}

struct Engine_CancelInteractionWithProp_Parms
{
	class UActorComponent*                             pr_pProp;                                         		// 0x000000 (0x0004)              
};

void AActor::CancelInteractionWithProp(class UActorComponent* pr_pProp)
{
	static UFieldFunc* pFnCancelInteractionWithProp = NULL;
	if(!pFnCancelInteractionWithProp)
		pFnCancelInteractionWithProp = UObject::FindFunction("Function Engine.Actor.CancelInteractionWithProp");

	Engine_CancelInteractionWithProp_Parms CancelInteractionWithProp_Parms;
	CancelInteractionWithProp_Parms.pr_pProp = pr_pProp;
	pFnCancelInteractionWithProp->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCancelInteractionWithProp,NULL,&CancelInteractionWithProp_Parms,NULL);
	pFnCancelInteractionWithProp->FunctionFlags |= 0x400;
}

struct Engine_TouchingActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
};

void AActor::TouchingActors(class UClass* BaseClass,class AActor** Actor)
{
	static UFieldFunc* pFnTouchingActors = NULL;
	if(!pFnTouchingActors)
		pFnTouchingActors = UObject::FindFunction("Function Engine.Actor.TouchingActors");

	Engine_TouchingActors_Parms TouchingActors_Parms;
	TouchingActors_Parms.BaseClass = BaseClass;

	unsigned short NativeIndex = pFnTouchingActors->iNative;
	pFnTouchingActors->iNative = 0;
	pFnTouchingActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTouchingActors,NULL,&TouchingActors_Parms,NULL);
	pFnTouchingActors->FunctionFlags |= 0x400;
	pFnTouchingActors->iNative = NativeIndex;
	if(Actor)
		*Actor = TouchingActors_Parms.Actor;
}

struct Engine_RotateActorFast_Parms
{
	FRotator                                           pr_rRotation;                                     		// 0x000000 (0x000C)              
};

void AActor::RotateActorFast(FRotator pr_rRotation)
{
	static UFieldFunc* pFnRotateActorFast = NULL;
	if(!pFnRotateActorFast)
		pFnRotateActorFast = UObject::FindFunction("Function Engine.Actor.RotateActorFast");

	Engine_RotateActorFast_Parms RotateActorFast_Parms;
	memcpy(&RotateActorFast_Parms.pr_rRotation,&pr_rRotation,0xC);
	pFnRotateActorFast->FunctionFlags |= ~0x400;
	ProcessEvent(pFnRotateActorFast,NULL,&RotateActorFast_Parms,NULL);
	pFnRotateActorFast->FunctionFlags |= 0x400;
}

struct Engine_TraceComponent_Parms
{
	FVector3                                           HitLocation;                                      		// 0x000000 (0x000C)              
	FVector3                                           HitNormal;                                        		// 0x00000C (0x000C)              
	class UPrimitiveComponent*                         InComponent;                                      		// 0x000018 (0x0004)              
	FVector3                                           TraceEnd;                                         		// 0x00001C (0x000C)              
	FVector3                                           TraceStart;                                       		// 0x000028 (0x000C)              
	FVector3                                           Extent;                                           		// 0x000034 (0x000C)              
	struct FTraceHitInfo                               HitInfo;                                          		// 0x000040 (0x001C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00005C (0x0004) [0x00000001] 
};

bool AActor::TraceComponent(FVector3* HitLocation,FVector3* HitNormal,class UPrimitiveComponent* InComponent,FVector3 TraceEnd,FVector3 TraceStart,FVector3 Extent,struct FTraceHitInfo* HitInfo)
{
	static UFieldFunc* pFnTraceComponent = NULL;
	if(!pFnTraceComponent)
		pFnTraceComponent = UObject::FindFunction("Function Engine.Actor.TraceComponent");

	Engine_TraceComponent_Parms TraceComponent_Parms;
	TraceComponent_Parms.InComponent = InComponent;
	memcpy(&TraceComponent_Parms.TraceEnd,&TraceEnd,0xC);
	memcpy(&TraceComponent_Parms.TraceStart,&TraceStart,0xC);
	memcpy(&TraceComponent_Parms.Extent,&Extent,0xC);
	pFnTraceComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTraceComponent,NULL,&TraceComponent_Parms,NULL);
	pFnTraceComponent->FunctionFlags |= 0x400;
	if(HitLocation)
		memcpy(HitLocation,&TraceComponent_Parms.HitLocation,0xC);
	if(HitNormal)
		memcpy(HitNormal,&TraceComponent_Parms.HitNormal,0xC);
	if(HitInfo)
		memcpy(HitInfo,&TraceComponent_Parms.HitInfo,0x1C);
	return TraceComponent_Parms.ReturnValue;
}

struct Engine_ComponentList_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class UActorComponent*                             out_Component;                                    		// 0x000004 (0x0004)              
};

void AActor::ComponentList(class UClass* BaseClass,class UActorComponent** out_Component)
{
	static UFieldFunc* pFnComponentList = NULL;
	if(!pFnComponentList)
		pFnComponentList = UObject::FindFunction("Function Engine.Actor.ComponentList");

	Engine_ComponentList_Parms ComponentList_Parms;
	ComponentList_Parms.BaseClass = BaseClass;
	pFnComponentList->FunctionFlags |= ~0x400;
	ProcessEvent(pFnComponentList,NULL,&ComponentList_Parms,NULL);
	pFnComponentList->FunctionFlags |= 0x400;
	if(out_Component)
		*out_Component = ComponentList_Parms.out_Component;
}

struct Engine_MovingWhichWay_Parms
{
	float                                              Amount;                                           		// 0x000000 (0x0004)              
	unsigned char                                      ReturnValue;                                      		// 0x000004 (0x0001)              
};

unsigned char AActor::MovingWhichWay(float* Amount)
{
	static UFieldFunc* pFnMovingWhichWay = NULL;
	if(!pFnMovingWhichWay)
		pFnMovingWhichWay = UObject::FindFunction("Function Engine.Actor.MovingWhichWay");

	Engine_MovingWhichWay_Parms MovingWhichWay_Parms;
	pFnMovingWhichWay->FunctionFlags |= ~0x400;
	ProcessEvent(pFnMovingWhichWay,NULL,&MovingWhichWay_Parms,NULL);
	pFnMovingWhichWay->FunctionFlags |= 0x400;
	if(Amount)
		*Amount = MovingWhichWay_Parms.Amount;
	return MovingWhichWay_Parms.ReturnValue;
}

struct Engine_Tick_Parms
{
	float                                              DeltaTime;                                        		// 0x000000 (0x0004)              
};

void AActor::Tick(float DeltaTime)
{
	static UFieldFunc* pFnTick = NULL;
	if(!pFnTick)
		pFnTick = UObject::FindFunction("Function Engine.Actor.Tick");

	Engine_Tick_Parms Tick_Parms;
	Tick_Parms.DeltaTime = DeltaTime;
	ProcessEvent(pFnTick,NULL,&Tick_Parms,NULL);
}

struct Engine_CanSplash_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::CanSplash()
{
	static UFieldFunc* pFnCanSplash = NULL;
	if(!pFnCanSplash)
		pFnCanSplash = UObject::FindFunction("Function Engine.Actor.CanSplash");

	Engine_CanSplash_Parms CanSplash_Parms;
	ProcessEvent(pFnCanSplash,NULL,&CanSplash_Parms,NULL);
	return CanSplash_Parms.ReturnValue;
}

struct Engine_GetURLMap_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x000000 (0x000C)              
};

struct FString AActor::GetURLMap()
{
	static UFieldFunc* pFnGetURLMap = NULL;
	if(!pFnGetURLMap)
		pFnGetURLMap = UObject::FindFunction("Function Engine.Actor.GetURLMap");

	Engine_GetURLMap_Parms GetURLMap_Parms;

	unsigned short NativeIndex = pFnGetURLMap->iNative;
	pFnGetURLMap->iNative = 0;
	pFnGetURLMap->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetURLMap,NULL,&GetURLMap_Parms,NULL);
	pFnGetURLMap->FunctionFlags |= 0x400;
	pFnGetURLMap->iNative = NativeIndex;
	return GetURLMap_Parms.ReturnValue;
}

struct Engine_OnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x000000 (0x0004)              
};

void AActor::OnAnimPlay(class UAnimNodeSequence* SeqNode)
{
	static UFieldFunc* pFnOnAnimPlay = NULL;
	if(!pFnOnAnimPlay)
		pFnOnAnimPlay = UObject::FindFunction("Function Engine.Actor.OnAnimPlay");

	Engine_OnAnimPlay_Parms OnAnimPlay_Parms;
	OnAnimPlay_Parms.SeqNode = SeqNode;
	ProcessEvent(pFnOnAnimPlay,NULL,&OnAnimPlay_Parms,NULL);
}

struct Engine_Move_Parms
{
	FVector3                                           Delta;                                            		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::Move(FVector3 Delta)
{
	static UFieldFunc* pFnMove = NULL;
	if(!pFnMove)
		pFnMove = UObject::FindFunction("Function Engine.Actor.Move");

	Engine_Move_Parms Move_Parms;
	memcpy(&Move_Parms.Delta,&Delta,0xC);

	unsigned short NativeIndex = pFnMove->iNative;
	pFnMove->iNative = 0;
	pFnMove->FunctionFlags |= ~0x400;
	ProcessEvent(pFnMove,NULL,&Move_Parms,NULL);
	pFnMove->FunctionFlags |= 0x400;
	pFnMove->iNative = NativeIndex;
	return Move_Parms.ReturnValue;
}

struct Engine_PointCheckComponent_Parms
{
	class UPrimitiveComponent*                         InComponent;                                      		// 0x000000 (0x0004)              
	FVector3                                           PointLocation;                                    		// 0x000004 (0x000C)              
	FVector3                                           PointExtent;                                      		// 0x000010 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
};

bool AActor::PointCheckComponent(class UPrimitiveComponent* InComponent,FVector3 PointLocation,FVector3 PointExtent)
{
	static UFieldFunc* pFnPointCheckComponent = NULL;
	if(!pFnPointCheckComponent)
		pFnPointCheckComponent = UObject::FindFunction("Function Engine.Actor.PointCheckComponent");

	Engine_PointCheckComponent_Parms PointCheckComponent_Parms;
	PointCheckComponent_Parms.InComponent = InComponent;
	memcpy(&PointCheckComponent_Parms.PointLocation,&PointLocation,0xC);
	memcpy(&PointCheckComponent_Parms.PointExtent,&PointExtent,0xC);
	pFnPointCheckComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPointCheckComponent,NULL,&PointCheckComponent_Parms,NULL);
	pFnPointCheckComponent->FunctionFlags |= 0x400;
	return PointCheckComponent_Parms.ReturnValue;
}

struct Engine_InterpolationChanged_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x000000 (0x0004)              
};

void AActor::InterpolationChanged(class USeqAct_Interp* InterpAction)
{
	static UFieldFunc* pFnInterpolationChanged = NULL;
	if(!pFnInterpolationChanged)
		pFnInterpolationChanged = UObject::FindFunction("Function Engine.Actor.InterpolationChanged");

	Engine_InterpolationChanged_Parms InterpolationChanged_Parms;
	InterpolationChanged_Parms.InterpAction = InterpAction;
	ProcessEvent(pFnInterpolationChanged,NULL,&InterpolationChanged_Parms,NULL);
}

struct Engine_CheckForErrors_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::CheckForErrors()
{
	static UFieldFunc* pFnCheckForErrors = NULL;
	if(!pFnCheckForErrors)
		pFnCheckForErrors = UObject::FindFunction("Function Engine.Actor.CheckForErrors");

	Engine_CheckForErrors_Parms CheckForErrors_Parms;
	ProcessEvent(pFnCheckForErrors,NULL,&CheckForErrors_Parms,NULL);
	return CheckForErrors_Parms.ReturnValue;
}

struct Engine_RootMotionExtracted_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x000000 (0x0004)              
	unsigned char                                      _0x000004[0xC];                                   		// 0x000004 (0x000C) MISSED OFFSET
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         		// 0x000010 (0x0030)              
};

void AActor::RootMotionExtracted(class USkeletalMeshComponent* SkelComp,struct FBoneAtom* ExtractedRootMotionDelta)
{
	static UFieldFunc* pFnRootMotionExtracted = NULL;
	if(!pFnRootMotionExtracted)
		pFnRootMotionExtracted = UObject::FindFunction("Function Engine.Actor.RootMotionExtracted");

	Engine_RootMotionExtracted_Parms RootMotionExtracted_Parms;
	RootMotionExtracted_Parms.SkelComp = SkelComp;
	ProcessEvent(pFnRootMotionExtracted,NULL,&RootMotionExtracted_Parms,NULL);
	if(ExtractedRootMotionDelta)
		memcpy(ExtractedRootMotionDelta,&RootMotionExtracted_Parms.ExtractedRootMotionDelta,0x30);
}

struct Engine_GetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x000000 (0x0001)              
};

unsigned char AActor::GetTeamNum()
{
	static UFieldFunc* pFnGetTeamNum = NULL;
	if(!pFnGetTeamNum)
		pFnGetTeamNum = UObject::FindFunction("Function Engine.Actor.GetTeamNum");

	Engine_GetTeamNum_Parms GetTeamNum_Parms;
	pFnGetTeamNum->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTeamNum,NULL,&GetTeamNum_Parms,NULL);
	pFnGetTeamNum->FunctionFlags |= 0x400;
	return GetTeamNum_Parms.ReturnValue;
}

struct Engine_Touch_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x000004 (0x0004)              
	FVector3                                           HitLocation;                                      		// 0x000008 (0x000C)              
	FVector3                                           HitNormal;                                        		// 0x000014 (0x000C)              
};

void AActor::Touch(class AActor* Other,class UPrimitiveComponent* OtherComp,FVector3 HitLocation,FVector3 HitNormal)
{
	static UFieldFunc* pFnTouch = NULL;
	if(!pFnTouch)
		pFnTouch = UObject::FindFunction("Function Engine.Actor.Touch");

	Engine_Touch_Parms Touch_Parms;
	Touch_Parms.Other = Other;
	Touch_Parms.OtherComp = OtherComp;
	memcpy(&Touch_Parms.HitLocation,&HitLocation,0xC);
	memcpy(&Touch_Parms.HitNormal,&HitNormal,0xC);
	ProcessEvent(pFnTouch,NULL,&Touch_Parms,NULL);
}

struct Engine_GainedChild_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::GainedChild(class AActor* Other)
{
	static UFieldFunc* pFnGainedChild = NULL;
	if(!pFnGainedChild)
		pFnGainedChild = UObject::FindFunction("Function Engine.Actor.GainedChild");

	Engine_GainedChild_Parms GainedChild_Parms;
	GainedChild_Parms.Other = Other;
	ProcessEvent(pFnGainedChild,NULL,&GainedChild_Parms,NULL);
}

struct Engine_PhysicsVolumeChange_Parms
{
	class APhysicsVolume*                              NewVolume;                                        		// 0x000000 (0x0004)              
};

void AActor::PhysicsVolumeChange(class APhysicsVolume* NewVolume)
{
	static UFieldFunc* pFnPhysicsVolumeChange = NULL;
	if(!pFnPhysicsVolumeChange)
		pFnPhysicsVolumeChange = UObject::FindFunction("Function Engine.Actor.PhysicsVolumeChange");

	Engine_PhysicsVolumeChange_Parms PhysicsVolumeChange_Parms;
	PhysicsVolumeChange_Parms.NewVolume = NewVolume;
	ProcessEvent(pFnPhysicsVolumeChange,NULL,&PhysicsVolumeChange_Parms,NULL);
}

struct Engine_OverlappingActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      out_Actor;                                        		// 0x000004 (0x0004)              
	float                                              Radius;                                           		// 0x000008 (0x0004)              
	FVector3                                           Loc;                                              		// 0x00000C (0x000C)              
	unsigned long                                      bIgnoreHidden : 1;                                		// 0x000018 (0x0004) [0x00000001] 
};

void AActor::OverlappingActors(class UClass* BaseClass,class AActor** out_Actor,float Radius,FVector3 Loc,bool bIgnoreHidden)
{
	static UFieldFunc* pFnOverlappingActors = NULL;
	if(!pFnOverlappingActors)
		pFnOverlappingActors = UObject::FindFunction("Function Engine.Actor.OverlappingActors");

	Engine_OverlappingActors_Parms OverlappingActors_Parms;
	OverlappingActors_Parms.BaseClass = BaseClass;
	OverlappingActors_Parms.Radius = Radius;
	memcpy(&OverlappingActors_Parms.Loc,&Loc,0xC);
	OverlappingActors_Parms.bIgnoreHidden = bIgnoreHidden;
	pFnOverlappingActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnOverlappingActors,NULL,&OverlappingActors_Parms,NULL);
	pFnOverlappingActors->FunctionFlags |= 0x400;
	if(out_Actor)
		*out_Actor = OverlappingActors_Parms.out_Actor;
}

struct Engine_SetHidden_Parms
{
	unsigned long                                      bNewHidden : 1;                                   		// 0x000000 (0x0004) [0x00000001] 
};

void AActor::SetHidden(bool bNewHidden)
{
	static UFieldFunc* pFnSetHidden = NULL;
	if(!pFnSetHidden)
		pFnSetHidden = UObject::FindFunction("Function Engine.Actor.SetHidden");

	Engine_SetHidden_Parms SetHidden_Parms;
	SetHidden_Parms.bNewHidden = bNewHidden;
	pFnSetHidden->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetHidden,NULL,&SetHidden_Parms,NULL);
	pFnSetHidden->FunctionFlags |= 0x400;
}

struct Engine_SuggestTossVelocity_Parms
{
	FVector3                                           TossVelocity;                                     		// 0x000000 (0x000C)              
	FVector3                                           Destination;                                      		// 0x00000C (0x000C)              
	FVector3                                           Start;                                            		// 0x000018 (0x000C)              
	float                                              TossSpeed;                                        		// 0x000024 (0x0004)              
	float                                              BaseTossZ;                                        		// 0x000028 (0x0004)              
	float                                              DesiredZPct;                                      		// 0x00002C (0x0004)              
	FVector3                                           CollisionSize;                                    		// 0x000030 (0x000C)              
	float                                              TerminalVelocity;                                 		// 0x00003C (0x0004)              
	float                                              OverrideGravityZ;                                 		// 0x000040 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000044 (0x0004) [0x00000001] 
};

bool AActor::SuggestTossVelocity(FVector3* TossVelocity,FVector3 Destination,FVector3 Start,float TossSpeed,float BaseTossZ,float DesiredZPct,FVector3 CollisionSize,float TerminalVelocity,float OverrideGravityZ)
{
	static UFieldFunc* pFnSuggestTossVelocity = NULL;
	if(!pFnSuggestTossVelocity)
		pFnSuggestTossVelocity = UObject::FindFunction("Function Engine.Actor.SuggestTossVelocity");

	Engine_SuggestTossVelocity_Parms SuggestTossVelocity_Parms;
	memcpy(&SuggestTossVelocity_Parms.Destination,&Destination,0xC);
	memcpy(&SuggestTossVelocity_Parms.Start,&Start,0xC);
	SuggestTossVelocity_Parms.TossSpeed = TossSpeed;
	SuggestTossVelocity_Parms.BaseTossZ = BaseTossZ;
	SuggestTossVelocity_Parms.DesiredZPct = DesiredZPct;
	memcpy(&SuggestTossVelocity_Parms.CollisionSize,&CollisionSize,0xC);
	SuggestTossVelocity_Parms.TerminalVelocity = TerminalVelocity;
	SuggestTossVelocity_Parms.OverrideGravityZ = OverrideGravityZ;
	pFnSuggestTossVelocity->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSuggestTossVelocity,NULL,&SuggestTossVelocity_Parms,NULL);
	pFnSuggestTossVelocity->FunctionFlags |= 0x400;
	if(TossVelocity)
		memcpy(TossVelocity,&SuggestTossVelocity_Parms.TossVelocity,0xC);
	return SuggestTossVelocity_Parms.ReturnValue;
}

struct Engine_OnToggleHidden_Parms
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnToggleHidden(class USeqAct_ToggleHidden* Action)
{
	static UFieldFunc* pFnOnToggleHidden = NULL;
	if(!pFnOnToggleHidden)
		pFnOnToggleHidden = UObject::FindFunction("Function Engine.Actor.OnToggleHidden");

	Engine_OnToggleHidden_Parms OnToggleHidden_Parms;
	OnToggleHidden_Parms.Action = Action;
	ProcessEvent(pFnOnToggleHidden,NULL,&OnToggleHidden_Parms,NULL);
}

struct Engine_ReplaceText_Parms
{
	struct FString                                     Text;                                             		// 0x000000 (0x000C)              
	struct FString                                     Replace;                                          		// 0x00000C (0x000C)              
	struct FString                                     With;                                             		// 0x000018 (0x000C)              
	//int                                                I;                                                		// 0x000024 (0x0004)              
	//struct FString                                     Input;                                            		// 0x000028 (0x000C)              
};

void AActor::ReplaceText(struct FString* Text,struct FString Replace,struct FString With)
{
	static UFieldFunc* pFnReplaceText = NULL;
	if(!pFnReplaceText)
		pFnReplaceText = UObject::FindFunction("Function Engine.Actor.ReplaceText");

	Engine_ReplaceText_Parms ReplaceText_Parms;
	memcpy(&ReplaceText_Parms.Replace,&Replace,0xC);
	memcpy(&ReplaceText_Parms.With,&With,0xC);
	ProcessEvent(pFnReplaceText,NULL,&ReplaceText_Parms,NULL);
	if(Text)
		memcpy(Text,&ReplaceText_Parms.Text,0xC);
}

struct Engine_PostTeleport_Parms
{
	class ATeleporter*                                 OutTeleporter;                                    		// 0x000000 (0x0004)              
};

void AActor::PostTeleport(class ATeleporter* OutTeleporter)
{
	static UFieldFunc* pFnPostTeleport = NULL;
	if(!pFnPostTeleport)
		pFnPostTeleport = UObject::FindFunction("Function Engine.Actor.PostTeleport");

	Engine_PostTeleport_Parms PostTeleport_Parms;
	PostTeleport_Parms.OutTeleporter = OutTeleporter;
	ProcessEvent(pFnPostTeleport,NULL,&PostTeleport_Parms,NULL);
}

struct Engine_ConstraintBrokenNotify_Parms
{
	class AActor*                                      ConOwner;                                         		// 0x000000 (0x0004)              
	class URB_ConstraintSetup*                         ConSetup;                                         		// 0x000004 (0x0004)              
	class URB_ConstraintInstance*                      ConInstance;                                      		// 0x000008 (0x0004)              
};

void AActor::ConstraintBrokenNotify(class AActor* ConOwner,class URB_ConstraintSetup* ConSetup,class URB_ConstraintInstance* ConInstance)
{
	static UFieldFunc* pFnConstraintBrokenNotify = NULL;
	if(!pFnConstraintBrokenNotify)
		pFnConstraintBrokenNotify = UObject::FindFunction("Function Engine.Actor.ConstraintBrokenNotify");

	Engine_ConstraintBrokenNotify_Parms ConstraintBrokenNotify_Parms;
	ConstraintBrokenNotify_Parms.ConOwner = ConOwner;
	ConstraintBrokenNotify_Parms.ConSetup = ConSetup;
	ConstraintBrokenNotify_Parms.ConInstance = ConInstance;
	ProcessEvent(pFnConstraintBrokenNotify,NULL,&ConstraintBrokenNotify_Parms,NULL);
}

struct Engine_NativePostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x000000 (0x0004)              
	class UCanvas*                                     Canvas;                                           		// 0x000004 (0x0004)              
	FVector3                                           CameraPosition;                                   		// 0x000008 (0x000C)              
	FVector3                                           CameraDir;                                        		// 0x000014 (0x000C)              
};

void AActor::NativePostRenderFor(class APlayerController* PC,class UCanvas* Canvas,FVector3 CameraPosition,FVector3 CameraDir)
{
	static UFieldFunc* pFnNativePostRenderFor = NULL;
	if(!pFnNativePostRenderFor)
		pFnNativePostRenderFor = UObject::FindFunction("Function Engine.Actor.NativePostRenderFor");

	Engine_NativePostRenderFor_Parms NativePostRenderFor_Parms;
	NativePostRenderFor_Parms.PC = PC;
	NativePostRenderFor_Parms.Canvas = Canvas;
	memcpy(&NativePostRenderFor_Parms.CameraPosition,&CameraPosition,0xC);
	memcpy(&NativePostRenderFor_Parms.CameraDir,&CameraDir,0xC);
	pFnNativePostRenderFor->FunctionFlags |= ~0x400;
	ProcessEvent(pFnNativePostRenderFor,NULL,&NativePostRenderFor_Parms,NULL);
	pFnNativePostRenderFor->FunctionFlags |= 0x400;
}

struct Engine_ActivateEventClass_Parms
{
	class UClass*                                      InClass;                                          		// 0x000000 (0x0004)              
	class AActor*                                      InInstigator;                                     		// 0x000004 (0x0004)              
	TArray<class USequenceEvent*>                      EventList;                                        		// 0x000008 (0x000C)              
	TArray<int>                                        ActivateIndices;                                  		// 0x000014 (0x000C)              
	unsigned long                                      bTest : 1;                                        		// 0x000020 (0x0004) [0x00000001] 
	TArray<class USequenceEvent*>                      ActivatedEvents;                                  		// 0x000024 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000030 (0x0004) [0x00000001] 
	//class USequenceEvent*                              Evt;                                              		// 0x000034 (0x0004)              
};

bool AActor::ActivateEventClass(class UClass* InClass,class AActor* InInstigator,TArray<class USequenceEvent*>* EventList,TArray<int>* ActivateIndices,bool bTest,TArray<class USequenceEvent*>* ActivatedEvents)
{
	static UFieldFunc* pFnActivateEventClass = NULL;
	if(!pFnActivateEventClass)
		pFnActivateEventClass = UObject::FindFunction("Function Engine.Actor.ActivateEventClass");

	Engine_ActivateEventClass_Parms ActivateEventClass_Parms;
	ActivateEventClass_Parms.InClass = InClass;
	ActivateEventClass_Parms.InInstigator = InInstigator;
	ActivateEventClass_Parms.bTest = bTest;
	ProcessEvent(pFnActivateEventClass,NULL,&ActivateEventClass_Parms,NULL);
	if(EventList)
		memcpy(EventList,&ActivateEventClass_Parms.EventList,0xC);
	if(ActivateIndices)
		memcpy(ActivateIndices,&ActivateEventClass_Parms.ActivateIndices,0xC);
	if(ActivatedEvents)
		memcpy(ActivatedEvents,&ActivateEventClass_Parms.ActivatedEvents,0xC);
	return ActivateEventClass_Parms.ReturnValue;
}

struct Engine_Falling_Parms
{
};

void AActor::Falling()
{
	static UFieldFunc* pFnFalling = NULL;
	if(!pFnFalling)
		pFnFalling = UObject::FindFunction("Function Engine.Actor.Falling");

	Engine_Falling_Parms Falling_Parms;
	pFnFalling->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFalling,NULL,&Falling_Parms,NULL);
	pFnFalling->FunctionFlags |= 0x400;
}

struct Engine_HurtRadius_Parms
{
	float                                              BaseDamage;                                       		// 0x000000 (0x0004)              
	float                                              DamageRadius;                                     		// 0x000004 (0x0004)              
	class UClass*                                      DamageType;                                       		// 0x000008 (0x0004)              
	float                                              Momentum;                                         		// 0x00000C (0x0004)              
	FVector3                                           HurtOrigin;                                       		// 0x000010 (0x000C)              
	class AActor*                                      IgnoredActor;                                     		// 0x00001C (0x0004)              
	class AController*                                 InstigatedByController;                           		// 0x000020 (0x0004)              
	unsigned long                                      bDoFullDamage : 1;                                		// 0x000024 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000028 (0x0004) [0x00000001] 
	//class AActor*                                      Victim;                                           		// 0x00002C (0x0004)              
	//unsigned long                                      bCausedDamage : 1;                                		// 0x000030 (0x0004) [0x00000001] 
};

bool AActor::HurtRadius(float BaseDamage,float DamageRadius,class UClass* DamageType,float Momentum,FVector3 HurtOrigin,class AActor* IgnoredActor,class AController* InstigatedByController,bool bDoFullDamage)
{
	static UFieldFunc* pFnHurtRadius = NULL;
	if(!pFnHurtRadius)
		pFnHurtRadius = UObject::FindFunction("Function Engine.Actor.HurtRadius");

	Engine_HurtRadius_Parms HurtRadius_Parms;
	HurtRadius_Parms.BaseDamage = BaseDamage;
	HurtRadius_Parms.DamageRadius = DamageRadius;
	HurtRadius_Parms.DamageType = DamageType;
	HurtRadius_Parms.Momentum = Momentum;
	memcpy(&HurtRadius_Parms.HurtOrigin,&HurtOrigin,0xC);
	HurtRadius_Parms.IgnoredActor = IgnoredActor;
	HurtRadius_Parms.InstigatedByController = InstigatedByController;
	HurtRadius_Parms.bDoFullDamage = bDoFullDamage;
	ProcessEvent(pFnHurtRadius,NULL,&HurtRadius_Parms,NULL);
	return HurtRadius_Parms.ReturnValue;
}

struct Engine_GetComponentsBoundingBox_Parms
{
	struct FBox                                        ActorBox;                                         		// 0x000000 (0x001C)              
};

void AActor::GetComponentsBoundingBox(struct FBox* ActorBox)
{
	static UFieldFunc* pFnGetComponentsBoundingBox = NULL;
	if(!pFnGetComponentsBoundingBox)
		pFnGetComponentsBoundingBox = UObject::FindFunction("Function Engine.Actor.GetComponentsBoundingBox");

	Engine_GetComponentsBoundingBox_Parms GetComponentsBoundingBox_Parms;
	pFnGetComponentsBoundingBox->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetComponentsBoundingBox,NULL,&GetComponentsBoundingBox_Parms,NULL);
	pFnGetComponentsBoundingBox->FunctionFlags |= 0x400;
	if(ActorBox)
		memcpy(ActorBox,&GetComponentsBoundingBox_Parms.ActorBox,0x1C);
}

struct Engine_GetDestination_Parms
{
	class AController*                                 C;                                                		// 0x000000 (0x0004)              
	FVector3                                           ReturnValue;                                      		// 0x000004 (0x000C)              
};

FVector3 AActor::GetDestination(class AController* C)
{
	static UFieldFunc* pFnGetDestination = NULL;
	if(!pFnGetDestination)
		pFnGetDestination = UObject::FindFunction("Function Engine.Actor.GetDestination");

	Engine_GetDestination_Parms GetDestination_Parms;
	GetDestination_Parms.C = C;
	pFnGetDestination->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetDestination,NULL,&GetDestination_Parms,NULL);
	pFnGetDestination->FunctionFlags |= 0x400;
	return GetDestination_Parms.ReturnValue;
}

struct Engine_GetActorEyesViewPoint_Parms
{
	FVector3                                           out_Location;                                     		// 0x000000 (0x000C)              
	FRotator                                           out_Rotation;                                     		// 0x00000C (0x000C)              
};

void AActor::GetActorEyesViewPoint(FVector3* out_Location,FRotator* out_Rotation)
{
	static UFieldFunc* pFnGetActorEyesViewPoint = NULL;
	if(!pFnGetActorEyesViewPoint)
		pFnGetActorEyesViewPoint = UObject::FindFunction("Function Engine.Actor.GetActorEyesViewPoint");

	Engine_GetActorEyesViewPoint_Parms GetActorEyesViewPoint_Parms;
	pFnGetActorEyesViewPoint->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetActorEyesViewPoint,NULL,&GetActorEyesViewPoint_Parms,NULL);
	pFnGetActorEyesViewPoint->FunctionFlags |= 0x400;
	if(out_Location)
		memcpy(out_Location,&GetActorEyesViewPoint_Parms.out_Location,0xC);
	if(out_Rotation)
		memcpy(out_Rotation,&GetActorEyesViewPoint_Parms.out_Rotation,0xC);
}

struct Engine_SetHUDLocation_Parms
{
	FVector3                                           NewHUDLocation;                                   		// 0x000000 (0x000C)              
};

void AActor::SetHUDLocation(FVector3 NewHUDLocation)
{
	static UFieldFunc* pFnSetHUDLocation = NULL;
	if(!pFnSetHUDLocation)
		pFnSetHUDLocation = UObject::FindFunction("Function Engine.Actor.SetHUDLocation");

	Engine_SetHUDLocation_Parms SetHUDLocation_Parms;
	memcpy(&SetHUDLocation_Parms.NewHUDLocation,&NewHUDLocation,0xC);
	pFnSetHUDLocation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetHUDLocation,NULL,&SetHUDLocation_Parms,NULL);
	pFnSetHUDLocation->FunctionFlags |= 0x400;
}

struct Engine_BroadcastLocalizedTeamMessage_Parms
{
	int                                                TeamIndex;                                        		// 0x000000 (0x0004)              
	class UClass*                                      InMessageClass;                                   		// 0x000004 (0x0004)              
	int                                                Switch;                                           		// 0x000008 (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x00000C (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x000010 (0x0004)              
	class UObject*                                     OptionalObject;                                   		// 0x000014 (0x0004)              
};

void AActor::BroadcastLocalizedTeamMessage(int TeamIndex,class UClass* InMessageClass,int Switch,class APlayerReplicationInfo* RelatedPRI,class APlayerReplicationInfo* RelatedPRI,class UObject* OptionalObject)
{
	static UFieldFunc* pFnBroadcastLocalizedTeamMessage = NULL;
	if(!pFnBroadcastLocalizedTeamMessage)
		pFnBroadcastLocalizedTeamMessage = UObject::FindFunction("Function Engine.Actor.BroadcastLocalizedTeamMessage");

	Engine_BroadcastLocalizedTeamMessage_Parms BroadcastLocalizedTeamMessage_Parms;
	BroadcastLocalizedTeamMessage_Parms.TeamIndex = TeamIndex;
	BroadcastLocalizedTeamMessage_Parms.InMessageClass = InMessageClass;
	BroadcastLocalizedTeamMessage_Parms.Switch = Switch;
	BroadcastLocalizedTeamMessage_Parms.RelatedPRI = RelatedPRI;
	BroadcastLocalizedTeamMessage_Parms.RelatedPRI = RelatedPRI;
	BroadcastLocalizedTeamMessage_Parms.OptionalObject = OptionalObject;
	ProcessEvent(pFnBroadcastLocalizedTeamMessage,NULL,&BroadcastLocalizedTeamMessage_Parms,NULL);
}

struct Engine_FindActorsOfClass_Parms
{
	class UClass*                                      ActorClass;                                       		// 0x000000 (0x0004)              
	TArray<class AActor*>                              out_Actors;                                       		// 0x000004 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
	//class AActor*                                      TestActor;                                        		// 0x000014 (0x0004)              
};

bool AActor::FindActorsOfClass(class UClass* ActorClass,TArray<class AActor*>* out_Actors)
{
	static UFieldFunc* pFnFindActorsOfClass = NULL;
	if(!pFnFindActorsOfClass)
		pFnFindActorsOfClass = UObject::FindFunction("Function Engine.Actor.FindActorsOfClass");

	Engine_FindActorsOfClass_Parms FindActorsOfClass_Parms;
	FindActorsOfClass_Parms.ActorClass = ActorClass;
	ProcessEvent(pFnFindActorsOfClass,NULL,&FindActorsOfClass_Parms,NULL);
	if(out_Actors)
		memcpy(out_Actors,&FindActorsOfClass_Parms.out_Actors,0xC);
	return FindActorsOfClass_Parms.ReturnValue;
}

struct Engine_FellOutOfWorld_Parms
{
	class UClass*                                      dmgType;                                          		// 0x000000 (0x0004)              
};

void AActor::FellOutOfWorld(class UClass* dmgType)
{
	static UFieldFunc* pFnFellOutOfWorld = NULL;
	if(!pFnFellOutOfWorld)
		pFnFellOutOfWorld = UObject::FindFunction("Function Engine.Actor.FellOutOfWorld");

	Engine_FellOutOfWorld_Parms FellOutOfWorld_Parms;
	FellOutOfWorld_Parms.dmgType = dmgType;
	ProcessEvent(pFnFellOutOfWorld,NULL,&FellOutOfWorld_Parms,NULL);
}

struct Engine_DrawDebugCoordinateSystem_Parms
{
	FVector3                                           AxisLoc;                                          		// 0x000000 (0x000C)              
	FRotator                                           AxisRot;                                          		// 0x00000C (0x000C)              
	float                                              Scale;                                            		// 0x000018 (0x0004)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x00001C (0x0004) [0x00000001] 
};

void AActor::DrawDebugCoordinateSystem(FVector3 AxisLoc,FRotator AxisRot,float Scale,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugCoordinateSystem = NULL;
	if(!pFnDrawDebugCoordinateSystem)
		pFnDrawDebugCoordinateSystem = UObject::FindFunction("Function Engine.Actor.DrawDebugCoordinateSystem");

	Engine_DrawDebugCoordinateSystem_Parms DrawDebugCoordinateSystem_Parms;
	memcpy(&DrawDebugCoordinateSystem_Parms.AxisLoc,&AxisLoc,0xC);
	memcpy(&DrawDebugCoordinateSystem_Parms.AxisRot,&AxisRot,0xC);
	DrawDebugCoordinateSystem_Parms.Scale = Scale;
	DrawDebugCoordinateSystem_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugCoordinateSystem->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugCoordinateSystem,NULL,&DrawDebugCoordinateSystem_Parms,NULL);
	pFnDrawDebugCoordinateSystem->FunctionFlags |= 0x400;
}

struct Engine_GetBoundingCylinder_Parms
{
	float                                              CollisionRadius;                                  		// 0x000000 (0x0004)              
	float                                              CollisionHeight;                                  		// 0x000004 (0x0004)              
};

void AActor::GetBoundingCylinder(float* CollisionRadius,float* CollisionHeight)
{
	static UFieldFunc* pFnGetBoundingCylinder = NULL;
	if(!pFnGetBoundingCylinder)
		pFnGetBoundingCylinder = UObject::FindFunction("Function Engine.Actor.GetBoundingCylinder");

	Engine_GetBoundingCylinder_Parms GetBoundingCylinder_Parms;
	pFnGetBoundingCylinder->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBoundingCylinder,NULL,&GetBoundingCylinder_Parms,NULL);
	pFnGetBoundingCylinder->FunctionFlags |= 0x400;
	if(CollisionRadius)
		*CollisionRadius = GetBoundingCylinder_Parms.CollisionRadius;
	if(CollisionHeight)
		*CollisionHeight = GetBoundingCylinder_Parms.CollisionHeight;
}

struct Engine_Clock_Parms
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
};

void AActor::Clock(float* Time)
{
	static UFieldFunc* pFnClock = NULL;
	if(!pFnClock)
		pFnClock = UObject::FindFunction("Function Engine.Actor.Clock");

	Engine_Clock_Parms Clock_Parms;
	pFnClock->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClock,NULL,&Clock_Parms,NULL);
	pFnClock->FunctionFlags |= 0x400;
	if(Time)
		*Time = Clock_Parms.Time;
}

struct Engine_GetPhysicsName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x000000 (0x000C)              
};

struct FString AActor::GetPhysicsName()
{
	static UFieldFunc* pFnGetPhysicsName = NULL;
	if(!pFnGetPhysicsName)
		pFnGetPhysicsName = UObject::FindFunction("Function Engine.Actor.GetPhysicsName");

	Engine_GetPhysicsName_Parms GetPhysicsName_Parms;
	ProcessEvent(pFnGetPhysicsName,NULL,&GetPhysicsName_Parms,NULL);
	return GetPhysicsName_Parms.ReturnValue;
}

struct Engine_FastTrace_Parms
{
	FVector3                                           TraceEnd;                                         		// 0x000000 (0x000C)              
	FVector3                                           TraceStart;                                       		// 0x00000C (0x000C)              
	FVector3                                           BoxExtent;                                        		// 0x000018 (0x000C)              
	unsigned long                                      bTraceBullet : 1;                                 		// 0x000024 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000028 (0x0004) [0x00000001] 
};

bool AActor::FastTrace(FVector3 TraceEnd,FVector3 TraceStart,FVector3 BoxExtent,bool bTraceBullet)
{
	static UFieldFunc* pFnFastTrace = NULL;
	if(!pFnFastTrace)
		pFnFastTrace = UObject::FindFunction("Function Engine.Actor.FastTrace");

	Engine_FastTrace_Parms FastTrace_Parms;
	memcpy(&FastTrace_Parms.TraceEnd,&TraceEnd,0xC);
	memcpy(&FastTrace_Parms.TraceStart,&TraceStart,0xC);
	memcpy(&FastTrace_Parms.BoxExtent,&BoxExtent,0xC);
	FastTrace_Parms.bTraceBullet = bTraceBullet;

	unsigned short NativeIndex = pFnFastTrace->iNative;
	pFnFastTrace->iNative = 0;
	pFnFastTrace->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFastTrace,NULL,&FastTrace_Parms,NULL);
	pFnFastTrace->FunctionFlags |= 0x400;
	pFnFastTrace->iNative = NativeIndex;
	return FastTrace_Parms.ReturnValue;
}

struct Engine_ConsoleCommand_Parms
{
	struct FString                                     Command;                                          		// 0x000000 (0x000C)              
	unsigned long                                      bWriteToLog : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
	struct FString                                     ReturnValue;                                      		// 0x000010 (0x000C)              
};

struct FString AActor::ConsoleCommand(struct FString Command,bool bWriteToLog)
{
	static UFieldFunc* pFnConsoleCommand = NULL;
	if(!pFnConsoleCommand)
		pFnConsoleCommand = UObject::FindFunction("Function Engine.Actor.ConsoleCommand");

	Engine_ConsoleCommand_Parms ConsoleCommand_Parms;
	memcpy(&ConsoleCommand_Parms.Command,&Command,0xC);
	ConsoleCommand_Parms.bWriteToLog = bWriteToLog;
	pFnConsoleCommand->FunctionFlags |= ~0x400;
	ProcessEvent(pFnConsoleCommand,NULL,&ConsoleCommand_Parms,NULL);
	pFnConsoleCommand->FunctionFlags |= 0x400;
	return ConsoleCommand_Parms.ReturnValue;
}

struct Engine_RanInto_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::RanInto(class AActor* Other)
{
	static UFieldFunc* pFnRanInto = NULL;
	if(!pFnRanInto)
		pFnRanInto = UObject::FindFunction("Function Engine.Actor.RanInto");

	Engine_RanInto_Parms RanInto_Parms;
	RanInto_Parms.Other = Other;
	ProcessEvent(pFnRanInto,NULL,&RanInto_Parms,NULL);
}

struct Engine_CallSuperReplicated_Parms
{
	struct FName                                       VarName;                                          		// 0x000000 (0x0008)              
};

void AActor::CallSuperReplicated(struct FName VarName)
{
	static UFieldFunc* pFnCallSuperReplicated = NULL;
	if(!pFnCallSuperReplicated)
		pFnCallSuperReplicated = UObject::FindFunction("Function Engine.Actor.CallSuperReplicated");

	Engine_CallSuperReplicated_Parms CallSuperReplicated_Parms;
	memcpy(&CallSuperReplicated_Parms.VarName,&VarName,0x8);
	ProcessEvent(pFnCallSuperReplicated,NULL,&CallSuperReplicated_Parms,NULL);
}

struct Engine_OverRotated_Parms
{
	FRotator                                           out_Desired;                                      		// 0x000000 (0x000C)              
	FRotator                                           out_Actual;                                       		// 0x00000C (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};

bool AActor::OverRotated(FRotator* out_Desired,FRotator* out_Actual)
{
	static UFieldFunc* pFnOverRotated = NULL;
	if(!pFnOverRotated)
		pFnOverRotated = UObject::FindFunction("Function Engine.Actor.OverRotated");

	Engine_OverRotated_Parms OverRotated_Parms;
	ProcessEvent(pFnOverRotated,NULL,&OverRotated_Parms,NULL);
	if(out_Desired)
		memcpy(out_Desired,&OverRotated_Parms.out_Desired,0xC);
	if(out_Actual)
		memcpy(out_Actual,&OverRotated_Parms.out_Actual,0xC);
	return OverRotated_Parms.ReturnValue;
}

struct Engine_CheckMaxEffectDistance_Parms
{
	class APlayerController*                           P;                                                		// 0x000000 (0x0004)              
	FVector3                                           SpawnLocation;                                    		// 0x000004 (0x000C)              
	float                                              CullDistance;                                     		// 0x000010 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000014 (0x0004) [0x00000001] 
	//float                                              Dist;                                             		// 0x000018 (0x0004)              
};

bool AActor::CheckMaxEffectDistance(class APlayerController* P,FVector3 SpawnLocation,float CullDistance)
{
	static UFieldFunc* pFnCheckMaxEffectDistance = NULL;
	if(!pFnCheckMaxEffectDistance)
		pFnCheckMaxEffectDistance = UObject::FindFunction("Function Engine.Actor.CheckMaxEffectDistance");

	Engine_CheckMaxEffectDistance_Parms CheckMaxEffectDistance_Parms;
	CheckMaxEffectDistance_Parms.P = P;
	memcpy(&CheckMaxEffectDistance_Parms.SpawnLocation,&SpawnLocation,0xC);
	CheckMaxEffectDistance_Parms.CullDistance = CullDistance;
	ProcessEvent(pFnCheckMaxEffectDistance,NULL,&CheckMaxEffectDistance_Parms,NULL);
	return CheckMaxEffectDistance_Parms.ReturnValue;
}

struct Engine_Attach_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::Attach(class AActor* Other)
{
	static UFieldFunc* pFnAttach = NULL;
	if(!pFnAttach)
		pFnAttach = UObject::FindFunction("Function Engine.Actor.Attach");

	Engine_Attach_Parms Attach_Parms;
	Attach_Parms.Other = Other;
	ProcessEvent(pFnAttach,NULL,&Attach_Parms,NULL);
}

struct Engine_AttachComponent_Parms
{
	class UActorComponent*                             NewComponent;                                     		// 0x000000 (0x0004)              
};

void AActor::AttachComponent(class UActorComponent* NewComponent)
{
	static UFieldFunc* pFnAttachComponent = NULL;
	if(!pFnAttachComponent)
		pFnAttachComponent = UObject::FindFunction("Function Engine.Actor.AttachComponent");

	Engine_AttachComponent_Parms AttachComponent_Parms;
	AttachComponent_Parms.NewComponent = NewComponent;
	pFnAttachComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAttachComponent,NULL,&AttachComponent_Parms,NULL);
	pFnAttachComponent->FunctionFlags |= 0x400;
}

struct Engine_PreTeleport_Parms
{
	class ATeleporter*                                 InTeleporter;                                     		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::PreTeleport(class ATeleporter* InTeleporter)
{
	static UFieldFunc* pFnPreTeleport = NULL;
	if(!pFnPreTeleport)
		pFnPreTeleport = UObject::FindFunction("Function Engine.Actor.PreTeleport");

	Engine_PreTeleport_Parms PreTeleport_Parms;
	PreTeleport_Parms.InTeleporter = InTeleporter;
	ProcessEvent(pFnPreTeleport,NULL,&PreTeleport_Parms,NULL);
	return PreTeleport_Parms.ReturnValue;
}

struct Engine_OutsideWorldBounds_Parms
{
};

void AActor::OutsideWorldBounds()
{
	static UFieldFunc* pFnOutsideWorldBounds = NULL;
	if(!pFnOutsideWorldBounds)
		pFnOutsideWorldBounds = UObject::FindFunction("Function Engine.Actor.OutsideWorldBounds");

	Engine_OutsideWorldBounds_Parms OutsideWorldBounds_Parms;
	ProcessEvent(pFnOutsideWorldBounds,NULL,&OutsideWorldBounds_Parms,NULL);
}

struct Engine_IsOwnedBy_Parms
{
	class AActor*                                      TestActor;                                        		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::IsOwnedBy(class AActor* TestActor)
{
	static UFieldFunc* pFnIsOwnedBy = NULL;
	if(!pFnIsOwnedBy)
		pFnIsOwnedBy = UObject::FindFunction("Function Engine.Actor.IsOwnedBy");

	Engine_IsOwnedBy_Parms IsOwnedBy_Parms;
	IsOwnedBy_Parms.TestActor = TestActor;
	pFnIsOwnedBy->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsOwnedBy,NULL,&IsOwnedBy_Parms,NULL);
	pFnIsOwnedBy->FunctionFlags |= 0x400;
	return IsOwnedBy_Parms.ReturnValue;
}

struct Engine_GetTerminalVelocity_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float AActor::GetTerminalVelocity()
{
	static UFieldFunc* pFnGetTerminalVelocity = NULL;
	if(!pFnGetTerminalVelocity)
		pFnGetTerminalVelocity = UObject::FindFunction("Function Engine.Actor.GetTerminalVelocity");

	Engine_GetTerminalVelocity_Parms GetTerminalVelocity_Parms;
	pFnGetTerminalVelocity->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTerminalVelocity,NULL,&GetTerminalVelocity_Parms,NULL);
	pFnGetTerminalVelocity->FunctionFlags |= 0x400;
	return GetTerminalVelocity_Parms.ReturnValue;
}

struct Engine_PreBeginPlay_Parms
{
};

void AActor::PreBeginPlay()
{
	static UFieldFunc* pFnPreBeginPlay = NULL;
	if(!pFnPreBeginPlay)
		pFnPreBeginPlay = UObject::FindFunction("Function Engine.Actor.PreBeginPlay");

	Engine_PreBeginPlay_Parms PreBeginPlay_Parms;
	ProcessEvent(pFnPreBeginPlay,NULL,&PreBeginPlay_Parms,NULL);
}

struct Engine_SetForcedInitialReplicatedProperty_Parms
{
	class UField*                                      PropToReplicate;                                  		// 0x000000 (0x0004)              
	unsigned long                                      bAdd : 1;                                         		// 0x000004 (0x0004) [0x00000001] 
};

void AActor::SetForcedInitialReplicatedProperty(class UField* PropToReplicate,bool bAdd)
{
	static UFieldFunc* pFnSetForcedInitialReplicatedProperty = NULL;
	if(!pFnSetForcedInitialReplicatedProperty)
		pFnSetForcedInitialReplicatedProperty = UObject::FindFunction("Function Engine.Actor.SetForcedInitialReplicatedProperty");

	Engine_SetForcedInitialReplicatedProperty_Parms SetForcedInitialReplicatedProperty_Parms;
	SetForcedInitialReplicatedProperty_Parms.PropToReplicate = PropToReplicate;
	SetForcedInitialReplicatedProperty_Parms.bAdd = bAdd;
	pFnSetForcedInitialReplicatedProperty->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetForcedInitialReplicatedProperty,NULL,&SetForcedInitialReplicatedProperty_Parms,NULL);
	pFnSetForcedInitialReplicatedProperty->FunctionFlags |= 0x400;
}

struct Engine_GetFaceFXAudioComponent_Parms
{
	class UAudioComponent*                             ReturnValue;                                      		// 0x000000 (0x0004)              
};

class UAudioComponent* AActor::GetFaceFXAudioComponent()
{
	static UFieldFunc* pFnGetFaceFXAudioComponent = NULL;
	if(!pFnGetFaceFXAudioComponent)
		pFnGetFaceFXAudioComponent = UObject::FindFunction("Function Engine.Actor.GetFaceFXAudioComponent");

	Engine_GetFaceFXAudioComponent_Parms GetFaceFXAudioComponent_Parms;
	ProcessEvent(pFnGetFaceFXAudioComponent,NULL,&GetFaceFXAudioComponent_Parms,NULL);
	return GetFaceFXAudioComponent_Parms.ReturnValue;
}

struct Engine_EffectIsRelevant_Parms
{
	FVector3                                           SpawnLocation;                                    		// 0x000000 (0x000C)              
	unsigned long                                      bForceDedicated : 1;                              		// 0x00000C (0x0004) [0x00000001] 
	float                                              CullDistance;                                     		// 0x000010 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000014 (0x0004) [0x00000001] 
	//class APlayerController*                           P;                                                		// 0x000018 (0x0004)              
	//unsigned long                                      bResult : 1;                                      		// 0x00001C (0x0004) [0x00000001] 
};

bool AActor::EffectIsRelevant(FVector3 SpawnLocation,bool bForceDedicated,float CullDistance)
{
	static UFieldFunc* pFnEffectIsRelevant = NULL;
	if(!pFnEffectIsRelevant)
		pFnEffectIsRelevant = UObject::FindFunction("Function Engine.Actor.EffectIsRelevant");

	Engine_EffectIsRelevant_Parms EffectIsRelevant_Parms;
	memcpy(&EffectIsRelevant_Parms.SpawnLocation,&SpawnLocation,0xC);
	EffectIsRelevant_Parms.bForceDedicated = bForceDedicated;
	EffectIsRelevant_Parms.CullDistance = CullDistance;
	ProcessEvent(pFnEffectIsRelevant,NULL,&EffectIsRelevant_Parms,NULL);
	return EffectIsRelevant_Parms.ReturnValue;
}

struct Engine_GetHumanReadableName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x000000 (0x000C)              
};

struct FString AActor::GetHumanReadableName()
{
	static UFieldFunc* pFnGetHumanReadableName = NULL;
	if(!pFnGetHumanReadableName)
		pFnGetHumanReadableName = UObject::FindFunction("Function Engine.Actor.GetHumanReadableName");

	Engine_GetHumanReadableName_Parms GetHumanReadableName_Parms;
	ProcessEvent(pFnGetHumanReadableName,NULL,&GetHumanReadableName_Parms,NULL);
	return GetHumanReadableName_Parms.ReturnValue;
}

struct Engine_LostChild_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::LostChild(class AActor* Other)
{
	static UFieldFunc* pFnLostChild = NULL;
	if(!pFnLostChild)
		pFnLostChild = UObject::FindFunction("Function Engine.Actor.LostChild");

	Engine_LostChild_Parms LostChild_Parms;
	LostChild_Parms.Other = Other;
	ProcessEvent(pFnLostChild,NULL,&LostChild_Parms,NULL);
}

struct Engine_RootMotionModeChanged_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x000000 (0x0004)              
};

void AActor::RootMotionModeChanged(class USkeletalMeshComponent* SkelComp)
{
	static UFieldFunc* pFnRootMotionModeChanged = NULL;
	if(!pFnRootMotionModeChanged)
		pFnRootMotionModeChanged = UObject::FindFunction("Function Engine.Actor.RootMotionModeChanged");

	Engine_RootMotionModeChanged_Parms RootMotionModeChanged_Parms;
	RootMotionModeChanged_Parms.SkelComp = SkelComp;
	ProcessEvent(pFnRootMotionModeChanged,NULL,&RootMotionModeChanged_Parms,NULL);
}

struct Engine_ReplicationEnded_Parms
{
};

void AActor::ReplicationEnded()
{
	static UFieldFunc* pFnReplicationEnded = NULL;
	if(!pFnReplicationEnded)
		pFnReplicationEnded = UObject::FindFunction("Function Engine.Actor.ReplicationEnded");

	Engine_ReplicationEnded_Parms ReplicationEnded_Parms;
	ProcessEvent(pFnReplicationEnded,NULL,&ReplicationEnded_Parms,NULL);
}

struct Engine_SetZone_Parms
{
	unsigned long                                      bForceRefresh : 1;                                		// 0x000000 (0x0004) [0x00000001] 
};

void AActor::SetZone(bool bForceRefresh)
{
	static UFieldFunc* pFnSetZone = NULL;
	if(!pFnSetZone)
		pFnSetZone = UObject::FindFunction("Function Engine.Actor.SetZone");

	Engine_SetZone_Parms SetZone_Parms;
	SetZone_Parms.bForceRefresh = bForceRefresh;
	pFnSetZone->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetZone,NULL,&SetZone_Parms,NULL);
	pFnSetZone->FunctionFlags |= 0x400;
}

struct Engine_HealDamage_Parms
{
	int                                                Amount;                                           		// 0x000000 (0x0004)              
	class AController*                                 Healer;                                           		// 0x000004 (0x0004)              
	class UClass*                                      DamageType;                                       		// 0x000008 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::HealDamage(int Amount,class AController* Healer,class UClass* DamageType)
{
	static UFieldFunc* pFnHealDamage = NULL;
	if(!pFnHealDamage)
		pFnHealDamage = UObject::FindFunction("Function Engine.Actor.HealDamage");

	Engine_HealDamage_Parms HealDamage_Parms;
	HealDamage_Parms.Amount = Amount;
	HealDamage_Parms.Healer = Healer;
	HealDamage_Parms.DamageType = DamageType;
	ProcessEvent(pFnHealDamage,NULL,&HealDamage_Parms,NULL);
	return HealDamage_Parms.ReturnValue;
}

struct Engine_SetAnimWeights_Parms
{
	TArray<struct FAnimSlotInfo>                       SlotInfos;                                        		// 0x000000 (0x000C)              
};

void AActor::SetAnimWeights(TArray<struct FAnimSlotInfo> SlotInfos)
{
	static UFieldFunc* pFnSetAnimWeights = NULL;
	if(!pFnSetAnimWeights)
		pFnSetAnimWeights = UObject::FindFunction("Function Engine.Actor.SetAnimWeights");

	Engine_SetAnimWeights_Parms SetAnimWeights_Parms;
	memcpy(&SetAnimWeights_Parms.SlotInfos,&SlotInfos,0xC);
	ProcessEvent(pFnSetAnimWeights,NULL,&SetAnimWeights_Parms,NULL);
}

struct Engine_TornOff_Parms
{
};

void AActor::TornOff()
{
	static UFieldFunc* pFnTornOff = NULL;
	if(!pFnTornOff)
		pFnTornOff = UObject::FindFunction("Function Engine.Actor.TornOff");

	Engine_TornOff_Parms TornOff_Parms;
	ProcessEvent(pFnTornOff,NULL,&TornOff_Parms,NULL);
}

struct Engine_ContainsPoint_Parms
{
	FVector3                                           Spot;                                             		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::ContainsPoint(FVector3 Spot)
{
	static UFieldFunc* pFnContainsPoint = NULL;
	if(!pFnContainsPoint)
		pFnContainsPoint = UObject::FindFunction("Function Engine.Actor.ContainsPoint");

	Engine_ContainsPoint_Parms ContainsPoint_Parms;
	memcpy(&ContainsPoint_Parms.Spot,&Spot,0xC);
	pFnContainsPoint->FunctionFlags |= ~0x400;
	ProcessEvent(pFnContainsPoint,NULL,&ContainsPoint_Parms,NULL);
	pFnContainsPoint->FunctionFlags |= 0x400;
	return ContainsPoint_Parms.ReturnValue;
}

struct Engine_FindBase_Parms
{
};

void AActor::FindBase()
{
	static UFieldFunc* pFnFindBase = NULL;
	if(!pFnFindBase)
		pFnFindBase = UObject::FindFunction("Function Engine.Actor.FindBase");

	Engine_FindBase_Parms FindBase_Parms;
	pFnFindBase->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFindBase,NULL,&FindBase_Parms,NULL);
	pFnFindBase->FunctionFlags |= 0x400;
}

struct Engine_DisplayDebug_Parms
{
	class AHUD*                                        HUD;                                              		// 0x000000 (0x0004)              
	float                                              out_YL;                                           		// 0x000004 (0x0004)              
	float                                              out_YPos;                                         		// 0x000008 (0x0004)              
	//struct FString                                     T;                                                		// 0x00000C (0x000C)              
	//class AActor*                                      A;                                                		// 0x000018 (0x0004)              
	//float                                              MyRadius;                                         		// 0x00001C (0x0004)              
	//float                                              MyHeight;                                         		// 0x000020 (0x0004)              
	//class UCanvas*                                     Canvas;                                           		// 0x000024 (0x0004)              
};

void AActor::DisplayDebug(class AHUD* HUD,float* out_YL,float* out_YPos)
{
	static UFieldFunc* pFnDisplayDebug = NULL;
	if(!pFnDisplayDebug)
		pFnDisplayDebug = UObject::FindFunction("Function Engine.Actor.DisplayDebug");

	Engine_DisplayDebug_Parms DisplayDebug_Parms;
	DisplayDebug_Parms.HUD = HUD;
	ProcessEvent(pFnDisplayDebug,NULL,&DisplayDebug_Parms,NULL);
	if(out_YL)
		*out_YL = DisplayDebug_Parms.out_YL;
	if(out_YPos)
		*out_YPos = DisplayDebug_Parms.out_YPos;
}

struct Engine_NotifyLocalPlayerTeamReceived_Parms
{
};

void AActor::NotifyLocalPlayerTeamReceived()
{
	static UFieldFunc* pFnNotifyLocalPlayerTeamReceived = NULL;
	if(!pFnNotifyLocalPlayerTeamReceived)
		pFnNotifyLocalPlayerTeamReceived = UObject::FindFunction("Function Engine.Actor.NotifyLocalPlayerTeamReceived");

	Engine_NotifyLocalPlayerTeamReceived_Parms NotifyLocalPlayerTeamReceived_Parms;
	ProcessEvent(pFnNotifyLocalPlayerTeamReceived,NULL,&NotifyLocalPlayerTeamReceived_Parms,NULL);
}

struct Engine_SetUseGrid_Parms
{
	unsigned long                                      bNewUseGrid : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

void AActor::SetUseGrid(bool bNewUseGrid)
{
	static UFieldFunc* pFnSetUseGrid = NULL;
	if(!pFnSetUseGrid)
		pFnSetUseGrid = UObject::FindFunction("Function Engine.Actor.SetUseGrid");

	Engine_SetUseGrid_Parms SetUseGrid_Parms;
	SetUseGrid_Parms.bNewUseGrid = bNewUseGrid;
	pFnSetUseGrid->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetUseGrid,NULL,&SetUseGrid_Parms,NULL);
	pFnSetUseGrid->FunctionFlags |= 0x400;
}

struct Engine_PlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x000000 (0x0004)              
	struct FString                                     GroupName;                                        		// 0x000004 (0x000C)              
	struct FString                                     SeqName;                                          		// 0x000010 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
};

bool AActor::PlayActorFaceFXAnim(class UFaceFXAnimSet* AnimSet,struct FString GroupName,struct FString SeqName)
{
	static UFieldFunc* pFnPlayActorFaceFXAnim = NULL;
	if(!pFnPlayActorFaceFXAnim)
		pFnPlayActorFaceFXAnim = UObject::FindFunction("Function Engine.Actor.PlayActorFaceFXAnim");

	Engine_PlayActorFaceFXAnim_Parms PlayActorFaceFXAnim_Parms;
	PlayActorFaceFXAnim_Parms.AnimSet = AnimSet;
	memcpy(&PlayActorFaceFXAnim_Parms.GroupName,&GroupName,0xC);
	memcpy(&PlayActorFaceFXAnim_Parms.SeqName,&SeqName,0xC);
	ProcessEvent(pFnPlayActorFaceFXAnim,NULL,&PlayActorFaceFXAnim_Parms,NULL);
	return PlayActorFaceFXAnim_Parms.ReturnValue;
}

struct Engine_AllOwnedComponents_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class UActorComponent*                             OutComponent;                                     		// 0x000004 (0x0004)              
};

void AActor::AllOwnedComponents(class UClass* BaseClass,class UActorComponent** OutComponent)
{
	static UFieldFunc* pFnAllOwnedComponents = NULL;
	if(!pFnAllOwnedComponents)
		pFnAllOwnedComponents = UObject::FindFunction("Function Engine.Actor.AllOwnedComponents");

	Engine_AllOwnedComponents_Parms AllOwnedComponents_Parms;
	AllOwnedComponents_Parms.BaseClass = BaseClass;
	pFnAllOwnedComponents->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAllOwnedComponents,NULL,&AllOwnedComponents_Parms,NULL);
	pFnAllOwnedComponents->FunctionFlags |= 0x400;
	if(OutComponent)
		*OutComponent = AllOwnedComponents_Parms.OutComponent;
}

struct Engine_SpawnedByKismet_Parms
{
};

void AActor::SpawnedByKismet()
{
	static UFieldFunc* pFnSpawnedByKismet = NULL;
	if(!pFnSpawnedByKismet)
		pFnSpawnedByKismet = UObject::FindFunction("Function Engine.Actor.SpawnedByKismet");

	Engine_SpawnedByKismet_Parms SpawnedByKismet_Parms;
	ProcessEvent(pFnSpawnedByKismet,NULL,&SpawnedByKismet_Parms,NULL);
}

struct Engine_SetMorphWeight_Parms
{
	struct FName                                       MorphNodeName;                                    		// 0x000000 (0x0008)              
	float                                              MorphWeight;                                      		// 0x000008 (0x0004)              
};

void AActor::SetMorphWeight(struct FName MorphNodeName,float MorphWeight)
{
	static UFieldFunc* pFnSetMorphWeight = NULL;
	if(!pFnSetMorphWeight)
		pFnSetMorphWeight = UObject::FindFunction("Function Engine.Actor.SetMorphWeight");

	Engine_SetMorphWeight_Parms SetMorphWeight_Parms;
	memcpy(&SetMorphWeight_Parms.MorphNodeName,&MorphNodeName,0x8);
	SetMorphWeight_Parms.MorphWeight = MorphWeight;
	ProcessEvent(pFnSetMorphWeight,NULL,&SetMorphWeight_Parms,NULL);
}

struct Engine_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function Engine.Actor.OnSequenceAction");

	Engine_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct Engine_NotifySkelControlBeyondLimit_Parms
{
	class USkelControlLookAt*                          LookAt;                                           		// 0x000000 (0x0004)              
};

void AActor::NotifySkelControlBeyondLimit(class USkelControlLookAt* LookAt)
{
	static UFieldFunc* pFnNotifySkelControlBeyondLimit = NULL;
	if(!pFnNotifySkelControlBeyondLimit)
		pFnNotifySkelControlBeyondLimit = UObject::FindFunction("Function Engine.Actor.NotifySkelControlBeyondLimit");

	Engine_NotifySkelControlBeyondLimit_Parms NotifySkelControlBeyondLimit_Parms;
	NotifySkelControlBeyondLimit_Parms.LookAt = LookAt;
	ProcessEvent(pFnNotifySkelControlBeyondLimit,NULL,&NotifySkelControlBeyondLimit_Parms,NULL);
}

struct Engine_OnSetPhysics_Parms
{
	class USeqAct_SetPhysics*                          Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnSetPhysics(class USeqAct_SetPhysics* Action)
{
	static UFieldFunc* pFnOnSetPhysics = NULL;
	if(!pFnOnSetPhysics)
		pFnOnSetPhysics = UObject::FindFunction("Function Engine.Actor.OnSetPhysics");

	Engine_OnSetPhysics_Parms OnSetPhysics_Parms;
	OnSetPhysics_Parms.Action = Action;
	ProcessEvent(pFnOnSetPhysics,NULL,&OnSetPhysics_Parms,NULL);
}

struct Engine_InterpolationFinished_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x000000 (0x0004)              
};

void AActor::InterpolationFinished(class USeqAct_Interp* InterpAction)
{
	static UFieldFunc* pFnInterpolationFinished = NULL;
	if(!pFnInterpolationFinished)
		pFnInterpolationFinished = UObject::FindFunction("Function Engine.Actor.InterpolationFinished");

	Engine_InterpolationFinished_Parms InterpolationFinished_Parms;
	InterpolationFinished_Parms.InterpAction = InterpAction;
	ProcessEvent(pFnInterpolationFinished,NULL,&InterpolationFinished_Parms,NULL);
}

struct Engine_EncroachedBy_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::EncroachedBy(class AActor* Other)
{
	static UFieldFunc* pFnEncroachedBy = NULL;
	if(!pFnEncroachedBy)
		pFnEncroachedBy = UObject::FindFunction("Function Engine.Actor.EncroachedBy");

	Engine_EncroachedBy_Parms EncroachedBy_Parms;
	EncroachedBy_Parms.Other = Other;
	ProcessEvent(pFnEncroachedBy,NULL,&EncroachedBy_Parms,NULL);
}

struct Engine_OnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x000000 (0x0004)              
	float                                              PlayedTime;                                       		// 0x000004 (0x0004)              
	float                                              ExcessTime;                                       		// 0x000008 (0x0004)              
};

void AActor::OnAnimEnd(class UAnimNodeSequence* SeqNode,float PlayedTime,float ExcessTime)
{
	static UFieldFunc* pFnOnAnimEnd = NULL;
	if(!pFnOnAnimEnd)
		pFnOnAnimEnd = UObject::FindFunction("Function Engine.Actor.OnAnimEnd");

	Engine_OnAnimEnd_Parms OnAnimEnd_Parms;
	OnAnimEnd_Parms.SeqNode = SeqNode;
	OnAnimEnd_Parms.PlayedTime = PlayedTime;
	OnAnimEnd_Parms.ExcessTime = ExcessTime;
	ProcessEvent(pFnOnAnimEnd,NULL,&OnAnimEnd_Parms,NULL);
}

struct Engine_CalcCamera_Parms
{
	float                                              fDeltaTime;                                       		// 0x000000 (0x0004)              
	FVector3                                           out_CamLoc;                                       		// 0x000004 (0x000C)              
	FRotator                                           out_CamRot;                                       		// 0x000010 (0x000C)              
	float                                              out_FOV;                                          		// 0x00001C (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
};

bool AActor::CalcCamera(float fDeltaTime,FVector3* out_CamLoc,FRotator* out_CamRot,float* out_FOV)
{
	static UFieldFunc* pFnCalcCamera = NULL;
	if(!pFnCalcCamera)
		pFnCalcCamera = UObject::FindFunction("Function Engine.Actor.CalcCamera");

	Engine_CalcCamera_Parms CalcCamera_Parms;
	CalcCamera_Parms.fDeltaTime = fDeltaTime;
	pFnCalcCamera->FunctionFlags |= ~0x400;
	ProcessEvent(pFnCalcCamera,NULL,&CalcCamera_Parms,NULL);
	pFnCalcCamera->FunctionFlags |= 0x400;
	if(out_CamLoc)
		memcpy(out_CamLoc,&CalcCamera_Parms.out_CamLoc,0xC);
	if(out_CamRot)
		memcpy(out_CamRot,&CalcCamera_Parms.out_CamRot,0xC);
	if(out_FOV)
		*out_FOV = CalcCamera_Parms.out_FOV;
	return CalcCamera_Parms.ReturnValue;
}

struct Engine_FlushPersistentDebugLines_Parms
{
};

void AActor::FlushPersistentDebugLines()
{
	static UFieldFunc* pFnFlushPersistentDebugLines = NULL;
	if(!pFnFlushPersistentDebugLines)
		pFnFlushPersistentDebugLines = UObject::FindFunction("Function Engine.Actor.FlushPersistentDebugLines");

	Engine_FlushPersistentDebugLines_Parms FlushPersistentDebugLines_Parms;
	pFnFlushPersistentDebugLines->FunctionFlags |= ~0x400;
	ProcessEvent(pFnFlushPersistentDebugLines,NULL,&FlushPersistentDebugLines_Parms,NULL);
	pFnFlushPersistentDebugLines->FunctionFlags |= 0x400;
}

struct Engine_SetTimer_Parms
{
	float                                              InRate;                                           		// 0x000000 (0x0004)              
	unsigned long                                      inbLoop : 1;                                      		// 0x000004 (0x0004) [0x00000001] 
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000008 (0x000C)              
};

void AActor::SetTimer(float InRate,bool inbLoop,struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnSetTimer = NULL;
	if(!pFnSetTimer)
		pFnSetTimer = UObject::FindFunction("Function Engine.Actor.SetTimer");

	Engine_SetTimer_Parms SetTimer_Parms;
	SetTimer_Parms.InRate = InRate;
	SetTimer_Parms.inbLoop = inbLoop;
	memcpy(&SetTimer_Parms.InTimerFunc,&InTimerFunc,0xC);

	unsigned short NativeIndex = pFnSetTimer->iNative;
	pFnSetTimer->iNative = 0;
	pFnSetTimer->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTimer,NULL,&SetTimer_Parms,NULL);
	pFnSetTimer->FunctionFlags |= 0x400;
	pFnSetTimer->iNative = NativeIndex;
}

struct Engine_Detach_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AActor::Detach(class AActor* Other)
{
	static UFieldFunc* pFnDetach = NULL;
	if(!pFnDetach)
		pFnDetach = UObject::FindFunction("Function Engine.Actor.Detach");

	Engine_Detach_Parms Detach_Parms;
	Detach_Parms.Other = Other;
	ProcessEvent(pFnDetach,NULL,&Detach_Parms,NULL);
}

struct Engine_DebugFreezeGame_Parms
{
	//class APlayerController*                           PC;                                               		// 0x000000 (0x0004)              
};

void AActor::DebugFreezeGame()
{
	static UFieldFunc* pFnDebugFreezeGame = NULL;
	if(!pFnDebugFreezeGame)
		pFnDebugFreezeGame = UObject::FindFunction("Function Engine.Actor.DebugFreezeGame");

	Engine_DebugFreezeGame_Parms DebugFreezeGame_Parms;
	ProcessEvent(pFnDebugFreezeGame,NULL,&DebugFreezeGame_Parms,NULL);
}

struct Engine_SetCollisionSize_Parms
{
	float                                              NewRadius;                                        		// 0x000000 (0x0004)              
	float                                              NewHeight;                                        		// 0x000004 (0x0004)              
};

void AActor::SetCollisionSize(float NewRadius,float NewHeight)
{
	static UFieldFunc* pFnSetCollisionSize = NULL;
	if(!pFnSetCollisionSize)
		pFnSetCollisionSize = UObject::FindFunction("Function Engine.Actor.SetCollisionSize");

	Engine_SetCollisionSize_Parms SetCollisionSize_Parms;
	SetCollisionSize_Parms.NewRadius = NewRadius;
	SetCollisionSize_Parms.NewHeight = NewHeight;

	unsigned short NativeIndex = pFnSetCollisionSize->iNative;
	pFnSetCollisionSize->iNative = 0;
	pFnSetCollisionSize->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCollisionSize,NULL,&SetCollisionSize_Parms,NULL);
	pFnSetCollisionSize->FunctionFlags |= 0x400;
	pFnSetCollisionSize->iNative = NativeIndex;
}

struct Engine_AutonomousPhysicsPhysNone_Parms
{
	float                                              fDeltaSeconds;                                    		// 0x000000 (0x0004)              
};

void AActor::AutonomousPhysicsPhysNone(float fDeltaSeconds)
{
	static UFieldFunc* pFnAutonomousPhysicsPhysNone = NULL;
	if(!pFnAutonomousPhysicsPhysNone)
		pFnAutonomousPhysicsPhysNone = UObject::FindFunction("Function Engine.Actor.AutonomousPhysicsPhysNone");

	Engine_AutonomousPhysicsPhysNone_Parms AutonomousPhysicsPhysNone_Parms;
	AutonomousPhysicsPhysNone_Parms.fDeltaSeconds = fDeltaSeconds;
	pFnAutonomousPhysicsPhysNone->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAutonomousPhysicsPhysNone,NULL,&AutonomousPhysicsPhysNone_Parms,NULL);
	pFnAutonomousPhysicsPhysNone->FunctionFlags |= 0x400;
}

struct Engine_ChartData_Parms
{
	struct FString                                     DataName;                                         		// 0x000000 (0x000C)              
	float                                              DataValue;                                        		// 0x00000C (0x0004)              
};

void AActor::ChartData(struct FString DataName,float DataValue)
{
	static UFieldFunc* pFnChartData = NULL;
	if(!pFnChartData)
		pFnChartData = UObject::FindFunction("Function Engine.Actor.ChartData");

	Engine_ChartData_Parms ChartData_Parms;
	memcpy(&ChartData_Parms.DataName,&DataName,0xC);
	ChartData_Parms.DataValue = DataValue;
	pFnChartData->FunctionFlags |= ~0x400;
	ProcessEvent(pFnChartData,NULL,&ChartData_Parms,NULL);
	pFnChartData->FunctionFlags |= 0x400;
}

struct Engine_IsStationary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::IsStationary()
{
	static UFieldFunc* pFnIsStationary = NULL;
	if(!pFnIsStationary)
		pFnIsStationary = UObject::FindFunction("Function Engine.Actor.IsStationary");

	Engine_IsStationary_Parms IsStationary_Parms;
	ProcessEvent(pFnIsStationary,NULL,&IsStationary_Parms,NULL);
	return IsStationary_Parms.ReturnValue;
}

struct Engine_OnTeleport_Parms
{
	class USeqAct_Teleport*                            Action;                                           		// 0x000000 (0x0004)              
	//TArray<class UObject*>                             objVars;                                          		// 0x000004 (0x000C)              
	//int                                                Idx;                                              		// 0x000010 (0x0004)              
	//class AActor*                                      destActor;                                        		// 0x000014 (0x0004)              
	//class AController*                                 C;                                                		// 0x000018 (0x0004)              
};

void AActor::OnTeleport(class USeqAct_Teleport* Action)
{
	static UFieldFunc* pFnOnTeleport = NULL;
	if(!pFnOnTeleport)
		pFnOnTeleport = UObject::FindFunction("Function Engine.Actor.OnTeleport");

	Engine_OnTeleport_Parms OnTeleport_Parms;
	OnTeleport_Parms.Action = Action;
	ProcessEvent(pFnOnTeleport,NULL,&OnTeleport_Parms,NULL);
}

struct Engine_TriggerEventClass_Parms
{
	class UClass*                                      InEventClass;                                     		// 0x000000 (0x0004)              
	class AActor*                                      InInstigator;                                     		// 0x000004 (0x0004)              
	int                                                ActivateIndex;                                    		// 0x000008 (0x0004)              
	unsigned long                                      bTest : 1;                                        		// 0x00000C (0x0004) [0x00000001] 
	TArray<class USequenceEvent*>                      ActivatedEvents;                                  		// 0x000010 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	//TArray<int>                                        ActivateIndices;                                  		// 0x000020 (0x000C)              
};

bool AActor::TriggerEventClass(class UClass* InEventClass,class AActor* InInstigator,int ActivateIndex,bool bTest,TArray<class USequenceEvent*>* ActivatedEvents)
{
	static UFieldFunc* pFnTriggerEventClass = NULL;
	if(!pFnTriggerEventClass)
		pFnTriggerEventClass = UObject::FindFunction("Function Engine.Actor.TriggerEventClass");

	Engine_TriggerEventClass_Parms TriggerEventClass_Parms;
	TriggerEventClass_Parms.InEventClass = InEventClass;
	TriggerEventClass_Parms.InInstigator = InInstigator;
	TriggerEventClass_Parms.ActivateIndex = ActivateIndex;
	TriggerEventClass_Parms.bTest = bTest;
	ProcessEvent(pFnTriggerEventClass,NULL,&TriggerEventClass_Parms,NULL);
	if(ActivatedEvents)
		memcpy(ActivatedEvents,&TriggerEventClass_Parms.ActivatedEvents,0xC);
	return TriggerEventClass_Parms.ReturnValue;
}

struct Engine_Timer_Parms
{
};

void AActor::Timer()
{
	static UFieldFunc* pFnTimer = NULL;
	if(!pFnTimer)
		pFnTimer = UObject::FindFunction("Function Engine.Actor.Timer");

	Engine_Timer_Parms Timer_Parms;
	ProcessEvent(pFnTimer,NULL,&Timer_Parms,NULL);
}

struct Engine_IsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::IsActorPlayingFaceFXAnim()
{
	static UFieldFunc* pFnIsActorPlayingFaceFXAnim = NULL;
	if(!pFnIsActorPlayingFaceFXAnim)
		pFnIsActorPlayingFaceFXAnim = UObject::FindFunction("Function Engine.Actor.IsActorPlayingFaceFXAnim");

	Engine_IsActorPlayingFaceFXAnim_Parms IsActorPlayingFaceFXAnim_Parms;
	ProcessEvent(pFnIsActorPlayingFaceFXAnim,NULL,&IsActorPlayingFaceFXAnim_Parms,NULL);
	return IsActorPlayingFaceFXAnim_Parms.ReturnValue;
}

struct Engine_SetCollision_Parms
{
	unsigned long                                      bNewColActors : 1;                                		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bNewBlockActors : 1;                              		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bNewIgnoreEncroachers : 1;                        		// 0x000008 (0x0004) [0x00000001] 
};

void AActor::SetCollision(bool bNewColActors,bool bNewBlockActors,bool bNewIgnoreEncroachers)
{
	static UFieldFunc* pFnSetCollision = NULL;
	if(!pFnSetCollision)
		pFnSetCollision = UObject::FindFunction("Function Engine.Actor.SetCollision");

	Engine_SetCollision_Parms SetCollision_Parms;
	SetCollision_Parms.bNewColActors = bNewColActors;
	SetCollision_Parms.bNewBlockActors = bNewBlockActors;
	SetCollision_Parms.bNewIgnoreEncroachers = bNewIgnoreEncroachers;

	unsigned short NativeIndex = pFnSetCollision->iNative;
	pFnSetCollision->iNative = 0;
	pFnSetCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCollision,NULL,&SetCollision_Parms,NULL);
	pFnSetCollision->FunctionFlags |= 0x400;
	pFnSetCollision->iNative = NativeIndex;
}

struct Engine_PostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x000000 (0x0004)              
};

void AActor::PostInitAnimTree(class USkeletalMeshComponent* SkelComp)
{
	static UFieldFunc* pFnPostInitAnimTree = NULL;
	if(!pFnPostInitAnimTree)
		pFnPostInitAnimTree = UObject::FindFunction("Function Engine.Actor.PostInitAnimTree");

	Engine_PostInitAnimTree_Parms PostInitAnimTree_Parms;
	PostInitAnimTree_Parms.SkelComp = SkelComp;
	ProcessEvent(pFnPostInitAnimTree,NULL,&PostInitAnimTree_Parms,NULL);
}

struct Engine_OnMakeNoise_Parms
{
	class USeqAct_MakeNoise*                           Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnMakeNoise(class USeqAct_MakeNoise* Action)
{
	static UFieldFunc* pFnOnMakeNoise = NULL;
	if(!pFnOnMakeNoise)
		pFnOnMakeNoise = UObject::FindFunction("Function Engine.Actor.OnMakeNoise");

	Engine_OnMakeNoise_Parms OnMakeNoise_Parms;
	OnMakeNoise_Parms.Action = Action;
	ProcessEvent(pFnOnMakeNoise,NULL,&OnMakeNoise_Parms,NULL);
}

struct Engine_SetLocation_Parms
{
	FVector3                                           NewLocation;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::SetLocation(FVector3 NewLocation)
{
	static UFieldFunc* pFnSetLocation = NULL;
	if(!pFnSetLocation)
		pFnSetLocation = UObject::FindFunction("Function Engine.Actor.SetLocation");

	Engine_SetLocation_Parms SetLocation_Parms;
	memcpy(&SetLocation_Parms.NewLocation,&NewLocation,0xC);

	unsigned short NativeIndex = pFnSetLocation->iNative;
	pFnSetLocation->iNative = 0;
	pFnSetLocation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetLocation,NULL,&SetLocation_Parms,NULL);
	pFnSetLocation->FunctionFlags |= 0x400;
	pFnSetLocation->iNative = NativeIndex;
	return SetLocation_Parms.ReturnValue;
}

struct Engine_FindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x000000 (0x0004)              
	FRotator                                           GoodRotation;                                     		// 0x000004 (0x000C)              
};

void AActor::FindGoodEndView(class APlayerController* PC,FRotator* GoodRotation)
{
	static UFieldFunc* pFnFindGoodEndView = NULL;
	if(!pFnFindGoodEndView)
		pFnFindGoodEndView = UObject::FindFunction("Function Engine.Actor.FindGoodEndView");

	Engine_FindGoodEndView_Parms FindGoodEndView_Parms;
	FindGoodEndView_Parms.PC = PC;
	ProcessEvent(pFnFindGoodEndView,NULL,&FindGoodEndView_Parms,NULL);
	if(GoodRotation)
		memcpy(GoodRotation,&FindGoodEndView_Parms.GoodRotation,0xC);
}

struct Engine_PlayerCanSeeMe_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
};

bool AActor::PlayerCanSeeMe()
{
	static UFieldFunc* pFnPlayerCanSeeMe = NULL;
	if(!pFnPlayerCanSeeMe)
		pFnPlayerCanSeeMe = UObject::FindFunction("Function Engine.Actor.PlayerCanSeeMe");

	Engine_PlayerCanSeeMe_Parms PlayerCanSeeMe_Parms;

	unsigned short NativeIndex = pFnPlayerCanSeeMe->iNative;
	pFnPlayerCanSeeMe->iNative = 0;
	pFnPlayerCanSeeMe->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPlayerCanSeeMe,NULL,&PlayerCanSeeMe_Parms,NULL);
	pFnPlayerCanSeeMe->FunctionFlags |= 0x400;
	pFnPlayerCanSeeMe->iNative = NativeIndex;
	return PlayerCanSeeMe_Parms.ReturnValue;
}

struct Engine_ClearTimer_Parms
{
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000000 (0x000C)              
};

void AActor::ClearTimer(struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnClearTimer = NULL;
	if(!pFnClearTimer)
		pFnClearTimer = UObject::FindFunction("Function Engine.Actor.ClearTimer");

	Engine_ClearTimer_Parms ClearTimer_Parms;
	memcpy(&ClearTimer_Parms.InTimerFunc,&InTimerFunc,0xC);
	pFnClearTimer->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClearTimer,NULL,&ClearTimer_Parms,NULL);
	pFnClearTimer->FunctionFlags |= 0x400;
}

struct Engine_ChildActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
};

void AActor::ChildActors(class UClass* BaseClass,class AActor** Actor)
{
	static UFieldFunc* pFnChildActors = NULL;
	if(!pFnChildActors)
		pFnChildActors = UObject::FindFunction("Function Engine.Actor.ChildActors");

	Engine_ChildActors_Parms ChildActors_Parms;
	ChildActors_Parms.BaseClass = BaseClass;

	unsigned short NativeIndex = pFnChildActors->iNative;
	pFnChildActors->iNative = 0;
	pFnChildActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnChildActors,NULL,&ChildActors_Parms,NULL);
	pFnChildActors->FunctionFlags |= 0x400;
	pFnChildActors->iNative = NativeIndex;
	if(Actor)
		*Actor = ChildActors_Parms.Actor;
}

struct Engine_IsTimerActive_Parms
{
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::IsTimerActive(struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnIsTimerActive = NULL;
	if(!pFnIsTimerActive)
		pFnIsTimerActive = UObject::FindFunction("Function Engine.Actor.IsTimerActive");

	Engine_IsTimerActive_Parms IsTimerActive_Parms;
	memcpy(&IsTimerActive_Parms.InTimerFunc,&InTimerFunc,0xC);
	pFnIsTimerActive->FunctionFlags |= ~0x400;
	ProcessEvent(pFnIsTimerActive,NULL,&IsTimerActive_Parms,NULL);
	pFnIsTimerActive->FunctionFlags |= 0x400;
	return IsTimerActive_Parms.ReturnValue;
}

struct Engine_PostDemoRewind_Parms
{
};

void AActor::PostDemoRewind()
{
	static UFieldFunc* pFnPostDemoRewind = NULL;
	if(!pFnPostDemoRewind)
		pFnPostDemoRewind = UObject::FindFunction("Function Engine.Actor.PostDemoRewind");

	Engine_PostDemoRewind_Parms PostDemoRewind_Parms;
	ProcessEvent(pFnPostDemoRewind,NULL,&PostDemoRewind_Parms,NULL);
}

struct Engine_ReplicatedArrayEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x000000 (0x0008)              
	int                                                nElement;                                         		// 0x000008 (0x0004)              
};

void AActor::ReplicatedArrayEvent(struct FName VarName,int nElement)
{
	static UFieldFunc* pFnReplicatedArrayEvent = NULL;
	if(!pFnReplicatedArrayEvent)
		pFnReplicatedArrayEvent = UObject::FindFunction("Function Engine.Actor.ReplicatedArrayEvent");

	Engine_ReplicatedArrayEvent_Parms ReplicatedArrayEvent_Parms;
	memcpy(&ReplicatedArrayEvent_Parms.VarName,&VarName,0x8);
	ReplicatedArrayEvent_Parms.nElement = nElement;
	ProcessEvent(pFnReplicatedArrayEvent,NULL,&ReplicatedArrayEvent_Parms,NULL);
}

struct Engine_Reset_Parms
{
};

void AActor::Reset()
{
	static UFieldFunc* pFnReset = NULL;
	if(!pFnReset)
		pFnReset = UObject::FindFunction("Function Engine.Actor.Reset");

	Engine_Reset_Parms Reset_Parms;
	ProcessEvent(pFnReset,NULL,&Reset_Parms,NULL);
}

struct Engine_MatchStarting_Parms
{
};

void AActor::MatchStarting()
{
	static UFieldFunc* pFnMatchStarting = NULL;
	if(!pFnMatchStarting)
		pFnMatchStarting = UObject::FindFunction("Function Engine.Actor.MatchStarting");

	Engine_MatchStarting_Parms MatchStarting_Parms;
	ProcessEvent(pFnMatchStarting,NULL,&MatchStarting_Parms,NULL);
}

struct Engine_SetInitialState_Parms
{
};

void AActor::SetInitialState()
{
	static UFieldFunc* pFnSetInitialState = NULL;
	if(!pFnSetInitialState)
		pFnSetInitialState = UObject::FindFunction("Function Engine.Actor.SetInitialState");

	Engine_SetInitialState_Parms SetInitialState_Parms;
	ProcessEvent(pFnSetInitialState,NULL,&SetInitialState_Parms,NULL);
}

struct Engine_StopsProjectile_Parms
{
	class AProjectile*                                 P;                                                		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::StopsProjectile(class AProjectile* P)
{
	static UFieldFunc* pFnStopsProjectile = NULL;
	if(!pFnStopsProjectile)
		pFnStopsProjectile = UObject::FindFunction("Function Engine.Actor.StopsProjectile");

	Engine_StopsProjectile_Parms StopsProjectile_Parms;
	StopsProjectile_Parms.P = P;
	ProcessEvent(pFnStopsProjectile,NULL,&StopsProjectile_Parms,NULL);
	return StopsProjectile_Parms.ReturnValue;
}

struct Engine_SetNetUpdateTime_Parms
{
	double                                             NewUpdateTime;                                    		// 0x000000 (0x0008)              
};

void AActor::SetNetUpdateTime(double NewUpdateTime)
{
	static UFieldFunc* pFnSetNetUpdateTime = NULL;
	if(!pFnSetNetUpdateTime)
		pFnSetNetUpdateTime = UObject::FindFunction("Function Engine.Actor.SetNetUpdateTime");

	Engine_SetNetUpdateTime_Parms SetNetUpdateTime_Parms;
	SetNetUpdateTime_Parms.NewUpdateTime = NewUpdateTime;
	pFnSetNetUpdateTime->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetNetUpdateTime,NULL,&SetNetUpdateTime_Parms,NULL);
	pFnSetNetUpdateTime->FunctionFlags |= 0x400;
}

struct Engine_TraceActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
	FVector3                                           HitLoc;                                           		// 0x000008 (0x000C)              
	FVector3                                           HitNorm;                                          		// 0x000014 (0x000C)              
	FVector3                                           End;                                              		// 0x000020 (0x000C)              
	FVector3                                           Start;                                            		// 0x00002C (0x000C)              
	FVector3                                           Extent;                                           		// 0x000038 (0x000C)              
	struct FTraceHitInfo                               HitInfo;                                          		// 0x000044 (0x001C)              
	int                                                ExtraTraceFlags;                                  		// 0x000060 (0x0004)              
};

void AActor::TraceActors(class UClass* BaseClass,class AActor** Actor,FVector3* HitLoc,FVector3* HitNorm,FVector3 End,FVector3 Start,FVector3 Extent,struct FTraceHitInfo* HitInfo,int ExtraTraceFlags)
{
	static UFieldFunc* pFnTraceActors = NULL;
	if(!pFnTraceActors)
		pFnTraceActors = UObject::FindFunction("Function Engine.Actor.TraceActors");

	Engine_TraceActors_Parms TraceActors_Parms;
	TraceActors_Parms.BaseClass = BaseClass;
	memcpy(&TraceActors_Parms.End,&End,0xC);
	memcpy(&TraceActors_Parms.Start,&Start,0xC);
	memcpy(&TraceActors_Parms.Extent,&Extent,0xC);
	TraceActors_Parms.ExtraTraceFlags = ExtraTraceFlags;

	unsigned short NativeIndex = pFnTraceActors->iNative;
	pFnTraceActors->iNative = 0;
	pFnTraceActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnTraceActors,NULL,&TraceActors_Parms,NULL);
	pFnTraceActors->FunctionFlags |= 0x400;
	pFnTraceActors->iNative = NativeIndex;
	if(Actor)
		*Actor = TraceActors_Parms.Actor;
	if(HitLoc)
		memcpy(HitLoc,&TraceActors_Parms.HitLoc,0xC);
	if(HitNorm)
		memcpy(HitNorm,&TraceActors_Parms.HitNorm,0xC);
	if(HitInfo)
		memcpy(HitInfo,&TraceActors_Parms.HitInfo,0x1C);
}

struct Engine_SetTickGroup_Parms
{
	unsigned char                                      NewTickGroup;                                     		// 0x000000 (0x0001)              
};

void AActor::SetTickGroup(unsigned char NewTickGroup)
{
	static UFieldFunc* pFnSetTickGroup = NULL;
	if(!pFnSetTickGroup)
		pFnSetTickGroup = UObject::FindFunction("Function Engine.Actor.SetTickGroup");

	Engine_SetTickGroup_Parms SetTickGroup_Parms;
	SetTickGroup_Parms.NewTickGroup = NewTickGroup;
	pFnSetTickGroup->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetTickGroup,NULL,&SetTickGroup_Parms,NULL);
	pFnSetTickGroup->FunctionFlags |= 0x400;
}

struct Engine_DrawDebugCone_Parms
{
	FVector3                                           Origin;                                           		// 0x000000 (0x000C)              
	FVector3                                           Direction;                                        		// 0x00000C (0x000C)              
	float                                              Length;                                           		// 0x000018 (0x0004)              
	float                                              AngleWidth;                                       		// 0x00001C (0x0004)              
	float                                              AngleHeight;                                      		// 0x000020 (0x0004)              
	int                                                NumSides;                                         		// 0x000024 (0x0004)              
	DWORD                                              DrawColor;                                        		// 0x000028 (0x0004)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x00002C (0x0004) [0x00000001] 
};

void AActor::DrawDebugCone(FVector3 Origin,FVector3 Direction,float Length,float AngleWidth,float AngleHeight,int NumSides,DWORD DrawColor,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugCone = NULL;
	if(!pFnDrawDebugCone)
		pFnDrawDebugCone = UObject::FindFunction("Function Engine.Actor.DrawDebugCone");

	Engine_DrawDebugCone_Parms DrawDebugCone_Parms;
	memcpy(&DrawDebugCone_Parms.Origin,&Origin,0xC);
	memcpy(&DrawDebugCone_Parms.Direction,&Direction,0xC);
	DrawDebugCone_Parms.Length = Length;
	DrawDebugCone_Parms.AngleWidth = AngleWidth;
	DrawDebugCone_Parms.AngleHeight = AngleHeight;
	DrawDebugCone_Parms.NumSides = NumSides;
	memcpy(&DrawDebugCone_Parms.DrawColor,&DrawColor,0x4);
	DrawDebugCone_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugCone->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugCone,NULL,&DrawDebugCone_Parms,NULL);
	pFnDrawDebugCone->FunctionFlags |= 0x400;
}

struct Engine_ServerIllegalLocation_APB_Parms
{
	struct FString                                     sErrorMessage;                                    		// 0x000000 (0x000C)              
};

void AActor::ServerIllegalLocation_APB(struct FString sErrorMessage)
{
	static UFieldFunc* pFnServerIllegalLocation_APB = NULL;
	if(!pFnServerIllegalLocation_APB)
		pFnServerIllegalLocation_APB = UObject::FindFunction("Function Engine.Actor.ServerIllegalLocation_APB");

	Engine_ServerIllegalLocation_APB_Parms ServerIllegalLocation_APB_Parms;
	memcpy(&ServerIllegalLocation_APB_Parms.sErrorMessage,&sErrorMessage,0xC);
	pFnServerIllegalLocation_APB->FunctionFlags |= ~0x400;
	ProcessEvent(pFnServerIllegalLocation_APB,NULL,&ServerIllegalLocation_APB_Parms,NULL);
	pFnServerIllegalLocation_APB->FunctionFlags |= 0x400;
}

struct Engine_UsedBy_Parms
{
	class APawn*                                       User;                                             		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AActor::UsedBy(class APawn* User)
{
	static UFieldFunc* pFnUsedBy = NULL;
	if(!pFnUsedBy)
		pFnUsedBy = UObject::FindFunction("Function Engine.Actor.UsedBy");

	Engine_UsedBy_Parms UsedBy_Parms;
	UsedBy_Parms.User = User;
	ProcessEvent(pFnUsedBy,NULL,&UsedBy_Parms,NULL);
	return UsedBy_Parms.ReturnValue;
}

struct Engine_GetTimerRate_Parms
{
	struct FScriptDelegate                             InTimerFunc;                                      		// 0x000000 (0x000C)              
	float                                              ReturnValue;                                      		// 0x00000C (0x0004)              
};

float AActor::GetTimerRate(struct FScriptDelegate InTimerFunc)
{
	static UFieldFunc* pFnGetTimerRate = NULL;
	if(!pFnGetTimerRate)
		pFnGetTimerRate = UObject::FindFunction("Function Engine.Actor.GetTimerRate");

	Engine_GetTimerRate_Parms GetTimerRate_Parms;
	memcpy(&GetTimerRate_Parms.InTimerFunc,&InTimerFunc,0xC);
	pFnGetTimerRate->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetTimerRate,NULL,&GetTimerRate_Parms,NULL);
	pFnGetTimerRate->FunctionFlags |= 0x400;
	return GetTimerRate_Parms.ReturnValue;
}

struct Engine_GetItemName_Parms
{
	struct FString                                     FullName;                                         		// 0x000000 (0x000C)              
	struct FString                                     ReturnValue;                                      		// 0x00000C (0x000C)              
	//int                                                pos;                                              		// 0x000018 (0x0004)              
};

struct FString AActor::GetItemName(struct FString FullName)
{
	static UFieldFunc* pFnGetItemName = NULL;
	if(!pFnGetItemName)
		pFnGetItemName = UObject::FindFunction("Function Engine.Actor.GetItemName");

	Engine_GetItemName_Parms GetItemName_Parms;
	memcpy(&GetItemName_Parms.FullName,&FullName,0xC);
	ProcessEvent(pFnGetItemName,NULL,&GetItemName_Parms,NULL);
	return GetItemName_Parms.ReturnValue;
}

struct Engine_ScriptGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x000000 (0x0001)              
};

unsigned char AActor::ScriptGetTeamNum()
{
	static UFieldFunc* pFnScriptGetTeamNum = NULL;
	if(!pFnScriptGetTeamNum)
		pFnScriptGetTeamNum = UObject::FindFunction("Function Engine.Actor.ScriptGetTeamNum");

	Engine_ScriptGetTeamNum_Parms ScriptGetTeamNum_Parms;
	ProcessEvent(pFnScriptGetTeamNum,NULL,&ScriptGetTeamNum_Parms,NULL);
	return ScriptGetTeamNum_Parms.ReturnValue;
}

struct Engine_OnChangeCollision_Parms
{
	class USeqAct_ChangeCollision*                     Action;                                           		// 0x000000 (0x0004)              
};

void AActor::OnChangeCollision(class USeqAct_ChangeCollision* Action)
{
	static UFieldFunc* pFnOnChangeCollision = NULL;
	if(!pFnOnChangeCollision)
		pFnOnChangeCollision = UObject::FindFunction("Function Engine.Actor.OnChangeCollision");

	Engine_OnChangeCollision_Parms OnChangeCollision_Parms;
	OnChangeCollision_Parms.Action = Action;
	ProcessEvent(pFnOnChangeCollision,NULL,&OnChangeCollision_Parms,NULL);
}

struct Engine_GetPackageGuid_Parms
{
	struct FName                                       PackageName;                                      		// 0x000000 (0x0008)              
	struct FGuid                                       ReturnValue;                                      		// 0x000008 (0x0010)              
};

struct FGuid AActor::GetPackageGuid(struct FName PackageName)
{
	static UFieldFunc* pFnGetPackageGuid = NULL;
	if(!pFnGetPackageGuid)
		pFnGetPackageGuid = UObject::FindFunction("Function Engine.Actor.GetPackageGuid");

	Engine_GetPackageGuid_Parms GetPackageGuid_Parms;
	memcpy(&GetPackageGuid_Parms.PackageName,&PackageName,0x8);
	pFnGetPackageGuid->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetPackageGuid,NULL,&GetPackageGuid_Parms,NULL);
	pFnGetPackageGuid->FunctionFlags |= 0x400;
	return GetPackageGuid_Parms.ReturnValue;
}

struct Engine_TakeRadiusDamage_Parms
{
	class AController*                                 InstigatedBy;                                     		// 0x000000 (0x0004)              
	float                                              BaseDamage;                                       		// 0x000004 (0x0004)              
	float                                              DamageRadius;                                     		// 0x000008 (0x0004)              
	class UClass*                                      DamageType;                                       		// 0x00000C (0x0004)              
	float                                              Momentum;                                         		// 0x000010 (0x0004)              
	FVector3                                           HurtOrigin;                                       		// 0x000014 (0x000C)              
	unsigned long                                      bFullDamage : 1;                                  		// 0x000020 (0x0004) [0x00000001] 
	class AActor*                                      DamageCauser;                                     		// 0x000024 (0x0004)              
	//float                                              ColRadius;                                        		// 0x000028 (0x0004)              
	//float                                              ColHeight;                                        		// 0x00002C (0x0004)              
	//float                                              DamageScale;                                      		// 0x000030 (0x0004)              
	//float                                              Dist;                                             		// 0x000034 (0x0004)              
	//FVector3                                           Dir;                                              		// 0x000038 (0x000C)              
};

void AActor::TakeRadiusDamage(class AController* InstigatedBy,float BaseDamage,float DamageRadius,class UClass* DamageType,float Momentum,FVector3 HurtOrigin,bool bFullDamage,class AActor* DamageCauser)
{
	static UFieldFunc* pFnTakeRadiusDamage = NULL;
	if(!pFnTakeRadiusDamage)
		pFnTakeRadiusDamage = UObject::FindFunction("Function Engine.Actor.TakeRadiusDamage");

	Engine_TakeRadiusDamage_Parms TakeRadiusDamage_Parms;
	TakeRadiusDamage_Parms.InstigatedBy = InstigatedBy;
	TakeRadiusDamage_Parms.BaseDamage = BaseDamage;
	TakeRadiusDamage_Parms.DamageRadius = DamageRadius;
	TakeRadiusDamage_Parms.DamageType = DamageType;
	TakeRadiusDamage_Parms.Momentum = Momentum;
	memcpy(&TakeRadiusDamage_Parms.HurtOrigin,&HurtOrigin,0xC);
	TakeRadiusDamage_Parms.bFullDamage = bFullDamage;
	TakeRadiusDamage_Parms.DamageCauser = DamageCauser;
	ProcessEvent(pFnTakeRadiusDamage,NULL,&TakeRadiusDamage_Parms,NULL);
}

struct Engine_ClampRotation_Parms
{
	FRotator                                           out_Rot;                                          		// 0x000000 (0x000C)              
	FRotator                                           rBase;                                            		// 0x00000C (0x000C)              
	FRotator                                           rUpperLimits;                                     		// 0x000018 (0x000C)              
	FRotator                                           rLowerLimits;                                     		// 0x000024 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000030 (0x0004) [0x00000001] 
};

bool AActor::ClampRotation(FRotator* out_Rot,FRotator rBase,FRotator rUpperLimits,FRotator rLowerLimits)
{
	static UFieldFunc* pFnClampRotation = NULL;
	if(!pFnClampRotation)
		pFnClampRotation = UObject::FindFunction("Function Engine.Actor.ClampRotation");

	Engine_ClampRotation_Parms ClampRotation_Parms;
	memcpy(&ClampRotation_Parms.rBase,&rBase,0xC);
	memcpy(&ClampRotation_Parms.rUpperLimits,&rUpperLimits,0xC);
	memcpy(&ClampRotation_Parms.rLowerLimits,&rLowerLimits,0xC);
	pFnClampRotation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClampRotation,NULL,&ClampRotation_Parms,NULL);
	pFnClampRotation->FunctionFlags |= 0x400;
	if(out_Rot)
		memcpy(out_Rot,&ClampRotation_Parms.out_Rot,0xC);
	return ClampRotation_Parms.ReturnValue;
}

struct Engine_FindEventsOfClass_Parms
{
	class UClass*                                      EventClass;                                       		// 0x000000 (0x0004)              
	TArray<class USequenceEvent*>                      out_EventList;                                    		// 0x000004 (0x000C)              
	unsigned long                                      bIncludeDisabled : 1;                             		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      ReturnValue : 1;                                  		// 0x000014 (0x0004) [0x00000001] 
	//class USequenceEvent*                              Evt;                                              		// 0x000018 (0x0004)              
	//unsigned long                                      bFoundEvent : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
};

bool AActor::FindEventsOfClass(class UClass* EventClass,TArray<class USequenceEvent*>* out_EventList,bool bIncludeDisabled)
{
	static UFieldFunc* pFnFindEventsOfClass = NULL;
	if(!pFnFindEventsOfClass)
		pFnFindEventsOfClass = UObject::FindFunction("Function Engine.Actor.FindEventsOfClass");

	Engine_FindEventsOfClass_Parms FindEventsOfClass_Parms;
	FindEventsOfClass_Parms.EventClass = EventClass;
	FindEventsOfClass_Parms.bIncludeDisabled = bIncludeDisabled;
	ProcessEvent(pFnFindEventsOfClass,NULL,&FindEventsOfClass_Parms,NULL);
	if(out_EventList)
		memcpy(out_EventList,&FindEventsOfClass_Parms.out_EventList,0xC);
	return FindEventsOfClass_Parms.ReturnValue;
}

struct Engine_MoveSmooth_Parms
{
	FVector3                                           Delta;                                            		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::MoveSmooth(FVector3 Delta)
{
	static UFieldFunc* pFnMoveSmooth = NULL;
	if(!pFnMoveSmooth)
		pFnMoveSmooth = UObject::FindFunction("Function Engine.Actor.MoveSmooth");

	Engine_MoveSmooth_Parms MoveSmooth_Parms;
	memcpy(&MoveSmooth_Parms.Delta,&Delta,0xC);

	unsigned short NativeIndex = pFnMoveSmooth->iNative;
	pFnMoveSmooth->iNative = 0;
	pFnMoveSmooth->FunctionFlags |= ~0x400;
	ProcessEvent(pFnMoveSmooth,NULL,&MoveSmooth_Parms,NULL);
	pFnMoveSmooth->FunctionFlags |= 0x400;
	pFnMoveSmooth->iNative = NativeIndex;
	return MoveSmooth_Parms.ReturnValue;
}

struct Engine_DEBUGBREAKPOINT2_Parms
{
};

void AActor::DEBUGBREAKPOINT2()
{
	static UFieldFunc* pFnDEBUGBREAKPOINT2 = NULL;
	if(!pFnDEBUGBREAKPOINT2)
		pFnDEBUGBREAKPOINT2 = UObject::FindFunction("Function Engine.Actor.DEBUGBREAKPOINT2");

	Engine_DEBUGBREAKPOINT2_Parms DEBUGBREAKPOINT2_Parms;
	pFnDEBUGBREAKPOINT2->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDEBUGBREAKPOINT2,NULL,&DEBUGBREAKPOINT2_Parms,NULL);
	pFnDEBUGBREAKPOINT2->FunctionFlags |= 0x400;
}

struct Engine_AutonomousPhysics_Parms
{
	float                                              DeltaSeconds;                                     		// 0x000000 (0x0004)              
};

void AActor::AutonomousPhysics(float DeltaSeconds)
{
	static UFieldFunc* pFnAutonomousPhysics = NULL;
	if(!pFnAutonomousPhysics)
		pFnAutonomousPhysics = UObject::FindFunction("Function Engine.Actor.AutonomousPhysics");

	Engine_AutonomousPhysics_Parms AutonomousPhysics_Parms;
	AutonomousPhysics_Parms.DeltaSeconds = DeltaSeconds;

	unsigned short NativeIndex = pFnAutonomousPhysics->iNative;
	pFnAutonomousPhysics->iNative = 0;
	pFnAutonomousPhysics->FunctionFlags |= ~0x400;
	ProcessEvent(pFnAutonomousPhysics,NULL,&AutonomousPhysics_Parms,NULL);
	pFnAutonomousPhysics->FunctionFlags |= 0x400;
	pFnAutonomousPhysics->iNative = NativeIndex;
}

struct Engine_SetRelativeLocation_Parms
{
	FVector3                                           NewLocation;                                      		// 0x000000 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};

bool AActor::SetRelativeLocation(FVector3 NewLocation)
{
	static UFieldFunc* pFnSetRelativeLocation = NULL;
	if(!pFnSetRelativeLocation)
		pFnSetRelativeLocation = UObject::FindFunction("Function Engine.Actor.SetRelativeLocation");

	Engine_SetRelativeLocation_Parms SetRelativeLocation_Parms;
	memcpy(&SetRelativeLocation_Parms.NewLocation,&NewLocation,0xC);
	pFnSetRelativeLocation->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetRelativeLocation,NULL,&SetRelativeLocation_Parms,NULL);
	pFnSetRelativeLocation->FunctionFlags |= 0x400;
	return SetRelativeLocation_Parms.ReturnValue;
}

struct Engine_IsInPain_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
	//class APhysicsVolume*                              V;                                                		// 0x000004 (0x0004)              
};

bool AActor::IsInPain()
{
	static UFieldFunc* pFnIsInPain = NULL;
	if(!pFnIsInPain)
		pFnIsInPain = UObject::FindFunction("Function Engine.Actor.IsInPain");

	Engine_IsInPain_Parms IsInPain_Parms;
	ProcessEvent(pFnIsInPain,NULL,&IsInPain_Parms,NULL);
	return IsInPain_Parms.ReturnValue;
}

struct Engine_DrawDebugCylinder_Parms
{
	FVector3                                           Start;                                            		// 0x000000 (0x000C)              
	FVector3                                           End;                                              		// 0x00000C (0x000C)              
	float                                              Radius;                                           		// 0x000018 (0x0004)              
	int                                                Segments;                                         		// 0x00001C (0x0004)              
	unsigned char                                      R;                                                		// 0x000020 (0x0001)              
	unsigned char                                      G;                                                		// 0x000021 (0x0001)              
	unsigned char                                      B;                                                		// 0x000022 (0x0001)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x000024 (0x0004) [0x00000001] 
};

void AActor::DrawDebugCylinder(FVector3 Start,FVector3 End,float Radius,int Segments,unsigned char R,unsigned char G,unsigned char B,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugCylinder = NULL;
	if(!pFnDrawDebugCylinder)
		pFnDrawDebugCylinder = UObject::FindFunction("Function Engine.Actor.DrawDebugCylinder");

	Engine_DrawDebugCylinder_Parms DrawDebugCylinder_Parms;
	memcpy(&DrawDebugCylinder_Parms.Start,&Start,0xC);
	memcpy(&DrawDebugCylinder_Parms.End,&End,0xC);
	DrawDebugCylinder_Parms.Radius = Radius;
	DrawDebugCylinder_Parms.Segments = Segments;
	DrawDebugCylinder_Parms.R = R;
	DrawDebugCylinder_Parms.G = G;
	DrawDebugCylinder_Parms.B = B;
	DrawDebugCylinder_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugCylinder->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugCylinder,NULL,&DrawDebugCylinder_Parms,NULL);
	pFnDrawDebugCylinder->FunctionFlags |= 0x400;
}

struct Engine_SetPhysics_Parms
{
	unsigned char                                      newPhysics;                                       		// 0x000000 (0x0001)              
};

void AActor::SetPhysics(unsigned char newPhysics)
{
	static UFieldFunc* pFnSetPhysics = NULL;
	if(!pFnSetPhysics)
		pFnSetPhysics = UObject::FindFunction("Function Engine.Actor.SetPhysics");

	Engine_SetPhysics_Parms SetPhysics_Parms;
	SetPhysics_Parms.newPhysics = newPhysics;

	unsigned short NativeIndex = pFnSetPhysics->iNative;
	pFnSetPhysics->iNative = 0;
	pFnSetPhysics->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetPhysics,NULL,&SetPhysics_Parms,NULL);
	pFnSetPhysics->FunctionFlags |= 0x400;
	pFnSetPhysics->iNative = NativeIndex;
}

struct Engine_SetHardAttach_Parms
{
	unsigned long                                      bNewHardAttach : 1;                               		// 0x000000 (0x0004) [0x00000001] 
};

void AActor::SetHardAttach(bool bNewHardAttach)
{
	static UFieldFunc* pFnSetHardAttach = NULL;
	if(!pFnSetHardAttach)
		pFnSetHardAttach = UObject::FindFunction("Function Engine.Actor.SetHardAttach");

	Engine_SetHardAttach_Parms SetHardAttach_Parms;
	SetHardAttach_Parms.bNewHardAttach = bNewHardAttach;
	pFnSetHardAttach->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetHardAttach,NULL,&SetHardAttach_Parms,NULL);
	pFnSetHardAttach->FunctionFlags |= 0x400;
}

struct Engine_VisibleCollidingActors_Parms
{
	class UClass*                                      BaseClass;                                        		// 0x000000 (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000004 (0x0004)              
	float                                              Radius;                                           		// 0x000008 (0x0004)              
	FVector3                                           Loc;                                              		// 0x00000C (0x000C)              
	unsigned long                                      bIgnoreHidden : 1;                                		// 0x000018 (0x0004) [0x00000001] 
};

void AActor::VisibleCollidingActors(class UClass* BaseClass,class AActor** Actor,float Radius,FVector3 Loc,bool bIgnoreHidden)
{
	static UFieldFunc* pFnVisibleCollidingActors = NULL;
	if(!pFnVisibleCollidingActors)
		pFnVisibleCollidingActors = UObject::FindFunction("Function Engine.Actor.VisibleCollidingActors");

	Engine_VisibleCollidingActors_Parms VisibleCollidingActors_Parms;
	VisibleCollidingActors_Parms.BaseClass = BaseClass;
	VisibleCollidingActors_Parms.Radius = Radius;
	memcpy(&VisibleCollidingActors_Parms.Loc,&Loc,0xC);
	VisibleCollidingActors_Parms.bIgnoreHidden = bIgnoreHidden;

	unsigned short NativeIndex = pFnVisibleCollidingActors->iNative;
	pFnVisibleCollidingActors->iNative = 0;
	pFnVisibleCollidingActors->FunctionFlags |= ~0x400;
	ProcessEvent(pFnVisibleCollidingActors,NULL,&VisibleCollidingActors_Parms,NULL);
	pFnVisibleCollidingActors->FunctionFlags |= 0x400;
	pFnVisibleCollidingActors->iNative = NativeIndex;
	if(Actor)
		*Actor = VisibleCollidingActors_Parms.Actor;
}

struct Engine_FinishAnimControl_Parms
{
};

void AActor::FinishAnimControl()
{
	static UFieldFunc* pFnFinishAnimControl = NULL;
	if(!pFnFinishAnimControl)
		pFnFinishAnimControl = UObject::FindFunction("Function Engine.Actor.FinishAnimControl");

	Engine_FinishAnimControl_Parms FinishAnimControl_Parms;
	ProcessEvent(pFnFinishAnimControl,NULL,&FinishAnimControl_Parms,NULL);
}

struct Engine_DoKismetAttachment_Parms
{
	class AActor*                                      Attachment;                                       		// 0x000000 (0x0004)              
	class USeqAct_AttachToActor*                       Action;                                           		// 0x000004 (0x0004)              
	//unsigned long                                      bOldCollideActors : 1;                            		// 0x000008 (0x0004) [0x00000001] 
	//unsigned long                                      bOldBlockActors : 1;                              		// 0x00000C (0x0004) [0x00000001] 
	//FVector3                                           X;                                                		// 0x000010 (0x000C)              
	//FVector3                                           Y;                                                		// 0x00001C (0x000C)              
	//FVector3                                           Z;                                                		// 0x000028 (0x000C)              
};

void AActor::DoKismetAttachment(class AActor* Attachment,class USeqAct_AttachToActor* Action)
{
	static UFieldFunc* pFnDoKismetAttachment = NULL;
	if(!pFnDoKismetAttachment)
		pFnDoKismetAttachment = UObject::FindFunction("Function Engine.Actor.DoKismetAttachment");

	Engine_DoKismetAttachment_Parms DoKismetAttachment_Parms;
	DoKismetAttachment_Parms.Attachment = Attachment;
	DoKismetAttachment_Parms.Action = Action;
	ProcessEvent(pFnDoKismetAttachment,NULL,&DoKismetAttachment_Parms,NULL);
}

struct Engine_BeginAnimControl_Parms
{
	TArray<class UAnimSet*>                            InAnimSets;                                       		// 0x000000 (0x000C)              
};

void AActor::BeginAnimControl(TArray<class UAnimSet*> InAnimSets)
{
	static UFieldFunc* pFnBeginAnimControl = NULL;
	if(!pFnBeginAnimControl)
		pFnBeginAnimControl = UObject::FindFunction("Function Engine.Actor.BeginAnimControl");

	Engine_BeginAnimControl_Parms BeginAnimControl_Parms;
	memcpy(&BeginAnimControl_Parms.InAnimSets,&InAnimSets,0xC);
	ProcessEvent(pFnBeginAnimControl,NULL,&BeginAnimControl_Parms,NULL);
}

struct Engine_ClientIllegalLocation_APB_Parms
{
	struct FString                                     sErrorMessage;                                    		// 0x000000 (0x000C)              
};

void AActor::ClientIllegalLocation_APB(struct FString sErrorMessage)
{
	static UFieldFunc* pFnClientIllegalLocation_APB = NULL;
	if(!pFnClientIllegalLocation_APB)
		pFnClientIllegalLocation_APB = UObject::FindFunction("Function Engine.Actor.ClientIllegalLocation_APB");

	Engine_ClientIllegalLocation_APB_Parms ClientIllegalLocation_APB_Parms;
	memcpy(&ClientIllegalLocation_APB_Parms.sErrorMessage,&sErrorMessage,0xC);
	pFnClientIllegalLocation_APB->FunctionFlags |= ~0x400;
	ProcessEvent(pFnClientIllegalLocation_APB,NULL,&ClientIllegalLocation_APB_Parms,NULL);
	pFnClientIllegalLocation_APB->FunctionFlags |= 0x400;
}

struct Engine_SetDrawScale_Parms
{
	float                                              NewScale;                                         		// 0x000000 (0x0004)              
};

void AActor::SetDrawScale(float NewScale)
{
	static UFieldFunc* pFnSetDrawScale = NULL;
	if(!pFnSetDrawScale)
		pFnSetDrawScale = UObject::FindFunction("Function Engine.Actor.SetDrawScale");

	Engine_SetDrawScale_Parms SetDrawScale_Parms;
	SetDrawScale_Parms.NewScale = NewScale;
	pFnSetDrawScale->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDrawScale,NULL,&SetDrawScale_Parms,NULL);
	pFnSetDrawScale->FunctionFlags |= 0x400;
}

struct Engine_KilledBy_Parms
{
	class APawn*                                       EventInstigator;                                  		// 0x000000 (0x0004)              
};

void AActor::KilledBy(class APawn* EventInstigator)
{
	static UFieldFunc* pFnKilledBy = NULL;
	if(!pFnKilledBy)
		pFnKilledBy = UObject::FindFunction("Function Engine.Actor.KilledBy");

	Engine_KilledBy_Parms KilledBy_Parms;
	KilledBy_Parms.EventInstigator = EventInstigator;
	ProcessEvent(pFnKilledBy,NULL,&KilledBy_Parms,NULL);
}

struct Engine_GetDebugName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x000000 (0x000C)              
};

struct FString AActor::GetDebugName()
{
	static UFieldFunc* pFnGetDebugName = NULL;
	if(!pFnGetDebugName)
		pFnGetDebugName = UObject::FindFunction("Function Engine.Actor.GetDebugName");

	Engine_GetDebugName_Parms GetDebugName_Parms;
	ProcessEvent(pFnGetDebugName,NULL,&GetDebugName_Parms,NULL);
	return GetDebugName_Parms.ReturnValue;
}

struct Engine_GetLocalString_Parms
{
	int                                                Switch;                                           		// 0x000000 (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x000004 (0x0004)              
	class APlayerReplicationInfo*                      RelatedPRI;                                       		// 0x000008 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x00000C (0x000C)              
};

struct FString AActor::GetLocalString(int Switch,class APlayerReplicationInfo* RelatedPRI,class APlayerReplicationInfo* RelatedPRI)
{
	static UFieldFunc* pFnGetLocalString = NULL;
	if(!pFnGetLocalString)
		pFnGetLocalString = UObject::FindFunction("Function Engine.Actor.GetLocalString");

	Engine_GetLocalString_Parms GetLocalString_Parms;
	GetLocalString_Parms.Switch = Switch;
	GetLocalString_Parms.RelatedPRI = RelatedPRI;
	GetLocalString_Parms.RelatedPRI = RelatedPRI;
	ProcessEvent(pFnGetLocalString,NULL,&GetLocalString_Parms,NULL);
	return GetLocalString_Parms.ReturnValue;
}

struct Engine_SetCollisionType_Parms
{
	unsigned char                                      NewCollisionType;                                 		// 0x000000 (0x0001)              
};

void AActor::SetCollisionType(unsigned char NewCollisionType)
{
	static UFieldFunc* pFnSetCollisionType = NULL;
	if(!pFnSetCollisionType)
		pFnSetCollisionType = UObject::FindFunction("Function Engine.Actor.SetCollisionType");

	Engine_SetCollisionType_Parms SetCollisionType_Parms;
	SetCollisionType_Parms.NewCollisionType = NewCollisionType;
	pFnSetCollisionType->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetCollisionType,NULL,&SetCollisionType_Parms,NULL);
	pFnSetCollisionType->FunctionFlags |= 0x400;
}

struct Engine_DrawDebugBox_Parms
{
	FVector3                                           Center;                                           		// 0x000000 (0x000C)              
	FVector3                                           Extent;                                           		// 0x00000C (0x000C)              
	unsigned char                                      R;                                                		// 0x000018 (0x0001)              
	unsigned char                                      G;                                                		// 0x000019 (0x0001)              
	unsigned char                                      B;                                                		// 0x00001A (0x0001)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x00001C (0x0004) [0x00000001] 
};

void AActor::DrawDebugBox(FVector3 Center,FVector3 Extent,unsigned char R,unsigned char G,unsigned char B,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugBox = NULL;
	if(!pFnDrawDebugBox)
		pFnDrawDebugBox = UObject::FindFunction("Function Engine.Actor.DrawDebugBox");

	Engine_DrawDebugBox_Parms DrawDebugBox_Parms;
	memcpy(&DrawDebugBox_Parms.Center,&Center,0xC);
	memcpy(&DrawDebugBox_Parms.Extent,&Extent,0xC);
	DrawDebugBox_Parms.R = R;
	DrawDebugBox_Parms.G = G;
	DrawDebugBox_Parms.B = B;
	DrawDebugBox_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugBox->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugBox,NULL,&DrawDebugBox_Parms,NULL);
	pFnDrawDebugBox->FunctionFlags |= 0x400;
}

struct Engine_Spawn_Parms
{
	class UClass*                                      SpawnClass;                                       		// 0x000000 (0x0004)              
	class AActor*                                      SpawnOwner;                                       		// 0x000004 (0x0004)              
	struct FName                                       SpawnTag;                                         		// 0x000008 (0x0008)              
	FVector3                                           SpawnLocation;                                    		// 0x000010 (0x000C)              
	FRotator                                           SpawnRotation;                                    		// 0x00001C (0x000C)              
	class AActor*                                      ActorTemplate;                                    		// 0x000028 (0x0004)              
	unsigned long                                      bNoCollisionFail : 1;                             		// 0x00002C (0x0004) [0x00000001] 
	class AActor*                                      ReturnValue;                                      		// 0x000030 (0x0004)              
};

class AActor* AActor::Spawn(class UClass* SpawnClass,class AActor* SpawnOwner,struct FName SpawnTag,FVector3 SpawnLocation,FRotator SpawnRotation,class AActor* ActorTemplate,bool bNoCollisionFail)
{
	static UFieldFunc* pFnSpawn = NULL;
	if(!pFnSpawn)
		pFnSpawn = UObject::FindFunction("Function Engine.Actor.Spawn");

	Engine_Spawn_Parms Spawn_Parms;
	Spawn_Parms.SpawnClass = SpawnClass;
	Spawn_Parms.SpawnOwner = SpawnOwner;
	memcpy(&Spawn_Parms.SpawnTag,&SpawnTag,0x8);
	memcpy(&Spawn_Parms.SpawnLocation,&SpawnLocation,0xC);
	memcpy(&Spawn_Parms.SpawnRotation,&SpawnRotation,0xC);
	Spawn_Parms.ActorTemplate = ActorTemplate;
	Spawn_Parms.bNoCollisionFail = bNoCollisionFail;
	pFnSpawn->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSpawn,NULL,&Spawn_Parms,NULL);
	pFnSpawn->FunctionFlags |= 0x400;
	return Spawn_Parms.ReturnValue;
}

struct Engine_SetAPBCollision_Parms
{
	struct FsAPBCollision                              newAPBCollision;                                  		// 0x000000 (0x0014)              
};

void AActor::SetAPBCollision(struct FsAPBCollision newAPBCollision)
{
	static UFieldFunc* pFnSetAPBCollision = NULL;
	if(!pFnSetAPBCollision)
		pFnSetAPBCollision = UObject::FindFunction("Function Engine.Actor.SetAPBCollision");

	Engine_SetAPBCollision_Parms SetAPBCollision_Parms;
	memcpy(&SetAPBCollision_Parms.newAPBCollision,&newAPBCollision,0x14);
	pFnSetAPBCollision->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetAPBCollision,NULL,&SetAPBCollision_Parms,NULL);
	pFnSetAPBCollision->FunctionFlags |= 0x400;
}

struct Engine_OnAttachToActor_Parms
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x000000 (0x0004)              
	//int                                                Idx;                                              		// 0x000004 (0x0004)              
	//class AActor*                                      Attachment;                                       		// 0x000008 (0x0004)              
	//class AController*                                 C;                                                		// 0x00000C (0x0004)              
	//TArray<class UObject*>                             objVars;                                          		// 0x000010 (0x000C)              
};

void AActor::OnAttachToActor(class USeqAct_AttachToActor* Action)
{
	static UFieldFunc* pFnOnAttachToActor = NULL;
	if(!pFnOnAttachToActor)
		pFnOnAttachToActor = UObject::FindFunction("Function Engine.Actor.OnAttachToActor");

	Engine_OnAttachToActor_Parms OnAttachToActor_Parms;
	OnAttachToActor_Parms.Action = Action;
	ProcessEvent(pFnOnAttachToActor,NULL,&OnAttachToActor_Parms,NULL);
}

struct Engine_OnCauseDamage_Parms
{
	class USeqAct_CauseDamage*                         Action;                                           		// 0x000000 (0x0004)              
	//class AController*                                 InstigatorController;                             		// 0x000004 (0x0004)              
	//class APawn*                                       InstigatorPawn;                                   		// 0x000008 (0x0004)              
};

void AActor::OnCauseDamage(class USeqAct_CauseDamage* Action)
{
	static UFieldFunc* pFnOnCauseDamage = NULL;
	if(!pFnOnCauseDamage)
		pFnOnCauseDamage = UObject::FindFunction("Function Engine.Actor.OnCauseDamage");

	Engine_OnCauseDamage_Parms OnCauseDamage_Parms;
	OnCauseDamage_Parms.Action = Action;
	ProcessEvent(pFnOnCauseDamage,NULL,&OnCauseDamage_Parms,NULL);
}

struct Engine_InterpolationStarted_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x000000 (0x0004)              
};

void AActor::InterpolationStarted(class USeqAct_Interp* InterpAction)
{
	static UFieldFunc* pFnInterpolationStarted = NULL;
	if(!pFnInterpolationStarted)
		pFnInterpolationStarted = UObject::FindFunction("Function Engine.Actor.InterpolationStarted");

	Engine_InterpolationStarted_Parms InterpolationStarted_Parms;
	InterpolationStarted_Parms.InterpAction = InterpAction;
	ProcessEvent(pFnInterpolationStarted,NULL,&InterpolationStarted_Parms,NULL);
}

struct Engine_PlaySound_Parms
{
	class USoundCue*                                   InSoundCue;                                       		// 0x000000 (0x0004)              
	unsigned long                                      bNotReplicated : 1;                               		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bNoRepToOwner : 1;                                		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bStopWhenOwnerDestroyed : 1;                      		// 0x00000C (0x0004) [0x00000001] 
	FVector3                                           SoundLocation;                                    		// 0x000010 (0x000C)              
	unsigned long                                      bNoRepToRelevant : 1;                             		// 0x00001C (0x0004) [0x00000001] 
};

void AActor::PlaySound(class USoundCue* InSoundCue,bool bNotReplicated,bool bNoRepToOwner,bool bStopWhenOwnerDestroyed,FVector3 SoundLocation,bool bNoRepToRelevant)
{
	static UFieldFunc* pFnPlaySound = NULL;
	if(!pFnPlaySound)
		pFnPlaySound = UObject::FindFunction("Function Engine.Actor.PlaySound");

	Engine_PlaySound_Parms PlaySound_Parms;
	PlaySound_Parms.InSoundCue = InSoundCue;
	PlaySound_Parms.bNotReplicated = bNotReplicated;
	PlaySound_Parms.bNoRepToOwner = bNoRepToOwner;
	PlaySound_Parms.bStopWhenOwnerDestroyed = bStopWhenOwnerDestroyed;
	memcpy(&PlaySound_Parms.SoundLocation,&SoundLocation,0xC);
	PlaySound_Parms.bNoRepToRelevant = bNoRepToRelevant;
	pFnPlaySound->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPlaySound,NULL,&PlaySound_Parms,NULL);
	pFnPlaySound->FunctionFlags |= 0x400;
}

struct Engine_GetBaseMost_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x000000 (0x0004)              
};

class AActor* AActor::GetBaseMost()
{
	static UFieldFunc* pFnGetBaseMost = NULL;
	if(!pFnGetBaseMost)
		pFnGetBaseMost = UObject::FindFunction("Function Engine.Actor.GetBaseMost");

	Engine_GetBaseMost_Parms GetBaseMost_Parms;
	pFnGetBaseMost->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetBaseMost,NULL,&GetBaseMost_Parms,NULL);
	pFnGetBaseMost->FunctionFlags |= 0x400;
	return GetBaseMost_Parms.ReturnValue;
}

struct Engine_DrawDebugLine_Parms
{
	FVector3                                           LineStart;                                        		// 0x000000 (0x000C)              
	FVector3                                           LineEnd;                                          		// 0x00000C (0x000C)              
	unsigned char                                      R;                                                		// 0x000018 (0x0001)              
	unsigned char                                      G;                                                		// 0x000019 (0x0001)              
	unsigned char                                      B;                                                		// 0x00001A (0x0001)              
	unsigned long                                      bPersistentLines : 1;                             		// 0x00001C (0x0004) [0x00000001] 
};

void AActor::DrawDebugLine(FVector3 LineStart,FVector3 LineEnd,unsigned char R,unsigned char G,unsigned char B,bool bPersistentLines)
{
	static UFieldFunc* pFnDrawDebugLine = NULL;
	if(!pFnDrawDebugLine)
		pFnDrawDebugLine = UObject::FindFunction("Function Engine.Actor.DrawDebugLine");

	Engine_DrawDebugLine_Parms DrawDebugLine_Parms;
	memcpy(&DrawDebugLine_Parms.LineStart,&LineStart,0xC);
	memcpy(&DrawDebugLine_Parms.LineEnd,&LineEnd,0xC);
	DrawDebugLine_Parms.R = R;
	DrawDebugLine_Parms.G = G;
	DrawDebugLine_Parms.B = B;
	DrawDebugLine_Parms.bPersistentLines = bPersistentLines;
	pFnDrawDebugLine->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDrawDebugLine,NULL,&DrawDebugLine_Parms,NULL);
	pFnDrawDebugLine->FunctionFlags |= 0x400;
}

struct Engine_DetachComponent_Parms
{
	class UActorComponent*                             ExComponent;                                      		// 0x000000 (0x0004)              
};

void AActor::DetachComponent(class UActorComponent* ExComponent)
{
	static UFieldFunc* pFnDetachComponent = NULL;
	if(!pFnDetachComponent)
		pFnDetachComponent = UObject::FindFunction("Function Engine.Actor.DetachComponent");

	Engine_DetachComponent_Parms DetachComponent_Parms;
	DetachComponent_Parms.ExComponent = ExComponent;
	pFnDetachComponent->FunctionFlags |= ~0x400;
	ProcessEvent(pFnDetachComponent,NULL,&DetachComponent_Parms,NULL);
	pFnDetachComponent->FunctionFlags |= 0x400;
}

struct Engine_StopActorFaceFXAnim_Parms
{
};

void AActor::StopActorFaceFXAnim()
{
	static UFieldFunc* pFnStopActorFaceFXAnim = NULL;
	if(!pFnStopActorFaceFXAnim)
		pFnStopActorFaceFXAnim = UObject::FindFunction("Function Engine.Actor.StopActorFaceFXAnim");

	Engine_StopActorFaceFXAnim_Parms StopActorFaceFXAnim_Parms;
	ProcessEvent(pFnStopActorFaceFXAnim,NULL,&StopActorFaceFXAnim_Parms,NULL);
}

struct Engine_CollisionChanged_Parms
{
};

void AVolume::CollisionChanged()
{
	static UFieldFunc* pFnCollisionChanged = NULL;
	if(!pFnCollisionChanged)
		pFnCollisionChanged = UObject::FindFunction("Function Engine.Volume.CollisionChanged");

	Engine_CollisionChanged_Parms CollisionChanged_Parms;
	ProcessEvent(pFnCollisionChanged,NULL,&CollisionChanged_Parms,NULL);
}

struct Engine_Encompasses_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AVolume::Encompasses(class AActor* Other)
{
	static UFieldFunc* pFnEncompasses = NULL;
	if(!pFnEncompasses)
		pFnEncompasses = UObject::FindFunction("Function Engine.Volume.Encompasses");

	Engine_Encompasses_Parms Encompasses_Parms;
	Encompasses_Parms.Other = Other;
	pFnEncompasses->FunctionFlags |= ~0x400;
	ProcessEvent(pFnEncompasses,NULL,&Encompasses_Parms,NULL);
	pFnEncompasses->FunctionFlags |= 0x400;
	return Encompasses_Parms.ReturnValue;
}

struct Engine_DisplayDebug_Parms
{
	class AHUD*                                        HUD;                                              		// 0x000000 (0x0004)              
	float                                              out_YL;                                           		// 0x000004 (0x0004)              
	float                                              out_YPos;                                         		// 0x000008 (0x0004)              
};

void AVolume::DisplayDebug(class AHUD* HUD,float* out_YL,float* out_YPos)
{
	static UFieldFunc* pFnDisplayDebug = NULL;
	if(!pFnDisplayDebug)
		pFnDisplayDebug = UObject::FindFunction("Function Engine.Volume.DisplayDebug");

	Engine_DisplayDebug_Parms DisplayDebug_Parms;
	DisplayDebug_Parms.HUD = HUD;
	ProcessEvent(pFnDisplayDebug,NULL,&DisplayDebug_Parms,NULL);
	if(out_YL)
		*out_YL = DisplayDebug_Parms.out_YL;
	if(out_YPos)
		*out_YPos = DisplayDebug_Parms.out_YPos;
}

struct Engine_PostBeginPlay_Parms
{
};

void AVolume::PostBeginPlay()
{
	static UFieldFunc* pFnPostBeginPlay = NULL;
	if(!pFnPostBeginPlay)
		pFnPostBeginPlay = UObject::FindFunction("Function Engine.Volume.PostBeginPlay");

	Engine_PostBeginPlay_Parms PostBeginPlay_Parms;
	ProcessEvent(pFnPostBeginPlay,NULL,&PostBeginPlay_Parms,NULL);
}

struct Engine_OnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x000000 (0x0004)              
};

void AVolume::OnToggle(class USeqAct_Toggle* Action)
{
	static UFieldFunc* pFnOnToggle = NULL;
	if(!pFnOnToggle)
		pFnOnToggle = UObject::FindFunction("Function Engine.Volume.OnToggle");

	Engine_OnToggle_Parms OnToggle_Parms;
	OnToggle_Parms.Action = Action;
	ProcessEvent(pFnOnToggle,NULL,&OnToggle_Parms,NULL);
}

struct Engine_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool AVolume::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function Engine.Volume.OnSequenceAction");

	Engine_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct Engine_ProcessActorSetVolume_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void AVolume::ProcessActorSetVolume(class AActor* Other)
{
	static UFieldFunc* pFnProcessActorSetVolume = NULL;
	if(!pFnProcessActorSetVolume)
		pFnProcessActorSetVolume = UObject::FindFunction("Function Engine.Volume.ProcessActorSetVolume");

	Engine_ProcessActorSetVolume_Parms ProcessActorSetVolume_Parms;
	ProcessActorSetVolume_Parms.Other = Other;
	ProcessEvent(pFnProcessActorSetVolume,NULL,&ProcessActorSetVolume_Parms,NULL);
}

struct Engine_GetLocationStringFor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000000 (0x0004)              
	struct FString                                     ReturnValue;                                      		// 0x000004 (0x000C)              
};

struct FString AVolume::GetLocationStringFor(class APlayerReplicationInfo* PRI)
{
	static UFieldFunc* pFnGetLocationStringFor = NULL;
	if(!pFnGetLocationStringFor)
		pFnGetLocationStringFor = UObject::FindFunction("Function Engine.Volume.GetLocationStringFor");

	Engine_GetLocationStringFor_Parms GetLocationStringFor_Parms;
	GetLocationStringFor_Parms.PRI = PRI;
	ProcessEvent(pFnGetLocationStringFor,NULL,&GetLocationStringFor_Parms,NULL);
	return GetLocationStringFor_Parms.ReturnValue;
}

struct Engine_OnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x000000 (0x0004)              
};

void ALevelStreamingVolume::OnToggle(class USeqAct_Toggle* Action)
{
	static UFieldFunc* pFnOnToggle = NULL;
	if(!pFnOnToggle)
		pFnOnToggle = UObject::FindFunction("Function Engine.LevelStreamingVolume.OnToggle");

	Engine_OnToggle_Parms OnToggle_Parms;
	OnToggle_Parms.Action = Action;
	ProcessEvent(pFnOnToggle,NULL,&OnToggle_Parms,NULL);
}

struct Engine_PostBeginPlay_Parms
{
};

void APhysicsVolume::PostBeginPlay()
{
	static UFieldFunc* pFnPostBeginPlay = NULL;
	if(!pFnPostBeginPlay)
		pFnPostBeginPlay = UObject::FindFunction("Function Engine.PhysicsVolume.PostBeginPlay");

	Engine_PostBeginPlay_Parms PostBeginPlay_Parms;
	ProcessEvent(pFnPostBeginPlay,NULL,&PostBeginPlay_Parms,NULL);
}

struct Engine_Touch_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x000004 (0x0004)              
	FVector3                                           HitLocation;                                      		// 0x000008 (0x000C)              
	FVector3                                           HitNormal;                                        		// 0x000014 (0x000C)              
};

void APhysicsVolume::Touch(class AActor* Other,class UPrimitiveComponent* OtherComp,FVector3 HitLocation,FVector3 HitNormal)
{
	static UFieldFunc* pFnTouch = NULL;
	if(!pFnTouch)
		pFnTouch = UObject::FindFunction("Function Engine.PhysicsVolume.Touch");

	Engine_Touch_Parms Touch_Parms;
	Touch_Parms.Other = Other;
	Touch_Parms.OtherComp = OtherComp;
	memcpy(&Touch_Parms.HitLocation,&HitLocation,0xC);
	memcpy(&Touch_Parms.HitNormal,&HitNormal,0xC);
	ProcessEvent(pFnTouch,NULL,&Touch_Parms,NULL);
}

struct Engine_PawnEnteredVolume_Parms
{
	class APawn*                                       Other;                                            		// 0x000000 (0x0004)              
};

void APhysicsVolume::PawnEnteredVolume(class APawn* Other)
{
	static UFieldFunc* pFnPawnEnteredVolume = NULL;
	if(!pFnPawnEnteredVolume)
		pFnPawnEnteredVolume = UObject::FindFunction("Function Engine.PhysicsVolume.PawnEnteredVolume");

	Engine_PawnEnteredVolume_Parms PawnEnteredVolume_Parms;
	PawnEnteredVolume_Parms.Other = Other;
	ProcessEvent(pFnPawnEnteredVolume,NULL,&PawnEnteredVolume_Parms,NULL);
}

struct Engine_ModifyPlayer_Parms
{
	class APawn*                                       PlayerPawn;                                       		// 0x000000 (0x0004)              
};

void APhysicsVolume::ModifyPlayer(class APawn* PlayerPawn)
{
	static UFieldFunc* pFnModifyPlayer = NULL;
	if(!pFnModifyPlayer)
		pFnModifyPlayer = UObject::FindFunction("Function Engine.PhysicsVolume.ModifyPlayer");

	Engine_ModifyPlayer_Parms ModifyPlayer_Parms;
	ModifyPlayer_Parms.PlayerPawn = PlayerPawn;
	ProcessEvent(pFnModifyPlayer,NULL,&ModifyPlayer_Parms,NULL);
}

struct Engine_CausePainTo_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void APhysicsVolume::CausePainTo(class AActor* Other)
{
	static UFieldFunc* pFnCausePainTo = NULL;
	if(!pFnCausePainTo)
		pFnCausePainTo = UObject::FindFunction("Function Engine.PhysicsVolume.CausePainTo");

	Engine_CausePainTo_Parms CausePainTo_Parms;
	CausePainTo_Parms.Other = Other;
	ProcessEvent(pFnCausePainTo,NULL,&CausePainTo_Parms,NULL);
}

struct Engine_GetGravityZ_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float APhysicsVolume::GetGravityZ()
{
	static UFieldFunc* pFnGetGravityZ = NULL;
	if(!pFnGetGravityZ)
		pFnGetGravityZ = UObject::FindFunction("Function Engine.PhysicsVolume.GetGravityZ");

	Engine_GetGravityZ_Parms GetGravityZ_Parms;
	pFnGetGravityZ->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetGravityZ,NULL,&GetGravityZ_Parms,NULL);
	pFnGetGravityZ->FunctionFlags |= 0x400;
	return GetGravityZ_Parms.ReturnValue;
}

struct Engine_TimerPop_Parms
{
	class AVolumeTimer*                                T;                                                		// 0x000000 (0x0004)              
	//class AActor*                                      A;                                                		// 0x000004 (0x0004)              
};

void APhysicsVolume::TimerPop(class AVolumeTimer* T)
{
	static UFieldFunc* pFnTimerPop = NULL;
	if(!pFnTimerPop)
		pFnTimerPop = UObject::FindFunction("Function Engine.PhysicsVolume.TimerPop");

	Engine_TimerPop_Parms TimerPop_Parms;
	TimerPop_Parms.T = T;
	ProcessEvent(pFnTimerPop,NULL,&TimerPop_Parms,NULL);
}

struct Engine_OnSequenceAction_Parms
{
	class USequenceAction*                             Action;                                           		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool APhysicsVolume::OnSequenceAction(class USequenceAction* Action)
{
	static UFieldFunc* pFnOnSequenceAction = NULL;
	if(!pFnOnSequenceAction)
		pFnOnSequenceAction = UObject::FindFunction("Function Engine.PhysicsVolume.OnSequenceAction");

	Engine_OnSequenceAction_Parms OnSequenceAction_Parms;
	OnSequenceAction_Parms.Action = Action;
	ProcessEvent(pFnOnSequenceAction,NULL,&OnSequenceAction_Parms,NULL);
	return OnSequenceAction_Parms.ReturnValue;
}

struct Engine_PawnLeavingVolume_Parms
{
	class APawn*                                       Other;                                            		// 0x000000 (0x0004)              
};

void APhysicsVolume::PawnLeavingVolume(class APawn* Other)
{
	static UFieldFunc* pFnPawnLeavingVolume = NULL;
	if(!pFnPawnLeavingVolume)
		pFnPawnLeavingVolume = UObject::FindFunction("Function Engine.PhysicsVolume.PawnLeavingVolume");

	Engine_PawnLeavingVolume_Parms PawnLeavingVolume_Parms;
	PawnLeavingVolume_Parms.Other = Other;
	ProcessEvent(pFnPawnLeavingVolume,NULL,&PawnLeavingVolume_Parms,NULL);
}

struct Engine_OnToggle_Parms
{
	class USeqAct_Toggle*                              inAction;                                         		// 0x000000 (0x0004)              
};

void APhysicsVolume::OnToggle(class USeqAct_Toggle* inAction)
{
	static UFieldFunc* pFnOnToggle = NULL;
	if(!pFnOnToggle)
		pFnOnToggle = UObject::FindFunction("Function Engine.PhysicsVolume.OnToggle");

	Engine_OnToggle_Parms OnToggle_Parms;
	OnToggle_Parms.inAction = inAction;
	ProcessEvent(pFnOnToggle,NULL,&OnToggle_Parms,NULL);
}

struct Engine_ActorEnteredVolume_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void APhysicsVolume::ActorEnteredVolume(class AActor* Other)
{
	static UFieldFunc* pFnActorEnteredVolume = NULL;
	if(!pFnActorEnteredVolume)
		pFnActorEnteredVolume = UObject::FindFunction("Function Engine.PhysicsVolume.ActorEnteredVolume");

	Engine_ActorEnteredVolume_Parms ActorEnteredVolume_Parms;
	ActorEnteredVolume_Parms.Other = Other;
	ProcessEvent(pFnActorEnteredVolume,NULL,&ActorEnteredVolume_Parms,NULL);
}

struct Engine_ActorLeavingVolume_Parms
{
	class AActor*                                      Other;                                            		// 0x000000 (0x0004)              
};

void APhysicsVolume::ActorLeavingVolume(class AActor* Other)
{
	static UFieldFunc* pFnActorLeavingVolume = NULL;
	if(!pFnActorLeavingVolume)
		pFnActorLeavingVolume = UObject::FindFunction("Function Engine.PhysicsVolume.ActorLeavingVolume");

	Engine_ActorLeavingVolume_Parms ActorLeavingVolume_Parms;
	ActorLeavingVolume_Parms.Other = Other;
	ProcessEvent(pFnActorLeavingVolume,NULL,&ActorLeavingVolume_Parms,NULL);
}

struct Engine_OnSetDamageInstigator_Parms
{
	class USeqAct_SetDamageInstigator*                 Action;                                           		// 0x000000 (0x0004)              
};

void APhysicsVolume::OnSetDamageInstigator(class USeqAct_SetDamageInstigator* Action)
{
	static UFieldFunc* pFnOnSetDamageInstigator = NULL;
	if(!pFnOnSetDamageInstigator)
		pFnOnSetDamageInstigator = UObject::FindFunction("Function Engine.PhysicsVolume.OnSetDamageInstigator");

	Engine_OnSetDamageInstigator_Parms OnSetDamageInstigator_Parms;
	OnSetDamageInstigator_Parms.Action = Action;
	ProcessEvent(pFnOnSetDamageInstigator,NULL,&OnSetDamageInstigator_Parms,NULL);
}

struct Engine_Reset_Parms
{
};

void APhysicsVolume::Reset()
{
	static UFieldFunc* pFnReset = NULL;
	if(!pFnReset)
		pFnReset = UObject::FindFunction("Function Engine.PhysicsVolume.Reset");

	Engine_Reset_Parms Reset_Parms;
	ProcessEvent(pFnReset,NULL,&Reset_Parms,NULL);
}

struct Engine_Destroyed_Parms
{
};

void ADefaultPhysicsVolume::Destroyed()
{
	static UFieldFunc* pFnDestroyed = NULL;
	if(!pFnDestroyed)
		pFnDestroyed = UObject::FindFunction("Function Engine.DefaultPhysicsVolume.Destroyed");

	Engine_Destroyed_Parms Destroyed_Parms;
	ProcessEvent(pFnDestroyed,NULL,&Destroyed_Parms,NULL);
}

struct Engine_OnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x000000 (0x0004)              
};

void APostProcessVolume::OnToggle(class USeqAct_Toggle* Action)
{
	static UFieldFunc* pFnOnToggle = NULL;
	if(!pFnOnToggle)
		pFnOnToggle = UObject::FindFunction("Function Engine.PostProcessVolume.OnToggle");

	Engine_OnToggle_Parms OnToggle_Parms;
	OnToggle_Parms.Action = Action;
	ProcessEvent(pFnOnToggle,NULL,&OnToggle_Parms,NULL);
}

struct Engine_PostBeginPlay_Parms
{
};

void ATriggerVolume::PostBeginPlay()
{
	static UFieldFunc* pFnPostBeginPlay = NULL;
	if(!pFnPostBeginPlay)
		pFnPostBeginPlay = UObject::FindFunction("Function Engine.TriggerVolume.PostBeginPlay");

	Engine_PostBeginPlay_Parms PostBeginPlay_Parms;
	ProcessEvent(pFnPostBeginPlay,NULL,&PostBeginPlay_Parms,NULL);
}

struct Engine_StopsProjectile_Parms
{
	class AProjectile*                                 P;                                                		// 0x000000 (0x0004)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000004 (0x0004) [0x00000001] 
};

bool ATriggerVolume::StopsProjectile(class AProjectile* P)
{
	static UFieldFunc* pFnStopsProjectile = NULL;
	if(!pFnStopsProjectile)
		pFnStopsProjectile = UObject::FindFunction("Function Engine.TriggerVolume.StopsProjectile");

	Engine_StopsProjectile_Parms StopsProjectile_Parms;
	StopsProjectile_Parms.P = P;
	ProcessEvent(pFnStopsProjectile,NULL,&StopsProjectile_Parms,NULL);
	return StopsProjectile_Parms.ReturnValue;
}

struct Engine_SetViewTarget_Parms
{
	class AActor*                                      NewViewTarget;                                    		// 0x000000 (0x0004)              
	struct FViewTargetTransitionParams                 TransitionParams;                                 		// 0x000004 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000010 (0x0004) [0x00000001] 
};

bool ACamera::SetViewTarget(class AActor* NewViewTarget,struct FViewTargetTransitionParams TransitionParams)
{
	static UFieldFunc* pFnSetViewTarget = NULL;
	if(!pFnSetViewTarget)
		pFnSetViewTarget = UObject::FindFunction("Function Engine.Camera.SetViewTarget");

	Engine_SetViewTarget_Parms SetViewTarget_Parms;
	SetViewTarget_Parms.NewViewTarget = NewViewTarget;
	memcpy(&SetViewTarget_Parms.TransitionParams,&TransitionParams,0xC);
	pFnSetViewTarget->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetViewTarget,NULL,&SetViewTarget_Parms,NULL);
	pFnSetViewTarget->FunctionFlags |= 0x400;
	return SetViewTarget_Parms.ReturnValue;
}

struct Engine_SetFOV_Parms
{
	float                                              NewFOV;                                           		// 0x000000 (0x0004)              
};

void ACamera::SetFOV(float NewFOV)
{
	static UFieldFunc* pFnSetFOV = NULL;
	if(!pFnSetFOV)
		pFnSetFOV = UObject::FindFunction("Function Engine.Camera.SetFOV");

	Engine_SetFOV_Parms SetFOV_Parms;
	SetFOV_Parms.NewFOV = NewFOV;
	pFnSetFOV->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetFOV,NULL,&SetFOV_Parms,NULL);
	pFnSetFOV->FunctionFlags |= 0x400;
}

struct Engine_DisplayDebug_Parms
{
	class AHUD*                                        HUD;                                              		// 0x000000 (0x0004)              
	float                                              out_YL;                                           		// 0x000004 (0x0004)              
	float                                              out_YPos;                                         		// 0x000008 (0x0004)              
	//FVector3                                           EyesLoc;                                          		// 0x00000C (0x000C)              
	//FRotator                                           EyesRot;                                          		// 0x000018 (0x000C)              
	//class UCanvas*                                     Canvas;                                           		// 0x000024 (0x0004)              
};

void ACamera::DisplayDebug(class AHUD* HUD,float* out_YL,float* out_YPos)
{
	static UFieldFunc* pFnDisplayDebug = NULL;
	if(!pFnDisplayDebug)
		pFnDisplayDebug = UObject::FindFunction("Function Engine.Camera.DisplayDebug");

	Engine_DisplayDebug_Parms DisplayDebug_Parms;
	DisplayDebug_Parms.HUD = HUD;
	ProcessEvent(pFnDisplayDebug,NULL,&DisplayDebug_Parms,NULL);
	if(out_YL)
		*out_YL = DisplayDebug_Parms.out_YL;
	if(out_YPos)
		*out_YPos = DisplayDebug_Parms.out_YPos;
}

struct Engine_SetDesiredColorScale_Parms
{
	FVector3                                           NewColorScale;                                    		// 0x000000 (0x000C)              
	float                                              InterpTime;                                       		// 0x00000C (0x0004)              
};

void ACamera::SetDesiredColorScale(FVector3 NewColorScale,float InterpTime)
{
	static UFieldFunc* pFnSetDesiredColorScale = NULL;
	if(!pFnSetDesiredColorScale)
		pFnSetDesiredColorScale = UObject::FindFunction("Function Engine.Camera.SetDesiredColorScale");

	Engine_SetDesiredColorScale_Parms SetDesiredColorScale_Parms;
	memcpy(&SetDesiredColorScale_Parms.NewColorScale,&NewColorScale,0xC);
	SetDesiredColorScale_Parms.InterpTime = InterpTime;
	pFnSetDesiredColorScale->FunctionFlags |= ~0x400;
	ProcessEvent(pFnSetDesiredColorScale,NULL,&SetDesiredColorScale_Parms,NULL);
	pFnSetDesiredColorScale->FunctionFlags |= 0x400;
}

struct Engine_GetViewTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x000000 (0x0004)              
};

class AActor* ACamera::GetViewTarget()
{
	static UFieldFunc* pFnGetViewTarget = NULL;
	if(!pFnGetViewTarget)
		pFnGetViewTarget = UObject::FindFunction("Function Engine.Camera.GetViewTarget");

	Engine_GetViewTarget_Parms GetViewTarget_Parms;
	pFnGetViewTarget->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetViewTarget,NULL,&GetViewTarget_Parms,NULL);
	pFnGetViewTarget->FunctionFlags |= 0x400;
	return GetViewTarget_Parms.ReturnValue;
}

struct Engine_ApplyCameraModifiers_Parms
{
	float                                              DeltaTime;                                        		// 0x000000 (0x0004)              
	struct FTPOV                                       OutPOV;                                           		// 0x000004 (0x001C)              
};

void ACamera::ApplyCameraModifiers(float DeltaTime,struct FTPOV* OutPOV)
{
	static UFieldFunc* pFnApplyCameraModifiers = NULL;
	if(!pFnApplyCameraModifiers)
		pFnApplyCameraModifiers = UObject::FindFunction("Function Engine.Camera.ApplyCameraModifiers");

	Engine_ApplyCameraModifiers_Parms ApplyCameraModifiers_Parms;
	ApplyCameraModifiers_Parms.DeltaTime = DeltaTime;
	pFnApplyCameraModifiers->FunctionFlags |= ~0x400;
	ProcessEvent(pFnApplyCameraModifiers,NULL,&ApplyCameraModifiers_Parms,NULL);
	pFnApplyCameraModifiers->FunctionFlags |= 0x400;
	if(OutPOV)
		memcpy(OutPOV,&ApplyCameraModifiers_Parms.OutPOV,0x1C);
}

struct Engine_UpdateCamera_Parms
{
	float                                              DeltaTime;                                        		// 0x000000 (0x0004)              
};

void ACamera::UpdateCamera(float DeltaTime)
{
	static UFieldFunc* pFnUpdateCamera = NULL;
	if(!pFnUpdateCamera)
		pFnUpdateCamera = UObject::FindFunction("Function Engine.Camera.UpdateCamera");

	Engine_UpdateCamera_Parms UpdateCamera_Parms;
	UpdateCamera_Parms.DeltaTime = DeltaTime;
	pFnUpdateCamera->FunctionFlags |= ~0x400;
	ProcessEvent(pFnUpdateCamera,NULL,&UpdateCamera_Parms,NULL);
	pFnUpdateCamera->FunctionFlags |= 0x400;
}

struct Engine_GetFOVAngle_Parms
{
	float                                              ReturnValue;                                      		// 0x000000 (0x0004)              
};

float ACamera::GetFOVAngle()
{
	static UFieldFunc* pFnGetFOVAngle = NULL;
	if(!pFnGetFOVAngle)
		pFnGetFOVAngle = UObject::FindFunction("Function Engine.Camera.GetFOVAngle");

	Engine_GetFOVAngle_Parms GetFOVAngle_Parms;
	pFnGetFOVAngle->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetFOVAngle,NULL,&GetFOVAngle_Parms,NULL);
	pFnGetFOVAngle->FunctionFlags |= 0x400;
	return GetFOVAngle_Parms.ReturnValue;
}

struct Engine_StopCameraAnim_Parms
{
	class UCameraAnimInst*                             AnimInst;                                         		// 0x000000 (0x0004)              
	unsigned long                                      bImmediate : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
};

void AAnimatedCamera::StopCameraAnim(class UCameraAnimInst* AnimInst,bool bImmediate)
{
	static UFieldFunc* pFnStopCameraAnim = NULL;
	if(!pFnStopCameraAnim)
		pFnStopCameraAnim = UObject::FindFunction("Function Engine.AnimatedCamera.StopCameraAnim");

	Engine_StopCameraAnim_Parms StopCameraAnim_Parms;
	StopCameraAnim_Parms.AnimInst = AnimInst;
	StopCameraAnim_Parms.bImmediate = bImmediate;
	pFnStopCameraAnim->FunctionFlags |= ~0x400;
	ProcessEvent(pFnStopCameraAnim,NULL,&StopCameraAnim_Parms,NULL);
	pFnStopCameraAnim->FunctionFlags |= 0x400;
}

struct Engine_PlayCameraAnim_Parms
{
	class UCameraAnim*                                 Anim;                                             		// 0x000000 (0x0004)              
	float                                              Rate;                                             		// 0x000004 (0x0004)              
	float                                              Scale;                                            		// 0x000008 (0x0004)              
	float                                              BlendInTime;                                      		// 0x00000C (0x0004)              
	float                                              BlendOutTime;                                     		// 0x000010 (0x0004)              
	unsigned long                                      bLoop : 1;                                        		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      bRandomStartTime : 1;                             		// 0x000018 (0x0004) [0x00000001] 
	float                                              Duration;                                         		// 0x00001C (0x0004)              
	class UCameraAnimInst*                             ReturnValue;                                      		// 0x000020 (0x0004)              
};

class UCameraAnimInst* AAnimatedCamera::PlayCameraAnim(class UCameraAnim* Anim,float Rate,float Scale,float BlendInTime,float BlendOutTime,bool bLoop,bool bRandomStartTime,float Duration)
{
	static UFieldFunc* pFnPlayCameraAnim = NULL;
	if(!pFnPlayCameraAnim)
		pFnPlayCameraAnim = UObject::FindFunction("Function Engine.AnimatedCamera.PlayCameraAnim");

	Engine_PlayCameraAnim_Parms PlayCameraAnim_Parms;
	PlayCameraAnim_Parms.Anim = Anim;
	PlayCameraAnim_Parms.Rate = Rate;
	PlayCameraAnim_Parms.Scale = Scale;
	PlayCameraAnim_Parms.BlendInTime = BlendInTime;
	PlayCameraAnim_Parms.BlendOutTime = BlendOutTime;
	PlayCameraAnim_Parms.bLoop = bLoop;
	PlayCameraAnim_Parms.bRandomStartTime = bRandomStartTime;
	PlayCameraAnim_Parms.Duration = Duration;
	pFnPlayCameraAnim->FunctionFlags |= ~0x400;
	ProcessEvent(pFnPlayCameraAnim,NULL,&PlayCameraAnim_Parms,NULL);
	pFnPlayCameraAnim->FunctionFlags |= 0x400;
	return PlayCameraAnim_Parms.ReturnValue;
}

struct Engine_Destroyed_Parms
{
};

void AAnimatedCamera::Destroyed()
{
	static UFieldFunc* pFnDestroyed = NULL;
	if(!pFnDestroyed)
		pFnDestroyed = UObject::FindFunction("Function Engine.AnimatedCamera.Destroyed");

	Engine_Destroyed_Parms Destroyed_Parms;
	ProcessEvent(pFnDestroyed,NULL,&Destroyed_Parms,NULL);
}

struct Engine_ApplyCameraModifiersNative_Parms
{
	float                                              DeltaTime;                                        		// 0x000000 (0x0004)              
	struct FTPOV                                       OutPOV;                                           		// 0x000004 (0x001C)              
};

void AAnimatedCamera::ApplyCameraModifiersNative(float DeltaTime,struct FTPOV* OutPOV)
{
	static UFieldFunc* pFnApplyCameraModifiersNative = NULL;
	if(!pFnApplyCameraModifiersNative)
		pFnApplyCameraModifiersNative = UObject::FindFunction("Function Engine.AnimatedCamera.ApplyCameraModifiersNative");

	Engine_ApplyCameraModifiersNative_Parms ApplyCameraModifiersNative_Parms;
	ApplyCameraModifiersNative_Parms.DeltaTime = DeltaTime;
	pFnApplyCameraModifiersNative->FunctionFlags |= ~0x400;
	ProcessEvent(pFnApplyCameraModifiersNative,NULL,&ApplyCameraModifiersNative_Parms,NULL);
	pFnApplyCameraModifiersNative->FunctionFlags |= 0x400;
	if(OutPOV)
		memcpy(OutPOV,&ApplyCameraModifiersNative_Parms.OutPOV,0x1C);
}

struct Engine_StopAllCameraAnimsByType_Parms
{
	class UCameraAnim*                                 Anim;                                             		// 0x000000 (0x0004)              
	unsigned long                                      bImmediate : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
};

void AAnimatedCamera::StopAllCameraAnimsByType(class UCameraAnim* Anim,bool bImmediate)
{
	static UFieldFunc* pFnStopAllCameraAnimsByType = NULL;
	if(!pFnStopAllCameraAnimsByType)
		pFnStopAllCameraAnimsByType = UObject::FindFunction("Function Engine.AnimatedCamera.StopAllCameraAnimsByType");

	Engine_StopAllCameraAnimsByType_Parms StopAllCameraAnimsByType_Parms;
	StopAllCameraAnimsByType_Parms.Anim = Anim;
	StopAllCameraAnimsByType_Parms.bImmediate = bImmediate;
	pFnStopAllCameraAnimsByType->FunctionFlags |= ~0x400;
	ProcessEvent(pFnStopAllCameraAnimsByType,NULL,&StopAllCameraAnimsByType_Parms,NULL);
	pFnStopAllCameraAnimsByType->FunctionFlags |= 0x400;
}

struct Engine_PostBeginPlay_Parms
{
	//int                                                Idx;                                              		// 0x000000 (0x0004)              
};

void AAnimatedCamera::PostBeginPlay()
{
	static UFieldFunc* pFnPostBeginPlay = NULL;
	if(!pFnPostBeginPlay)
		pFnPostBeginPlay = UObject::FindFunction("Function Engine.AnimatedCamera.PostBeginPlay");

	Engine_PostBeginPlay_Parms PostBeginPlay_Parms;
	ProcessEvent(pFnPostBeginPlay,NULL,&PostBeginPlay_Parms,NULL);
}

struct Engine_ApplyCameraModifiers_Parms
{
	float                                              DeltaTime;                                        		// 0x000000 (0x0004)              
	struct FTPOV                                       OutPOV;                                           		// 0x000004 (0x001C)              
};

void AAnimatedCamera::ApplyCameraModifiers(float DeltaTime,struct FTPOV* OutPOV)
{
	static UFieldFunc* pFnApplyCameraModifiers = NULL;
	if(!pFnApplyCameraModifiers)
		pFnApplyCameraModifiers = UObject::FindFunction("Function Engine.AnimatedCamera.ApplyCameraModifiers");

	Engine_ApplyCameraModifiers_Parms ApplyCameraModifiers_Parms;
	ApplyCameraModifiers_Parms.DeltaTime = DeltaTime;
	pFnApplyCameraModifiers->FunctionFlags |= ~0x400;
	ProcessEvent(pFnApplyCameraModifiers,NULL,&ApplyCameraModifiers_Parms,NULL);
	pFnApplyCameraModifiers->FunctionFlags |= 0x400;
	if(OutPOV)
		memcpy(OutPOV,&ApplyCameraModifiers_Parms.OutPOV,0x1C);
}

struct Engine_DisplayDebug_Parms
{
	class AHUD*                                        HUD;                                              		// 0x000000 (0x0004)              
	float                                              out_YL;                                           		// 0x000004 (0x0004)              
	float                                              out_YPos;                                         		// 0x000008 (0x0004)              
	//float                                              XL;                                               		// 0x00000C (0x0004)              
	//class UCanvas*                                     Canvas;                                           		// 0x000010 (0x0004)              
};

void ACameraActor::DisplayDebug(class AHUD* HUD,float* out_YL,float* out_YPos)
{
	static UFieldFunc* pFnDisplayDebug = NULL;
	if(!pFnDisplayDebug)
		pFnDisplayDebug = UObject::FindFunction("Function Engine.CameraActor.DisplayDebug");

	Engine_DisplayDebug_Parms DisplayDebug_Parms;
	DisplayDebug_Parms.HUD = HUD;
	ProcessEvent(pFnDisplayDebug,NULL,&DisplayDebug_Parms,NULL);
	if(out_YL)
		*out_YL = DisplayDebug_Parms.out_YL;
	if(out_YPos)
		*out_YPos = DisplayDebug_Parms.out_YPos;
}

struct Engine_ReplicatedEvent_Parms
{
	struct FName                                       sVariableName;                                    		// 0x000000 (0x0008)              
};

void AcEngineClientServerDebugManager::ReplicatedEvent(struct FName sVariableName)
{
	static UFieldFunc* pFnReplicatedEvent = NULL;
	if(!pFnReplicatedEvent)
		pFnReplicatedEvent = UObject::FindFunction("Function Engine.cEngineClientServerDebugManager.ReplicatedEvent");

	Engine_ReplicatedEvent_Parms ReplicatedEvent_Parms;
	memcpy(&ReplicatedEvent_Parms.sVariableName,&sVariableName,0x8);
	ProcessEvent(pFnReplicatedEvent,NULL,&ReplicatedEvent_Parms,NULL);
}

struct Engine_GetPlayerViewPoint_Parms
{
	FVector3                                           out_Location;                                     		// 0x000000 (0x000C)              
	FRotator                                           out_Rotation;                                     		// 0x00000C (0x000C)              
};

void AController::GetPlayerViewPoint(FVector3* out_Location,FRotator* out_Rotation)
{
	static UFieldFunc* pFnGetPlayerViewPoint = NULL;
	if(!pFnGetPlayerViewPoint)
		pFnGetPlayerViewPoint = UObject::FindFunction("Function Engine.Controller.GetPlayerViewPoint");

	Engine_GetPlayerViewPoint_Parms GetPlayerViewPoint_Parms;
	pFnGetPlayerViewPoint->FunctionFlags |= ~0x400;
	ProcessEvent(pFnGetPlayerViewPoint,NULL,&GetPlayerViewPoint_Parms,NULL);
	pFnGetPlayerViewPoint->FunctionFlags |= 0x400;
	if(out_Location)
		memcpy(out_Location,&GetPlayerViewPoint_Parms.out_Location,0xC);
	if(out_Rotation)
		memcpy(out_Rotation,&GetPlayerViewPoint_Parms.out_Rotation,0xC);
}

struct Engine_ClientSetLocation_Parms
{
	FVector3                                           NewLocation;                                      		// 0x000000 (0x000C)              
	FRotator                                           NewRotation;                                      		// 0x00000C (0x000C)              
};

void AController::ClientSetLocation(FVector3 NewLocation,FRotator NewRotation)
{
	static UFieldFunc* pFnClientSetLocation = NULL;
	if(!pFnClientSetLocation)
		pFnClientSetLocation = UObject::FindFunction("Function Engine.Controller.ClientSetLocation");

	Engine_ClientSetLocation_Parms ClientSetLocation_Parms;
	memcpy(&ClientSetLocation_Parms.NewLocation,&NewLocation,0xC);
	memcpy(&ClientSetLocation_Parms.NewRotation,&NewRotation,0xC);
	ProcessEvent(pFnClientSetLocation,NULL,&ClientSetLocation_Parms,NULL);
}

struct Engine_CanSeeByPoints_Parms
{
	FVector3                                           ViewLocation;                                     		// 0x000000 (0x000C)              
	FVector3                                           TestLocation;                                     		// 0x00000C (0x000C)              
	FRotator                                           ViewRotation;                                     		// 0x000018 (0x000C)              
	unsigned long                                      ReturnValue : 1;                                  		// 0x000024 (0x0004) [0x00000001] 
};

bool AController::CanSeeByPoints(FVector3 ViewLocation,FVector3 TestLocation,FRotator ViewRotation)
{
	static UFieldFunc* pFnCanSeeByPoints = NULL;
	if(!pFnCanSeeByPoints)
		pFnCanSeeByPoints = UObject::FindFunction("Function Engine.Controller.CanSeeByPoints");

