
/*
-----------------------------------------------------------------
 - UConst
-----------------------------------------------------------------
*/
#define CONST_NUM_NPC_TYPES                                      6
#define CONST_TRACEFLAG_Bullet                                   1
#define CONST_TRACEFLAG_PhysicsVolumes                           2
#define CONST_TRACEFLAG_SkipMovers                               4
#define CONST_TRACEFLAG_Blocking                                 8
#define CONST_REP_RBLOCATION_ERROR_TOLERANCE_SQ                  16.0f
#define CONST_TRACEFLAG_Targeting                                16
#define CONST_MINFLOORZ                                          0.7
#define CONST_ACTORMAXSTEPHEIGHT                                 35.0
#define CONST_RBSTATE_LINVELSCALE                                10.0
#define CONST_RBSTATE_ANGVELSCALE                                1000.0
#define CONST_RB_None                                            0x00
#define CONST_RB_NeedsUpdate                                     0x01
#define CONST_RB_Sleeping                                        0x02
#define CONST_SDPG_NumBits                                       3
#define CONST_MAX_ACTIVE_CAMERA_ANIMS                            8
#define CONST_LATENT_MOVETOWARD                                  503
#define CONST_MAXPOSITIONERRORSQUARED                            3.0
#define CONST_MAXNEARZEROVELOCITYSQUARED                         9.0

	PF_A16B16G16R16 = 20,
	PF_D24 = 21,
	PF_R16F = 22,
	PF_R16F_FILTER = 23,
	PF_BC5 = 24,
	PF_V8U8 = 25,
	PF_A1 = 26,
	PF_FloatR11G11B10 = 27,
	PF_A4R4G4B4 = 28,
	PF_R5G6B5 = 29,
	PF_RGBA32_Unordered = 30,
	PF_MAX = 31,
};
enum TextureFilter
{
	TF_Nearest = 0,
	TF_Linear = 1,
	TF_MAX = 2,
};
enum TextureAddress
{
	TA_Wrap = 0,
	TA_Clamp = 1,
	TA_Mirror = 2,
	TA_Border = 3,
	TA_MAX = 4,
};
enum TextureGroup
{
	TEXTUREGROUP_World = 0,
	TEXTUREGROUP_WorldNormalMap = 1,
	TEXTUREGROUP_WorldSpecular = 2,
	TEXTUREGROUP_Character = 3,
	TEXTUREGROUP_CharacterNormalMap = 4,
	TEXTUREGROUP_CharacterSpecular = 5,
	TEXTUREGROUP_Weapon = 6,
	TEXTUREGROUP_WeaponNormalMap = 7,
	TEXTUREGROUP_WeaponSpecular = 8,
	TEXTUREGROUP_Vehicle = 9,
	TEXTUREGROUP_VehicleNormalMap = 10,
	TEXTUREGROUP_VehicleSpecular = 11,
	TEXTUREGROUP_Cinematic = 12,
	TEXTUREGROUP_Effects = 13,
	TEXTUREGROUP_Skybox = 14,
	TEXTUREGROUP_UI = 15,
	TEXTUREGROUP_LightAndShadowMap = 16,
	TEXTUREGROUP_RenderTarget = 17,
	TEXTUREGROUP_GolemCharacter = 18,
	TEXTUREGROUP_GolemVehicle = 19,
	TEXTUREGROUP_LCPedestrian = 20,
	TEXTUREGROUP_LCVehicle = 21,
	TEXTUREGROUP_MAX = 22,
};
enum ETextureMipCount
{
	TMC_ResidentMips = 0,
	TMC_AllMips = 1,
	TMC_MAX = 2,
};
enum etTextureCategory
{
	TEXCAT_Unknown = 0,
	TEXCAT_Environment = 1,
	TEXCAT_Prop = 2,
	TEXCAT_Signage = 3,
	TEXCAT_PlayerCharacter = 4,
	TEXCAT_PlayerVehicle = 5,
	TEXCAT_PlayerGraffiti = 6,
	TEXCAT_PlayerStatue = 7,
	TEXCAT_LCPedestrian = 8,
	TEXCAT_LCVehicle = 9,
	TEXCAT_CharacterShared = 10,
	TEXCAT_VehicleShared = 11,
	TEXCAT_Pickup = 12,
	TEXCAT_CharacterSource = 13,
	TEXCAT_VehicleSource = 14,
	TEXCAT_PrimitiveSource = 15,
	TEXCAT_UI = 16,
	TEXCAT_UI_StreamedIcon = 17,
	TEXCAT_VFX = 18,
	TEXCAT_LightAndShadowMap = 19,
	TEXCAT_RenderTarget = 20,
	TEXCAT_NonFinal = 21,
	TEXCAT_Contact = 22,
	TEXCAT_BuildingCollision = 23,
	TEXCAT_Engine = 24,
	TEXCAT_Volumes = 25,
	TEXCAT_ColourLookupTable = 26,
	TEXCAT_MAX = 27,
};
enum etTextureUsage
{
	TEXUSE_Diffuse = 0,
	TEXUSE_Normal = 1,
	TEXUSE_MAX = 2,
};
enum CropMode
{
	CROP_None = 0,
	CROP_Alpha = 1,
	CROP_RGB = 2,
	CROP_RGBA = 3,
	CROP_MAX = 4,
};
enum DistanceFieldResolutionMode
{
	DF_Visual = 0,
	DF_Auto = 1,
	DF = 2,
	DF = 3,
	DF = 4,
	DF_MAX = 5,
};
enum TextureFlipBookMethod
{
	TFBM_UL_ROW = 0,
	TFBM_UL_COL = 1,
	TFBM_UR_ROW = 2,
	TFBM_UR_COL = 3,
	TFBM_LL_ROW = 4,
	TFBM_LL_COL = 5,
	TFBM_LR_ROW = 6,
	TFBM_LR_COL = 7,
	TFBM_RANDOM = 8,
	TFBM_MAX = 9,
};
enum EMovieStreamSource
{
	MovieStream_File = 0,
	MovieStream_Memory = 1,
	MovieStream_MAX = 2,
};
enum EWheelSide
{
	SIDE_None = 0,
	SIDE_Left = 1,
	SIDE_Right = 2,
	SIDE_MAX = 3,
};
enum ETerrainMappingType
{
	TMT_Auto = 0,
	TMT_XY = 1,
	TMT_XZ = 2,
	TMT_YZ = 3,
	TMT_MAX = 4,
};
enum EFadeType
{
	EFT_None = 0,
	EFT_Fading = 1,
	EFT_Pulsing = 2,
	EFT_MAX = 3,
};

/*
-----------------------------------------------------------------
 - Structs
-----------------------------------------------------------------
*/
//0x000058
//AnimBlendChild[0x17C638E0]
struct FAnimBlendChild
{
	struct FName                                       Name;                                             		// 0x000000 (0x0008)              
	class UAnimNode*                                   Anim;                                             		// 0x000008 (0x0004)              
	float                                              Weight;                                           		// 0x00000C (0x0004)              
	float                                              TotalWeight;                                      		// 0x000010 (0x0004)              
	int                                                bHasRootMotion;                                   		// 0x000014 (0x0004)              
	unsigned char                                      _0x000018[0x8];                                   		// 0x000018 (0x0008) MISSED OFFSET
	struct FBoneAtom                                   RootMotion;                                       		// 0x000020 (0x0030)              
	unsigned long                                      bMirrorSkeleton : 1;                              		// 0x000050 (0x0004) [0x00000001] 
	int                                                DrawY;                                            		// 0x000054 (0x0004)              
};
//0x00001C
//AimTransform[0x17C63878]
struct FAimTransform
{
	struct FQuat                                       Quaternion;                                       		// 0x000000 (0x0010)              
	FVector3                                           Translation;                                      		// 0x000010 (0x000C)              
};
//0x000130
//AimComponent[0x17C63810]
struct FAimComponent
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
	unsigned char                                      _0x000008[0x8];                                   		// 0x000008 (0x0008) MISSED OFFSET
	struct FAimTransform                               LU;                                               		// 0x000010 (0x0020)              
	struct FAimTransform                               LC;                                               		// 0x000030 (0x0020)              
	struct FAimTransform                               LD;                                               		// 0x000050 (0x0020)              
	struct FAimTransform                               CU;                                               		// 0x000070 (0x0020)              
	struct FAimTransform                               CC;                                               		// 0x000090 (0x0020)              
	struct FAimTransform                               CD;                                               		// 0x0000B0 (0x0020)              
	struct FAimTransform                               RU;                                               		// 0x0000D0 (0x0020)              
	struct FAimTransform                               RC;                                               		// 0x0000F0 (0x0020)              
	struct FAimTransform                               RD;                                               		// 0x000110 (0x0020)              
};
//0x00006C
//AimOffsetProfile[0x17C637A8]
struct FAimOffsetProfile
{
	struct FName                                       ProfileName;                                      		// 0x000000 (0x0008)              
	FVector2                                           HorizontalRange;                                  		// 0x000008 (0x0008)              
	FVector2                                           VerticalRange;                                    		// 0x000010 (0x0008)              
	TArray<struct FAimComponent>                       AimComponents;                                    		// 0x000018 (0x000C)              
	struct FName                                       AnimName_LU;                                      		// 0x000024 (0x0008)              
	struct FName                                       AnimName_LC;                                      		// 0x00002C (0x0008)              
	struct FName                                       AnimName_LD;                                      		// 0x000034 (0x0008)              
	struct FName                                       AnimName_CU;                                      		// 0x00003C (0x0008)              
	struct FName                                       AnimName_CC;                                      		// 0x000044 (0x0008)              
	struct FName                                       AnimName_CD;                                      		// 0x00004C (0x0008)              
	struct FName                                       AnimName_RU;                                      		// 0x000054 (0x0008)              
	struct FName                                       AnimName_RC;                                      		// 0x00005C (0x0008)              
	struct FName                                       AnimName_RD;                                      		// 0x000064 (0x0008)              
};
//0x000010
//AnimInfo[0x17C63740]
struct FAnimInfo
{
	struct FName                                       AnimSeqName;                                      		// 0x000000 (0x0008)              
	class UAnimSequence*                               AnimSeq;                                          		// 0x000008 (0x0004)              
	int                                                AnimLinkupIndex;                                  		// 0x00000C (0x0004)              
};
//0x00001C
//AnimBlendInfo[0x17C636D8]
struct FAnimBlendInfo
{
	struct FName                                       AnimName;                                         		// 0x000000 (0x0008)              
	struct FAnimInfo                                   AnimInfo;                                         		// 0x000008 (0x0010)              
	float                                              Weight;                                           		// 0x000018 (0x0004)              
};
//0x000015
//RandomAnimInfo[0x17C63670]
struct FRandomAnimInfo
{
	float                                              Chance;                                           		// 0x000000 (0x0004)              
	unsigned char                                      LoopCountMin;                                     		// 0x000004 (0x0001)              PROPERTY: 
	unsigned char                                      LoopCountMax;                                     		// 0x000005 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000006[0x2];                                   		// 0x000006 (0x0002) MISSED OFFSET
	float                                              BlendInTime;                                      		// 0x000008 (0x0004)              
	FVector2                                           PlayRateRange;                                    		// 0x00000C (0x0008)              
	unsigned char                                      LoopCount;                                        		// 0x000014 (0x0001)              PROPERTY: 
};
//0x000030
//ChildBoneBlendInfo[0x17C63608]
struct FChildBoneBlendInfo
{
	TArray<float>                                      TargetPerBoneWeight;                              		// 0x000000 (0x000C)              
	struct FName                                       InitTargetStartBone;                              		// 0x00000C (0x0008)              
	float                                              InitPerBoneIncrease;                              		// 0x000014 (0x0004)              
	struct FName                                       OldStartBone;                                     		// 0x000018 (0x0008)              
	float                                              OldBoneIncrease;                                  		// 0x000020 (0x0004)              
	TArray<unsigned char>                              TargetRequiredBones;                              		// 0x000024 (0x000C)              
};
//0x000020
//SynchGroup[0x17C635A0]
struct FSynchGroup
{
	TArray<class UAnimNodeSequence*>                   SeqNodes;                                         		// 0x000000 (0x000C)              
	class UAnimNodeSequence*                           MasterNode;                                       		// 0x00000C (0x0004)              
	struct FName                                       GroupName;                                        		// 0x000010 (0x0008)              
	unsigned long                                      bFireSlaveNotifies : 1;                           		// 0x000018 (0x0004) [0x00000001] 
	float                                              RateScale;                                        		// 0x00001C (0x0004)              
};
//0x000020
//AnimGroup[0x17C63538]
struct FAnimGroup
{
	TArray<class UAnimNodeSequence*>                   SeqNodes;                                         		// 0x000000 (0x000C)              
	class UAnimNodeSequence*                           SynchMaster;                                      		// 0x00000C (0x0004)              
	class UAnimNodeSequence*                           NotifyMaster;                                     		// 0x000010 (0x0004)              
	struct FName                                       GroupName;                                        		// 0x000014 (0x0008)              
	float                                              RateScale;                                        		// 0x00001C (0x0004)              
};
//0x000010
//SkelControlListHead[0x17C634D0]
struct FSkelControlListHead
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
	class USkelControlBase*                            ControlHead;                                      		// 0x000008 (0x0004)              
	int                                                DrawY;                                            		// 0x00000C (0x0004)              
};
//0x00001C
//TimerData[0x17C63468]
struct FTimerData
{
	unsigned long                                      bLoop : 1;                                        		// 0x000000 (0x0004) [0x00000001] 
	struct FScriptDelegate                             Function;                                         		// 0x000004 (0x000C)              
	float                                              Rate;                                             		// 0x000010 (0x0004)              
	float                                              Count;                                            		// 0x000014 (0x0004)              
	unsigned long                                      bPaused : 1;                                      		// 0x000018 (0x0004) [0x00000001] 
};
//0x00001C
//TraceHitInfo[0x17C63400]
struct FTraceHitInfo
{
	class UMaterial*                                   Material;                                         		// 0x000000 (0x0004)              
	class UPhysicalMaterial*                           PhysMaterial;                                     		// 0x000004 (0x0004)              
	int                                                Item;                                             		// 0x000008 (0x0004)              
	int                                                LevelIndex;                                       		// 0x00000C (0x0004)              
	struct FName                                       BoneName;                                         		// 0x000010 (0x0008)              
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x000018 (0x0004)              
};
//0x000030
//DamageInfo[0x17C63398]
struct FDamageInfo
{
	unsigned char                                      m_eDamageInfoType;                                		// 0x000000 (0x0001)              PROPERTY: etDamageInfoType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	int                                                m_DamageAmount;                                   		// 0x000004 (0x0004)              
	float                                              m_Radius;                                         		// 0x000008 (0x0004)              
	FVector3                                           m_HitLocation;                                    		// 0x00000C (0x000C)              
	FVector3                                           m_HitDir;                                         		// 0x000018 (0x000C)              
	struct FName                                       m_BoneName;                                       		// 0x000024 (0x0008)              
	int                                                m_RefCount;                                       		// 0x00002C (0x0004)              
};
//0x000044
//ImpactInfo[0x17C63330]
struct FImpactInfo
{
	class AActor*                                      HitActor;                                         		// 0x000000 (0x0004)              
	FVector3                                           HitLocation;                                      		// 0x000004 (0x000C)              
	FVector3                                           HitNormal;                                        		// 0x000010 (0x000C)              
	FVector3                                           RayDir;                                           		// 0x00001C (0x000C)              
	struct FTraceHitInfo                               HitInfo;                                          		// 0x000028 (0x001C)              
};
//0x000028
//tLocationInfo[0x17C632C8]
struct FtLocationInfo
{
	FVector3                                           Position;                                         		// 0x000000 (0x000C)              
	unsigned char                                      _0x00000C[0x4];                                   		// 0x00000C (0x0004) MISSED OFFSET
	struct FQuat                                       Orientation;                                      		// 0x000010 (0x0010)              
	double                                             LastUpdateTime;                                   		// 0x000020 (0x0008)              
};
//0x000014
//AnimSlotInfo[0x17C63260]
struct FAnimSlotInfo
{
	struct FName                                       SlotName;                                         		// 0x000000 (0x0008)              
	TArray<float>                                      ChannelWeights;                                   		// 0x000008 (0x000C)              
};
//0x00000C
//AnimSlotDesc[0x17C631F8]
struct FAnimSlotDesc
{
	struct FName                                       SlotName;                                         		// 0x000000 (0x0008)              
	int                                                NumChannels;                                      		// 0x000008 (0x0004)              
};
//0x000040
//RigidBodyState[0x17C63190]
struct FRigidBodyState
{
	FVector3                                           Position;                                         		// 0x000000 (0x000C)              
	unsigned char                                      _0x00000C[0x4];                                   		// 0x00000C (0x0004) MISSED OFFSET
	struct FQuat                                       Quaternion;                                       		// 0x000010 (0x0010)              
	FVector3                                           LinVel;                                           		// 0x000020 (0x000C)              
	FVector3                                           AngVel;                                           		// 0x00002C (0x000C)              
	unsigned char                                      bNewData;                                         		// 0x000038 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000039[0x3];                                   		// 0x000039 (0x0003) MISSED OFFSET
	unsigned long                                      bSleeping : 1;                                    		// 0x00003C (0x0004) [0x00000001] 
	unsigned long                                      bForceState : 1;                                  		// 0x00003C (0x0004) [0x00000002] 
};
//0x000014
//RigidBodyUnpackParams[0x17C63128]
struct FRigidBodyUnpackParams
{
	float                                              fDT;                                              		// 0x000000 (0x0004)              
	float                                              fAbsorbDelay;                                     		// 0x000004 (0x0004)              
	float                                              fMaxAbsorbRate_Position;                          		// 0x000008 (0x0004)              
	float                                              fMaxAbsorbRate_Angle;                             		// 0x00000C (0x0004)              
	unsigned long                                      bIsOverLimit : 1;                                 		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      bAllowLimitSnap : 1;                              		// 0x000010 (0x0004) [0x00000002] 
};
//0x00003C
//RigidBodyContactInfo[0x17C630C0]
struct FRigidBodyContactInfo
{
	FVector3                                           ContactPosition;                                  		// 0x000000 (0x000C)              
	FVector3                                           ContactNormal;                                    		// 0x00000C (0x000C)              
	float                                              ContactPenetration;                               		// 0x000018 (0x0004)              
	FVector3                                           ContactVelocity[0x2];                             		// 0x00001C (0x0018)              
	class UPhysicalMaterial*                           PhysMaterial[0x2];                                		// 0x000034 (0x0008)              
};
//0x000024
//CollisionImpactData[0x17C63058]
struct FCollisionImpactData
{
	TArray<struct FRigidBodyContactInfo>               ContactInfos;                                     		// 0x000000 (0x000C)              
	FVector3                                           TotalNormalForceVector;                           		// 0x00000C (0x000C)              
	FVector3                                           TotalFrictionForceVector;                         		// 0x000018 (0x000C)              
};
//0x00000C
//AsyncLineCheckResult[0x17C62FF0]
struct FAsyncLineCheckResult
{
	int                                                bCheckStarted;                                    		// 0x000000 (0x0004)              
	int                                                bCheckCompleted;                                  		// 0x000004 (0x0004)              
	int                                                bHit;                                             		// 0x000008 (0x0004)              
};
//0x000028
//ReplicatedHitImpulse[0x17C62F88]
struct FReplicatedHitImpulse
{
	FVector3                                           AppliedImpulse;                                   		// 0x000000 (0x000C)              
	FVector3                                           HitLocation;                                      		// 0x00000C (0x000C)              
	struct FName                                       BoneName;                                         		// 0x000018 (0x0008)              
	unsigned char                                      ImpulseCount;                                     		// 0x000020 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000021[0x3];                                   		// 0x000021 (0x0003) MISSED OFFSET
	unsigned long                                      bRadialImpulse : 1;                               		// 0x000024 (0x0004) [0x00000001] 
};
//0x000014
//NavReference[0x17C62F20]
struct FNavReference
{
	class ANavigationPoint*                            Nav;                                              		// 0x000000 (0x0004)              
	struct FGuid                                       Guid;                                             		// 0x000004 (0x0010)              
};
//0x000010
//GeomSelection[0x17C62EB8]
struct FGeomSelection
{
	int                                                Type;                                             		// 0x000000 (0x0004)              
	int                                                Index;                                            		// 0x000004 (0x0004)              
	int                                                SelectionIndex;                                   		// 0x000008 (0x0004)              
	float                                              SelStrength;                                      		// 0x00000C (0x0004)              
};
//0x000008
//CullDistanceSizePair[0x17C62E50]
struct FCullDistanceSizePair
{
	float                                              Size;                                             		// 0x000000 (0x0004)              
	float                                              CullDistance;                                     		// 0x000004 (0x0004)              
};
//0x000048
//FoliageMesh[0x17C62DE8]
struct FFoliageMesh
{
	class UStaticMesh*                                 InstanceStaticMesh;                               		// 0x000000 (0x0004)              
	class UMaterialInterface*                          Material;                                         		// 0x000004 (0x0004)              
	float                                              MaxDrawRadius;                                    		// 0x000008 (0x0004)              
	float                                              MinTransitionRadius;                              		// 0x00000C (0x0004)              
	float                                              MinThinningRadius;                                		// 0x000010 (0x0004)              
	FVector3                                           MinScale;                                         		// 0x000014 (0x000C)              
	FVector3                                           MaxScale;                                         		// 0x000020 (0x000C)              
	float                                              MinUniformScale;                                  		// 0x00002C (0x0004)              
	float                                              MaxUniformScale;                                  		// 0x000030 (0x0004)              
	float                                              SwayScale;                                        		// 0x000034 (0x0004)              
	int                                                Seed;                                             		// 0x000038 (0x0004)              
	float                                              SurfaceAreaPerInstance;                           		// 0x00003C (0x0004)              
	unsigned long                                      bCreateInstancesOnBSP : 1;                        		// 0x000040 (0x0004) [0x00000001] 
	unsigned long                                      bCreateInstancesOnStaticMeshes : 1;               		// 0x000040 (0x0004) [0x00000002] 
	unsigned long                                      bCreateInstancesOnTerrain : 1;                    		// 0x000040 (0x0004) [0x00000004] 
	class UFoliageComponent*                           Component;                                        		// 0x000044 (0x0004)              
};
//0x000010
//AudioComponentParam[0x17C62D80]
struct FAudioComponentParam
{
	struct FName                                       ParamName;                                        		// 0x000000 (0x0008)              
	float                                              FloatParam;                                       		// 0x000008 (0x0004)              
	class USoundNodeWave*                              WaveParam;                                        		// 0x00000C (0x0004)              
};
//0x000004
//LightingChannelContainer[0x17C62D18]
struct FLightingChannelContainer
{
	unsigned long                                      bInitialized : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      BSP : 1;                                          		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      Static : 1;                                       		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      Dynamic : 1;                                      		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      CompositeDynamic : 1;                             		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      Skybox : 1;                                       		// 0x000000 (0x0004) [0x00000020] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000040] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000080] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000100] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000200] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000400] 
	unsigned long                                      Unnamed : 1;                                      		// 0x000000 (0x0004) [0x00000800] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00001000] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00002000] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00004000] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00008000] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00010000] 
	unsigned long                                      Cinematic : 1;                                    		// 0x000000 (0x0004) [0x00020000] 
	unsigned long                                      Gameplay : 1;                                     		// 0x000000 (0x0004) [0x00040000] 
	unsigned long                                      Gameplay : 1;                                     		// 0x000000 (0x0004) [0x00080000] 
	unsigned long                                      Gameplay : 1;                                     		// 0x000000 (0x0004) [0x00100000] 
	unsigned long                                      Gameplay : 1;                                     		// 0x000000 (0x0004) [0x00200000] 
};
//0x000004
//MaterialViewRelevance[0x17C62CB0]
struct FMaterialViewRelevance
{
	unsigned long                                      bOpaque : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bTranslucent : 1;                                 		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bDistortion : 1;                                  		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      bLit : 1;                                         		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      bUsesSceneColor : 1;                              		// 0x000000 (0x0004) [0x00000010] 
};
//0x000004
//RBCollisionChannelContainer[0x17C62C48]
struct FRBCollisionChannelContainer
{
	unsigned long                                      Default : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      Nothing : 1;                                      		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      Pawn : 1;                                         		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      Vehicle : 1;                                      		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      Water : 1;                                        		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      GameplayPhysics : 1;                              		// 0x000000 (0x0004) [0x00000020] 
	unsigned long                                      EffectPhysics : 1;                                		// 0x000000 (0x0004) [0x00000040] 
	unsigned long                                      Untitled1 : 1;                                    		// 0x000000 (0x0004) [0x00000080] 
	unsigned long                                      Untitled2 : 1;                                    		// 0x000000 (0x0004) [0x00000100] 
	unsigned long                                      Untitled3 : 1;                                    		// 0x000000 (0x0004) [0x00000200] 
	unsigned long                                      Untitled4 : 1;                                    		// 0x000000 (0x0004) [0x00000400] 
	unsigned long                                      Cloth : 1;                                        		// 0x000000 (0x0004) [0x00000800] 
	unsigned long                                      FluidDrain : 1;                                   		// 0x000000 (0x0004) [0x00001000] 
	unsigned long                                      SoftBody : 1;                                     		// 0x000000 (0x0004) [0x00002000] 
};
//0x000048
//KSphereElem[0x17C62BE0]
struct FKSphereElem
{
	FMatrix                                            TM;                                               		// 0x000000 (0x0040)              
	float                                              Radius;                                           		// 0x000040 (0x0004)              
	unsigned long                                      bNoRBCollision : 1;                               		// 0x000044 (0x0004) [0x00000001] 
	unsigned long                                      bPerPolyShape : 1;                                		// 0x000044 (0x0004) [0x00000002] 
};
//0x000050
//KBoxElem[0x17C62B78]
struct FKBoxElem
{
	FMatrix                                            TM;                                               		// 0x000000 (0x0040)              
	float                                              X;                                                		// 0x000040 (0x0004)              
	float                                              Y;                                                		// 0x000044 (0x0004)              
	float                                              Z;                                                		// 0x000048 (0x0004)              
	unsigned long                                      bNoRBCollision : 1;                               		// 0x00004C (0x0004) [0x00000001] 
	unsigned long                                      bPerPolyShape : 1;                                		// 0x00004C (0x0004) [0x00000002] 
};
//0x00004C
//KSphylElem[0x17C62B10]
struct FKSphylElem
{
	FMatrix                                            TM;                                               		// 0x000000 (0x0040)              
	float                                              Radius;                                           		// 0x000040 (0x0004)              
	float                                              Length;                                           		// 0x000044 (0x0004)              
	unsigned long                                      bNoRBCollision : 1;                               		// 0x000048 (0x0004) [0x00000001] 
	unsigned long                                      bPerPolyShape : 1;                                		// 0x000048 (0x0004) [0x00000002] 
};
//0x000064
//KConvexElem[0x17C62AA8]
struct FKConvexElem
{
	TArray<FVector3>                                   VertexData;                                       		// 0x000000 (0x000C)              
	TArray<struct FPlane>                              PermutedVertexData;                               		// 0x00000C (0x000C)              
	TArray<int>                                        FaceTriData;                                      		// 0x000018 (0x000C)              
	TArray<FVector3>                                   EdgeDirections;                                   		// 0x000024 (0x000C)              
	TArray<FVector3>                                   FaceNormalDirections;                             		// 0x000030 (0x000C)              
	TArray<struct FPlane>                              FacePlaneData;                                    		// 0x00003C (0x000C)              
	struct FBox                                        ElemBox;                                          		// 0x000048 (0x001C)              
};
//0x000034
//KAggregateGeom[0x17C62A40]
struct FKAggregateGeom
{
	TArray<struct FKSphereElem>                        SphereElems;                                      		// 0x000000 (0x000C)              
	TArray<struct FKBoxElem>                           BoxElems;                                         		// 0x00000C (0x000C)              
	TArray<struct FKSphylElem>                         SphylElems;                                       		// 0x000018 (0x000C)              
	TArray<struct FKConvexElem>                        ConvexElems;                                      		// 0x000024 (0x000C)              
	DWORD                                              RenderInfo;                                       		// 0x000030 (0x0004)              
};
//0x00000C
//KCachedConvexDataElement[0x17C629D8]
struct FKCachedConvexDataElement
{
	TArray<unsigned char>                              ConvexElementData;                                		// 0x000000 (0x000C)              
};
//0x00000C
//KCachedConvexData[0x17C62970]
struct FKCachedConvexData
{
	TArray<struct FKCachedConvexDataElement>           CachedConvexElements;                             		// 0x000000 (0x000C)              
};
//0x00000C
//KCachedConvexData_Mirror[0x17C62908]
struct FKCachedConvexData_Mirror
{
	TArray<int>                                        CachedConvexElements;                             		// 0x000000 (0x000C)              
};
//0x000014
//DecalReceiver[0x17C628A0]
struct FDecalReceiver
{
	DWORD                                              RenderData;                                       		// 0x000000 (0x0004)              
	struct FString                                     m_sComponentName;                                 		// 0x000004 (0x000C)              
	int                                                m_ComponentNameCRC;                               		// 0x000010 (0x0004)              
};
//0x000004
//LightMapRef[0x17C62838]
struct FLightMapRef
{
	DWORD                                              Reference;                                        		// 0x000000 (0x0004)              
};
//0x000020
//FoliageInstanceBase[0x17C627D0]
struct FFoliageInstanceBase
{
	FVector3                                           Location;                                         		// 0x000000 (0x000C)              
	float                                              DistanceFactorSquared;                            		// 0x00000C (0x0004)              
	int                                                AOAndShadowMap;                                   		// 0x000010 (0x0004)              
	int                                                XAxis;                                            		// 0x000014 (0x0004)              
	int                                                YAxis;                                            		// 0x000018 (0x0004)              
	int                                                ZAxis;                                            		// 0x00001C (0x0004)              
};
//0x000010 (0x000030 - 0x000020)
//GatheredFoliageInstance[0x17C62768]
struct FGatheredFoliageInstance : FFoliageInstanceBase
{
	DWORD                                              StaticLighting[0x4];                              		// 0x000020 (0x0010)              
};
//0x000010
//LensFlareElementCurvePair[0x17C62700]
struct FLensFlareElementCurvePair
{
	struct FString                                     CurveName;                                        		// 0x000000 (0x000C)              
	class UObject*                                     CurveObject;                                      		// 0x00000C (0x0004)              
};
//0x000140
//LensFlareElement[0x17C62698]
struct FLensFlareElement
{
	struct FName                                       ElementName;                                      		// 0x000000 (0x0008)              
	float                                              RayDistance;                                      		// 0x000008 (0x0004)              
	unsigned long                                      bIsEnabled : 1;                                   		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      bUseSourceDistance : 1;                           		// 0x00000C (0x0004) [0x00000002] 
	unsigned long                                      bNormalizeRadialDistance : 1;                     		// 0x00000C (0x0004) [0x00000004] 
	unsigned long                                      bModulateColorBySource : 1;                       		// 0x00000C (0x0004) [0x00000008] 
	FVector3                                           Size;                                             		// 0x000010 (0x000C)              
	TArray<class UMaterialInterface*>                  LFMaterials;                                      		// 0x00001C (0x000C)              
	struct FRawDistributionFloat                       LFMaterialIndex;                                  		// 0x000028 (0x001C)              
	struct FRawDistributionFloat                       Scaling;                                          		// 0x000044 (0x001C)              
	struct FRawDistributionVector                      AxisScaling;                                      		// 0x000060 (0x001C)              
	struct FRawDistributionFloat                       Rotation;                                         		// 0x00007C (0x001C)              
	struct FRawDistributionVector                      Color;                                            		// 0x000098 (0x001C)              
	struct FRawDistributionFloat                       Alpha;                                            		// 0x0000B4 (0x001C)              
	struct FRawDistributionVector                      Offset;                                           		// 0x0000D0 (0x001C)              
	struct FRawDistributionVector                      DistMap_Scale;                                    		// 0x0000EC (0x001C)              
	struct FRawDistributionVector                      DistMap_Color;                                    		// 0x000108 (0x001C)              
	struct FRawDistributionFloat                       DistMap_Alpha;                                    		// 0x000124 (0x001C)              
};
//0x000000
//LensFlareElementInstance[0x17C62630]
struct FLensFlareElementInstance
{
};
//0x000008
//ActiveMorph[0x17C625C8]
struct FActiveMorph
{
	class UMorphTarget*                                Target;                                           		// 0x000000 (0x0004)              
	float                                              Weight;                                           		// 0x000004 (0x0004)              
};
//0x000030
//Attachment[0x17C62560]
struct FAttachment
{
	class UActorComponent*                             Component;                                        		// 0x000000 (0x0004)              
	struct FName                                       BoneName;                                         		// 0x000004 (0x0008)              
	FVector3                                           RelativeLocation;                                 		// 0x00000C (0x000C)              
	FRotator                                           RelativeRotation;                                 		// 0x000018 (0x000C)              
	FVector3                                           RelativeScale;                                    		// 0x000024 (0x000C)              
};
//0x000010
//BonePair[0x17C624F8]
struct FBonePair
{
	struct FName                                       Bones[0x2];                                       		// 0x000000 (0x0010)              
};
//0x000024
//StaticMeshComponentLODInfo[0x17C62490]
struct FStaticMeshComponentLODInfo
{
	TArray<class UShadowMap2D*>                        ShadowMaps;                                       		// 0x000000 (0x000C)              
	TArray<class UObject*>                             ShadowVertexBuffers;                              		// 0x00000C (0x000C)              
	DWORD                                              LightMap;                                         		// 0x000018 (0x0004)              
	class UShadowMap2D*                                m_AOMap2D;                                        		// 0x00001C (0x0004)              
	class UObject*                                     m_AOMap1D;                                        		// 0x000020 (0x0004)              
};
//0x00000C
//MaterialArray[0x17C62428]
struct FMaterialArray
{
	TArray<class UMaterialInterface*>                  A;                                                		// 0x000000 (0x000C)              
};
//0x000028
//CoverMeshes[0x17C623C0]
struct FCoverMeshes
{
	class UStaticMesh*                                 Base;                                             		// 0x000000 (0x0004)              
	class UStaticMesh*                                 LeanLeft;                                         		// 0x000004 (0x0004)              
	class UStaticMesh*                                 LeanRight;                                        		// 0x000008 (0x0004)              
	class UStaticMesh*                                 Climb;                                            		// 0x00000C (0x0004)              
	class UStaticMesh*                                 Mantle;                                           		// 0x000010 (0x0004)              
	class UStaticMesh*                                 SlipLeft;                                         		// 0x000014 (0x0004)              
	class UStaticMesh*                                 SlipRight;                                        		// 0x000018 (0x0004)              
	class UStaticMesh*                                 SwatLeft;                                         		// 0x00001C (0x0004)              
	class UStaticMesh*                                 SwatRight;                                        		// 0x000020 (0x0004)              
	class UStaticMesh*                                 PopUp;                                            		// 0x000024 (0x0004)              
};
//0x000000
//ParticleEmitterInstance[0x17C62358]
struct FParticleEmitterInstance
{
};
//0x000028
//ParticleSysParam[0x17C622F0]
struct FParticleSysParam
{
	struct FName                                       Name;                                             		// 0x000000 (0x0008)              
	unsigned char                                      ParamType;                                        		// 0x000008 (0x0001)              PROPERTY: EParticleSysParamType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	float                                              Scalar;                                           		// 0x00000C (0x0004)              
	FVector3                                           Vector;                                           		// 0x000010 (0x000C)              
	DWORD                                              Color;                                            		// 0x00001C (0x0004)              
	class AActor*                                      Actor;                                            		// 0x000020 (0x0004)              
	class UMaterialInterface*                          Material;                                         		// 0x000024 (0x0004)              
};
//0x000034
//ParticleEventData[0x17C62288]
struct FParticleEventData
{
	int                                                Type;                                             		// 0x000000 (0x0004)              
	struct FName                                       EventName;                                        		// 0x000004 (0x0008)              
	float                                              EmitterTime;                                      		// 0x00000C (0x0004)              
	FVector3                                           Location;                                         		// 0x000010 (0x000C)              
	FVector3                                           Direction;                                        		// 0x00001C (0x000C)              
	FVector3                                           Velocity;                                         		// 0x000028 (0x000C)              
};
//0x000000 (0x000034 - 0x000034)
//ParticleEventSpawnData[0x17C62220]
struct FParticleEventSpawnData : FParticleEventData
{
};
//0x000004 (0x000038 - 0x000034)
//ParticleEventDeathData[0x17C621B8]
struct FParticleEventDeathData : FParticleEventData
{
	float                                              ParticleTime;                                     		// 0x000034 (0x0004)              
};
//0x000020 (0x000054 - 0x000034)
//ParticleEventCollideData[0x17C62150]
struct FParticleEventCollideData : FParticleEventData
{
	float                                              ParticleTime;                                     		// 0x000034 (0x0004)              
	FVector3                                           Normal;                                           		// 0x000038 (0x000C)              
	float                                              Time;                                             		// 0x000044 (0x0004)              
	int                                                Item;                                             		// 0x000048 (0x0004)              
	struct FName                                       BoneName;                                         		// 0x00004C (0x0008)              
};
//0x000010 (0x000044 - 0x000034)
//ParticleEventKismetData[0x17C620E8]
struct FParticleEventKismetData : FParticleEventData
{
	unsigned long                                      UsePSysCompLocation : 1;                          		// 0x000034 (0x0004) [0x00000001] 
	FVector3                                           Normal;                                           		// 0x000038 (0x000C)              
};
//0x000020
//SpeedTreeStaticLight[0x17C62080]
struct FSpeedTreeStaticLight
{
	struct FGuid                                       Guid;                                             		// 0x000000 (0x0010)              
	class UShadowMap1D*                                BranchAndFrondShadowMap;                          		// 0x000010 (0x0004)              
	class UShadowMap1D*                                LeafMeshShadowMap;                                		// 0x000014 (0x0004)              
	class UShadowMap1D*                                LeafCardShadowMap;                                		// 0x000018 (0x0004)              
	class UShadowMap1D*                                BillboardShadowMap;                               		// 0x00001C (0x0004)              
};
//0x000004
//LightMapRef[0x17C62018]
struct FLightMapRef
{
	DWORD                                              Reference;                                        		// 0x000000 (0x0004)              
};
//0x000018
//TerrainkDOPTree[0x17C61FB0]
struct FTerrainkDOPTree
{
	TArray<int>                                        Nodes;                                            		// 0x000000 (0x000C)              
	TArray<int>                                        Triangles;                                        		// 0x00000C (0x000C)              
};
//0x00000C
//TerrainBVTree[0x17C61F48]
struct FTerrainBVTree
{
	TArray<int>                                        Nodes;                                            		// 0x000000 (0x000C)              
};
//0x000004
//RBCollisionChannelContainer[0x17C61EE0]
struct FRBCollisionChannelContainer
{
	unsigned long                                      Default : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      Nothing : 1;                                      		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      Pawn : 1;                                         		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      Vehicle : 1;                                      		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      Water : 1;                                        		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      GameplayPhysics : 1;                              		// 0x000000 (0x0004) [0x00000020] 
	unsigned long                                      EffectPhysics : 1;                                		// 0x000000 (0x0004) [0x00000040] 
	unsigned long                                      Untitled1 : 1;                                    		// 0x000000 (0x0004) [0x00000080] 
	unsigned long                                      Untitled2 : 1;                                    		// 0x000000 (0x0004) [0x00000100] 
	unsigned long                                      Untitled3 : 1;                                    		// 0x000000 (0x0004) [0x00000200] 
	unsigned long                                      Untitled4 : 1;                                    		// 0x000000 (0x0004) [0x00000400] 
	unsigned long                                      FluidDrain : 1;                                   		// 0x000000 (0x0004) [0x00000800] 
	unsigned long                                      Cloth : 1;                                        		// 0x000000 (0x0004) [0x00001000] 
	unsigned long                                      SoftBody : 1;                                     		// 0x000000 (0x0004) [0x00002000] 
};
//0x00000C
//BloomParameters[0x17C61E78]
struct FBloomParameters
{
	float                                              BloomScale;                                       		// 0x000000 (0x0004)              
	float                                              BloomThreshold;                                   		// 0x000004 (0x0004)              
	float                                              BloomBlurKernelSize;                              		// 0x000008 (0x0004)              
};
//0x000020
//DOFParameters[0x17C61E10]
struct FDOFParameters
{
	float                                              ForegroundStartDistance;                          		// 0x000000 (0x0004)              
	float                                              ForegroundEndDistance;                            		// 0x000004 (0x0004)              
	float                                              BackgroundStartDistance;                          		// 0x000008 (0x0004)              
	float                                              BackgroundEndDistance;                            		// 0x00000C (0x0004)              
	float                                              MaxBlurForeground;                                		// 0x000010 (0x0004)              
	float                                              MaxBlurBackground;                                		// 0x000014 (0x0004)              
	float                                              BlurKernelSize;                                   		// 0x000018 (0x0004)              
	int                                                CircleOfConfusionDilation;                        		// 0x00001C (0x0004)              
};
//0x000014
//MotionBlurParameters[0x17C61DA8]
struct FMotionBlurParameters
{
	float                                              MaxVelocity;                                      		// 0x000000 (0x0004)              
	float                                              Amount;                                           		// 0x000004 (0x0004)              
	unsigned long                                      FullMotionBlur : 1;                               		// 0x000008 (0x0004) [0x00000001] 
	float                                              CameraRotationThreshold;                          		// 0x00000C (0x0004)              
	float                                              CameraTranslationThreshold;                       		// 0x000010 (0x0004)              
};
//0x00001C
//ToneMappingParameters[0x17C61D40]
struct FToneMappingParameters
{
	unsigned long                                      bIrisResponse : 1;                                		// 0x000000 (0x0004) [0x00000001] 
	float                                              MiddleGrey;                                       		// 0x000004 (0x0004)              
	float                                              Lwhite;                                           		// 0x000008 (0x0004)              
	float                                              AdaptionRate;                                     		// 0x00000C (0x0004)              
	float                                              AdaptionSlope;                                    		// 0x000010 (0x0004)              
	float                                              MinAdaptationIn;                                  		// 0x000014 (0x0004)              
	float                                              MaxAdaptationIn;                                  		// 0x000018 (0x0004)              
};
//0x00002C
//ColourAdjustParameters[0x17C61CD8]
struct FColourAdjustParameters
{
	float                                              Brightness;                                       		// 0x000000 (0x0004)              
	float                                              Contrast;                                         		// 0x000004 (0x0004)              
	float                                              Gamma;                                            		// 0x000008 (0x0004)              
	float                                              Saturation;                                       		// 0x00000C (0x0004)              
	FVector3                                           PerChannelPower;                                  		// 0x000010 (0x000C)              
	struct FLinearColor                                DesaturatedColour;                                		// 0x00001C (0x0010)              
};
//0x000018
//LUTBlender[0x17C61C70]
struct FLUTBlender
{
	TArray<class UTexture*>                            LUTTextures;                                      		// 0x000000 (0x000C)              
	TArray<float>                                      LUTWeights;                                       		// 0x00000C (0x000C)              
};
//0x0000CC
//PostProcessSettings[0x17C61C08]
struct FPostProcessSettings
{
	unsigned long                                      bEnableBloom : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bEnableDOF : 1;                                   		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bEnableMotionBlur : 1;                            		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      bEnableSceneEffect : 1;                           		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      bEnableAO : 1;                                    		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      Bloom_Override : 1;                               		// 0x000000 (0x0004) [0x00000020] 
	struct FBloomParameters                            BloomParameters;                                  		// 0x000004 (0x000C)              
	float                                              Bloom_InterpolationDuration;                      		// 0x000010 (0x0004)              
	unsigned long                                      DOF_Override : 1;                                 		// 0x000014 (0x0004) [0x00000001] 
	struct FDOFParameters                              DOFParameters;                                    		// 0x000018 (0x0020)              
	float                                              DOF_InterpolationDuration;                        		// 0x000038 (0x0004)              
	unsigned long                                      MotionBlur_Override : 1;                          		// 0x00003C (0x0004) [0x00000001] 
	struct FMotionBlurParameters                       MotionBlurParameters;                             		// 0x000040 (0x0014)              
	float                                              MotionBlur_InterpolationDuration;                 		// 0x000054 (0x0004)              
	unsigned long                                      ToneMapping_Override : 1;                         		// 0x000058 (0x0004) [0x00000001] 
	struct FToneMappingParameters                      ToneMappingParameters;                            		// 0x00005C (0x001C)              
	float                                              ToneMapping_InterpolationDuration;                		// 0x000078 (0x0004)              
	unsigned long                                      ColourAdjust_Override : 1;                        		// 0x00007C (0x0004) [0x00000001] 
	struct FColourAdjustParameters                     ColourAdjustParameters;                           		// 0x000080 (0x002C)              
	float                                              ColourAdjust_InterpolationDuration;               		// 0x0000AC (0x0004)              
	class UTexture*                                    ColorGrading_LookupTable;                         		// 0x0000B0 (0x0004)              
	struct FLUTBlender                                 ColorGradingLUT;                                  		// 0x0000B4 (0x0018)              
};
//0x00000C
//ReverbSettings[0x17C61BA0]
struct FReverbSettings
{
	unsigned char                                      ReverbType;                                       		// 0x000000 (0x0001)              PROPERTY: ReverbPreset
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              Volume;                                           		// 0x000004 (0x0004)              
	float                                              FadeTime;                                         		// 0x000008 (0x0004)              
};
//0x000018
//StProxiesManagerParams[0x17C61B38]
struct FStProxiesManagerParams
{
	unsigned char                                      eServerBehaviour;                                 		// 0x000000 (0x0001)              PROPERTY: EProxyBehaviour
	unsigned char                                      eClientBehaviour;                                 		// 0x000001 (0x0001)              PROPERTY: EProxyBehaviour
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	unsigned long                                      bShowDebugActors : 1;                             		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bUseLimbo : 1;                                    		// 0x000004 (0x0004) [0x00000002] 
	float                                              fViewRadius;                                      		// 0x000008 (0x0004)              
	float                                              fViewRadiusHysteresisCoef;                        		// 0x00000C (0x0004)              
	float                                              fFrameTimeLimit;                                  		// 0x000010 (0x0004)              
	float                                              fWaitServerReplicationTime;                       		// 0x000014 (0x0004)              
};
//0x000024
//TCameraCache[0x17C61AD0]
struct FTCameraCache
{
	double                                             TimeStamp;                                        		// 0x000000 (0x0008)              
	struct FTPOV                                       POV;                                              		// 0x000008 (0x001C)              
};
//0x00002C
//TViewTarget[0x17C61A68]
struct FTViewTarget
{
	class AActor*                                      Target;                                           		// 0x000000 (0x0004)              
	class AController*                                 Controller;                                       		// 0x000004 (0x0004)              
	struct FTPOV                                       POV;                                              		// 0x000008 (0x001C)              
	float                                              AspectRatio;                                      		// 0x000024 (0x0004)              
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000028 (0x0004)              
};
//0x00000C
//ViewTargetTransitionParams[0x17C61A00]
struct FViewTargetTransitionParams
{
	float                                              BlendTime;                                        		// 0x000000 (0x0004)              
	unsigned char                                      BlendFunction;                                    		// 0x000004 (0x0001)              PROPERTY: EViewTargetBlendFunction
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	float                                              BlendExp;                                         		// 0x000008 (0x0004)              
};
//0x000008
//VisiblePortalInfo[0x17C61998]
struct FVisiblePortalInfo
{
	class AActor*                                      Source;                                           		// 0x000000 (0x0004)              
	class AActor*                                      Destination;                                      		// 0x000004 (0x0004)              
};
//0x000014
//MusicTrackParamStruct[0x17C61930]
struct FMusicTrackParamStruct
{
	float                                              FadeInTime;                                       		// 0x000000 (0x0004)              
	float                                              FadeInVolumeLevel;                                		// 0x000004 (0x0004)              
	float                                              DelayBetweenOldAndNewTrack;                       		// 0x000008 (0x0004)              
	float                                              FadeOutTime;                                      		// 0x00000C (0x0004)              
	float                                              FadeOutVolumeLevel;                               		// 0x000010 (0x0004)              
};
//0x000024
//MusicTrackStruct[0x17C618C8]
struct FMusicTrackStruct
{
	struct FMusicTrackParamStruct                      Params;                                           		// 0x000000 (0x0014)              
	struct FName                                       TrackType;                                        		// 0x000014 (0x0008)              
	class USoundCue*                                   TheSoundCue;                                      		// 0x00001C (0x0004)              
	unsigned long                                      bAutoPlay : 1;                                    		// 0x000020 (0x0004) [0x00000001] 
};
//0x000009
//LocalizedStringSetting[0x17C61860]
struct FLocalizedStringSetting
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	int                                                ValueIndex;                                       		// 0x000004 (0x0004)              
	unsigned char                                      AdvertisementType;                                		// 0x000008 (0x0001)              PROPERTY: EOnlineDataAdvertisementType
};
//0x00000C
//SettingsData[0x17C617F8]
struct FSettingsData
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: ESettingsDataType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	int                                                Value1;                                           		// 0x000004 (0x0004)              
	DWORD                                              Value2;                                           		// 0x000008 (0x0004)              
};
//0x000011
//SettingsProperty[0x17C61790]
struct FSettingsProperty
{
	int                                                PropertyId;                                       		// 0x000000 (0x0004)              
	struct FSettingsData                               Data;                                             		// 0x000004 (0x000C)              
	unsigned char                                      AdvertisementType;                                		// 0x000010 (0x0001)              PROPERTY: EOnlineDataAdvertisementType
};
//0x000010
//StringIdToStringMapping[0x17C61728]
struct FStringIdToStringMapping
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FName                                       Name;                                             		// 0x000004 (0x0008)              
	unsigned long                                      bIsWildcard : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
};
//0x000024
//LocalizedStringSettingMetaData[0x17C616C0]
struct FLocalizedStringSettingMetaData
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FName                                       Name;                                             		// 0x000004 (0x0008)              
	struct FString                                     ColumnHeaderText;                                 		// 0x00000C (0x000C)              
	TArray<struct FStringIdToStringMapping>            ValueMappings;                                    		// 0x000018 (0x000C)              
};
//0x00000C
//IdToStringMapping[0x17C61658]
struct FIdToStringMapping
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FName                                       Name;                                             		// 0x000004 (0x0008)              
};
//0x000040
//SettingsPropertyPropertyMetaData[0x17C615F0]
struct FSettingsPropertyPropertyMetaData
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FName                                       Name;                                             		// 0x000004 (0x0008)              
	struct FString                                     ColumnHeaderText;                                 		// 0x00000C (0x000C)              
	unsigned char                                      MappingType;                                      		// 0x000018 (0x0001)              PROPERTY: EPropertyValueMappingType
	unsigned char                                      _0x000019[0x3];                                   		// 0x000019 (0x0003) MISSED OFFSET
	TArray<struct FIdToStringMapping>                  ValueMappings;                                    		// 0x00001C (0x000C)              
	TArray<struct FSettingsData>                       PredefinedValues;                                 		// 0x000028 (0x000C)              
	float                                              MinVal;                                           		// 0x000034 (0x0004)              
	float                                              MaxVal;                                           		// 0x000038 (0x0004)              
	float                                              RangeIncrement;                                   		// 0x00003C (0x0004)              
};
//0x000008
//UniqueNetId[0x17C61588]
struct FUniqueNetId
{
	struct FQWord                                      Uid;                                              		// 0x000000 (0x0008)              
};
//0x000010
//BaseAuthSession[0x17C61520]
struct FBaseAuthSession
{
	int                                                EndPointIP;                                       		// 0x000000 (0x0004)              
	int                                                EndPointPort;                                     		// 0x000004 (0x0004)              
	struct FUniqueNetId                                EndPointUID;                                      		// 0x000008 (0x0008)              
};
//0x000004 (0x000014 - 0x000010)
//LocalAuthSession[0x17C614B8]
struct FLocalAuthSession : FBaseAuthSession
{
	int                                                SessionUID;                                       		// 0x000010 (0x0004)              
};
//0x000008 (0x000018 - 0x000010)
//AuthSession[0x17C61450]
struct FAuthSession : FBaseAuthSession
{
	unsigned char                                      AuthStatus;                                       		// 0x000010 (0x0001)              PROPERTY: EAuthStatus
	unsigned char                                      _0x000011[0x3];                                   		// 0x000011 (0x0003) MISSED OFFSET
	int                                                AuthTicketUID;                                    		// 0x000014 (0x0004)              
};
//0x00000C
//FriendsQuery[0x17C613E8]
struct FFriendsQuery
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x000000 (0x0008)              
	unsigned long                                      bIsFriend : 1;                                    		// 0x000008 (0x0004) [0x00000001] 
};
//0x000030
//OnlineFriend[0x17C61380]
struct FOnlineFriend
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x000000 (0x0008)              
	struct FQWord                                      SessionId;                                        		// 0x000008 (0x0008)              
	struct FString                                     NickName;                                         		// 0x000010 (0x000C)              
	struct FString                                     PresenceInfo;                                     		// 0x00001C (0x000C)              
	unsigned char                                      FriendState;                                      		// 0x000028 (0x0001)              PROPERTY: EOnlineFriendState
	unsigned char                                      _0x000029[0x3];                                   		// 0x000029 (0x0003) MISSED OFFSET
	unsigned long                                      bIsOnline : 1;                                    		// 0x00002C (0x0004) [0x00000001] 
	unsigned long                                      bIsPlaying : 1;                                   		// 0x00002C (0x0004) [0x00000002] 
	unsigned long                                      bIsPlayingThisGame : 1;                           		// 0x00002C (0x0004) [0x00000004] 
	unsigned long                                      bIsJoinable : 1;                                  		// 0x00002C (0x0004) [0x00000008] 
	unsigned long                                      bHasVoiceSupport : 1;                             		// 0x00002C (0x0004) [0x00000010] 
	unsigned long                                      bHaveInvited : 1;                                 		// 0x00002C (0x0004) [0x00000020] 
	unsigned long                                      bHasInvitedYou : 1;                               		// 0x00002C (0x0004) [0x00000040] 
};
//0x00004C
//OnlineContent[0x17C61318]
struct FOnlineContent
{
	unsigned char                                      ContentType;                                      		// 0x000000 (0x0001)              PROPERTY: EOnlineContentType
	unsigned char                                      UserIndex;                                        		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	unsigned long                                      bIsCorrupt : 1;                                   		// 0x000004 (0x0004) [0x00000001] 
	int                                                DeviceID;                                         		// 0x000008 (0x0004)              
	int                                                LicenseMask;                                      		// 0x00000C (0x0004)              
	struct FString                                     FriendlyName;                                     		// 0x000010 (0x000C)              
	struct FString                                     Filename;                                         		// 0x00001C (0x000C)              
	struct FString                                     ContentPath;                                      		// 0x000028 (0x000C)              
	TArray<struct FString>                             ContentPackages;                                  		// 0x000034 (0x000C)              
	TArray<struct FString>                             ContentFiles;                                     		// 0x000040 (0x000C)              
};
//0x000004 (0x000050 - 0x00004C)
//OnlineCrossTitleContent[0x17C612B0]
struct FOnlineCrossTitleContent : FOnlineContent
{
	int                                                TitleId;                                          		// 0x00004C (0x0004)              
};
//0x000008
//OnlineRegistrant[0x17C61248]
struct FOnlineRegistrant
{
	struct FUniqueNetId                                PlayerNetId;                                      		// 0x000000 (0x0008)              
};
//0x00000C (0x000014 - 0x000008)
//OnlineArbitrationRegistrant[0x17C611E0]
struct FOnlineArbitrationRegistrant : FOnlineRegistrant
{
	struct FQWord                                      MachineId;                                        		// 0x000008 (0x0008)              
	int                                                Trustworthiness;                                  		// 0x000010 (0x0004)              
};
//0x000014
//SpeechRecognizedWord[0x17C61178]
struct FSpeechRecognizedWord
{
	int                                                WordId;                                           		// 0x000000 (0x0004)              
	struct FString                                     WordText;                                         		// 0x000004 (0x000C)              
	float                                              Confidence;                                       		// 0x000010 (0x0004)              
};
//0x000010
//OnlinePlayerScore[0x17C61110]
struct FOnlinePlayerScore
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x000000 (0x0008)              
	int                                                TeamID;                                           		// 0x000008 (0x0004)              
	int                                                Score;                                            		// 0x00000C (0x0004)              
};
//0x000004
//LocalTalker[0x17C610A8]
struct FLocalTalker
{
	unsigned long                                      bHasVoice : 1;                                    		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bHasNetworkedVoice : 1;                           		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bIsRecognizingSpeech : 1;                         		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      bWasTalking : 1;                                  		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      bIsTalking : 1;                                   		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      bIsRegistered : 1;                                		// 0x000000 (0x0004) [0x00000020] 
};
//0x000010
//RemoteTalker[0x17C61040]
struct FRemoteTalker
{
	struct FUniqueNetId                                TalkerId;                                         		// 0x000000 (0x0008)              
	float                                              LastNotificationTime;                             		// 0x000008 (0x0004)              
	unsigned long                                      bWasTalking : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      bIsTalking : 1;                                   		// 0x00000C (0x0004) [0x00000002] 
	unsigned long                                      bIsRegistered : 1;                                		// 0x00000C (0x0004) [0x00000004] 
};
//0x000024
//OnlineFriendMessage[0x17C60FD8]
struct FOnlineFriendMessage
{
	struct FUniqueNetId                                SendingPlayerId;                                  		// 0x000000 (0x0008)              
	struct FString                                     SendingPlayerNick;                                		// 0x000008 (0x000C)              
	unsigned long                                      bIsFriendInvite : 1;                              		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      bIsGameInvite : 1;                                		// 0x000014 (0x0004) [0x00000002] 
	unsigned long                                      bWasAccepted : 1;                                 		// 0x000014 (0x0004) [0x00000004] 
	unsigned long                                      bWasDenied : 1;                                   		// 0x000014 (0x0004) [0x00000008] 
	struct FString                                     Message;                                          		// 0x000018 (0x000C)              
};
//0x00000C
//NamedInterface[0x17C60F70]
struct FNamedInterface
{
	struct FName                                       InterfaceName;                                    		// 0x000000 (0x0008)              
	class UObject*                                     InterfaceObject;                                  		// 0x000008 (0x0004)              
};
//0x000014
//NamedInterfaceDef[0x17C60F08]
struct FNamedInterfaceDef
{
	struct FName                                       InterfaceName;                                    		// 0x000000 (0x0008)              
	struct FString                                     InterfaceClassName;                               		// 0x000008 (0x000C)              
};
//0x000028
//EmsFile[0x17C60EA0]
struct FEmsFile
{
	struct FString                                     Hash;                                             		// 0x000000 (0x000C)              
	struct FString                                     DLName;                                           		// 0x00000C (0x000C)              
	struct FString                                     Filename;                                         		// 0x000018 (0x000C)              
	int                                                FileSize;                                         		// 0x000024 (0x0004)              
};
//0x00001C
//TitleFile[0x17C60E38]
struct FTitleFile
{
	struct FString                                     Filename;                                         		// 0x000000 (0x000C)              
	unsigned char                                      AsyncState;                                       		// 0x00000C (0x0001)              PROPERTY: EOnlineEnumerationReadState
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	TArray<unsigned char>                              Data;                                             		// 0x000010 (0x000C)              
};
//0x000034
//CommunityContentFile[0x17C60DD0]
struct FCommunityContentFile
{
	int                                                ContentId;                                        		// 0x000000 (0x0004)              
	int                                                FileId;                                           		// 0x000004 (0x0004)              
	int                                                ContentType;                                      		// 0x000008 (0x0004)              
	int                                                FileSize;                                         		// 0x00000C (0x0004)              
	struct FUniqueNetId                                Owner;                                            		// 0x000010 (0x0008)              
	int                                                DownloadCount;                                    		// 0x000018 (0x0004)              
	float                                              AverageRating;                                    		// 0x00001C (0x0004)              
	int                                                RatingCount;                                      		// 0x000020 (0x0004)              
	int                                                LastRatingGiven;                                  		// 0x000024 (0x0004)              
	struct FString                                     LocalFilePath;                                    		// 0x000028 (0x000C)              
};
//0x000010
//CommunityContentMetadata[0x17C60D68]
struct FCommunityContentMetadata
{
	int                                                ContentType;                                      		// 0x000000 (0x0004)              
	TArray<struct FSettingsProperty>                   MetadataItems;                                    		// 0x000004 (0x000C)              
};
//0x000028
//NamedSession[0x17C60D00]
struct FNamedSession
{
	struct FName                                       SessionName;                                      		// 0x000000 (0x0008)              
	DWORD                                              SessionInfo;                                      		// 0x000008 (0x0004)              
	class UOnlineGameSettings*                         GameSettings;                                     		// 0x00000C (0x0004)              
	TArray<struct FOnlineRegistrant>                   Registrants;                                      		// 0x000010 (0x000C)              
	TArray<struct FOnlineArbitrationRegistrant>        ArbitrationRegistrants;                           		// 0x00001C (0x000C)              
};
//0x000038
//AchievementDetails[0x17C60C98]
struct FAchievementDetails
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FString                                     AchievementName;                                  		// 0x000004 (0x000C)              
	struct FString                                     Description;                                      		// 0x000010 (0x000C)              
	struct FString                                     HowTo;                                            		// 0x00001C (0x000C)              
	class USurface*                                    Image;                                            		// 0x000028 (0x0004)              
	unsigned char                                      MonthEarned;                                      		// 0x00002C (0x0001)              PROPERTY: 
	unsigned char                                      DayEarned;                                        		// 0x00002D (0x0001)              PROPERTY: 
	unsigned char                                      YearEarned;                                       		// 0x00002E (0x0001)              PROPERTY: 
	unsigned char                                      DayOfWeekEarned;                                  		// 0x00002F (0x0001)              PROPERTY: 
	int                                                GamerPoints;                                      		// 0x000030 (0x0004)              
	unsigned long                                      bIsSecret : 1;                                    		// 0x000034 (0x0004) [0x00000001] 
	unsigned long                                      bWasAchievedOnline : 1;                           		// 0x000034 (0x0004) [0x00000002] 
	unsigned long                                      bWasAchievedOffline : 1;                          		// 0x000034 (0x0004) [0x00000004] 
};
//0x000038
//OnlinePartyMember[0x17C60C30]
struct FOnlinePartyMember
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x000000 (0x0008)              
	struct FString                                     NickName;                                         		// 0x000008 (0x000C)              
	unsigned char                                      LocalUserNum;                                     		// 0x000014 (0x0001)              PROPERTY: 
	unsigned char                                      NatType;                                          		// 0x000015 (0x0001)              PROPERTY: ENATType
	unsigned char                                      _0x000016[0x2];                                   		// 0x000016 (0x0002) MISSED OFFSET
	int                                                TitleId;                                          		// 0x000018 (0x0004)              
	unsigned long                                      bIsLocal : 1;                                     		// 0x00001C (0x0004) [0x00000001] 
	unsigned long                                      bIsInPartyVoice : 1;                              		// 0x00001C (0x0004) [0x00000002] 
	unsigned long                                      bIsTalking : 1;                                   		// 0x00001C (0x0004) [0x00000004] 
	unsigned long                                      bIsInGameSession : 1;                             		// 0x00001C (0x0004) [0x00000008] 
	unsigned long                                      bIsPlayingThisGame : 1;                           		// 0x00001C (0x0004) [0x00000010] 
	struct FQWord                                      SessionId;                                        		// 0x000020 (0x0008)              
	int                                                Data1;                                            		// 0x000028 (0x0004)              
	int                                                Data2;                                            		// 0x00002C (0x0004)              
	int                                                Data3;                                            		// 0x000030 (0x0004)              
	int                                                Data4;                                            		// 0x000034 (0x0004)              
};
//0x000004
//SocialPostPrivileges[0x17C60BC8]
struct FSocialPostPrivileges
{
	unsigned long                                      bCanPostImage : 1;                                		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bCanPostLink : 1;                                 		// 0x000000 (0x0004) [0x00000002] 
};
//0x000004
//SocialPostImageFlags[0x17C60B60]
struct FSocialPostImageFlags
{
	unsigned long                                      bIsUserGeneratedImage : 1;                        		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bIsGameGeneratedImage : 1;                        		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bIsAchievementImage : 1;                          		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      bIsMediaImage : 1;                                		// 0x000000 (0x0004) [0x00000008] 
};
//0x000034
//SocialPostImageInfo[0x17C60AF8]
struct FSocialPostImageInfo
{
	struct FSocialPostImageFlags                       Flags;                                            		// 0x000000 (0x0004)              
	struct FString                                     MessageText;                                      		// 0x000004 (0x000C)              
	struct FString                                     TitleText;                                        		// 0x000010 (0x000C)              
	struct FString                                     PictureCaption;                                   		// 0x00001C (0x000C)              
	struct FString                                     PictureDescription;                               		// 0x000028 (0x000C)              
};
//0x000018 (0x00004C - 0x000034)
//SocialPostLinkInfo[0x17C60A90]
struct FSocialPostLinkInfo : FSocialPostImageInfo
{
	struct FString                                     TitleURL;                                         		// 0x000034 (0x000C)              
	struct FString                                     PictureURL;                                       		// 0x000040 (0x000C)              
};
//0x000008
//OnlineGameSearchResult[0x17C60A28]
struct FOnlineGameSearchResult
{
	class UOnlineGameSettings*                         GameSettings;                                     		// 0x000000 (0x0004)              
	DWORD                                              PlatformData;                                     		// 0x000004 (0x0004)              
};
//0x000028
//OverrideSkill[0x17C609C0]
struct FOverrideSkill
{
	int                                                LeaderboardId;                                    		// 0x000000 (0x0004)              
	TArray<struct FUniqueNetId>                        Players;                                          		// 0x000004 (0x000C)              
	TArray<double>                                     Mus;                                              		// 0x000010 (0x000C)              
	TArray<double>                                     Sigmas;                                           		// 0x00001C (0x000C)              
};
//0x000014
//NamedObjectProperty[0x17C60958]
struct FNamedObjectProperty
{
	struct FName                                       ObjectPropertyName;                               		// 0x000000 (0x0008)              
	struct FString                                     ObjectPropertyValue;                              		// 0x000008 (0x000C)              
};
//0x00000E
//OnlineGameSearchParameter[0x17C608F0]
struct FOnlineGameSearchParameter
{
	int                                                EntryId;                                          		// 0x000000 (0x0004)              
	struct FName                                       ObjectPropertyName;                               		// 0x000004 (0x0008)              
	unsigned char                                      EntryType;                                        		// 0x00000C (0x0001)              PROPERTY: EOnlineGameSearchEntryType
	unsigned char                                      ComparisonType;                                   		// 0x00000D (0x0001)              PROPERTY: EOnlineGameSearchComparisonType
};
//0x00000E
//OnlineGameSearchSortClause[0x17C60888]
struct FOnlineGameSearchSortClause
{
	int                                                EntryId;                                          		// 0x000000 (0x0004)              
	struct FName                                       ObjectPropertyName;                               		// 0x000004 (0x0008)              
	unsigned char                                      EntryType;                                        		// 0x00000C (0x0001)              PROPERTY: EOnlineGameSearchEntryType
	unsigned char                                      SortType;                                         		// 0x00000D (0x0001)              PROPERTY: EOnlineGameSearchSortType
};
//0x00000C
//OnlineGameSearchORClause[0x17C60820]
struct FOnlineGameSearchORClause
{
	TArray<struct FOnlineGameSearchParameter>          OrParams;                                         		// 0x000000 (0x000C)              
};
//0x000018
//OnlineGameSearchQuery[0x17C607B8]
struct FOnlineGameSearchQuery
{
	TArray<struct FOnlineGameSearchORClause>           OrClauses;                                        		// 0x000000 (0x000C)              
	TArray<struct FOnlineGameSearchSortClause>         SortClauses;                                      		// 0x00000C (0x000C)              
};
//0x000035
//ClientAdjustment[0x17C60750]
struct FClientAdjustment
{
	double                                             TimeStamp;                                        		// 0x000000 (0x0008)              
	unsigned char                                      newPhysics;                                       		// 0x000008 (0x0001)              PROPERTY: EPhysics
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	FVector3                                           NewLoc;                                           		// 0x00000C (0x000C)              
	FVector3                                           NewVel;                                           		// 0x000018 (0x000C)              
	class AActor*                                      NewBase;                                          		// 0x000024 (0x0004)              
	FVector3                                           NewFloor;                                         		// 0x000028 (0x000C)              
	unsigned char                                      bAckGoodMove;                                     		// 0x000034 (0x0001)              PROPERTY: 
};
//0x000010
//ConnectedPeerInfo[0x17C606E8]
struct FConnectedPeerInfo
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x000000 (0x0008)              
	unsigned char                                      NatType;                                          		// 0x000008 (0x0001)              PROPERTY: ENATType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	unsigned long                                      bLostConnectionToHost : 1;                        		// 0x00000C (0x0004) [0x00000001] 
};
//0x00000D
//InputEntry[0x17C60680]
struct FInputEntry
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: EInputTypes
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              Value;                                            		// 0x000004 (0x0004)              
	float                                              TimeDelta;                                        		// 0x000008 (0x0004)              
	unsigned char                                      Action;                                           		// 0x00000C (0x0001)              PROPERTY: EInputMatchAction
};
//0x00003C
//InputMatchRequest[0x17C60618]
struct FInputMatchRequest
{
	TArray<struct FInputEntry>                         Inputs;                                           		// 0x000000 (0x000C)              
	class AActor*                                      MatchActor;                                       		// 0x00000C (0x0004)              
	struct FScriptDelegate                             MatchFunc;                                        		// 0x000010 (0x000C)              
	struct FScriptDelegate                             FailedFunc;                                       		// 0x00001C (0x000C)              
	struct FName                                       RequestName;                                      		// 0x000028 (0x0008)              
	int                                                MatchIdx;                                         		// 0x000030 (0x0004)              
	double                                             LastMatchTime;                                    		// 0x000034 (0x0008)              
};
//0x000034
//DebugTextInfo[0x17C605B0]
struct FDebugTextInfo
{
	class AActor*                                      SrcActor;                                         		// 0x000000 (0x0004)              
	FVector3                                           SrcActorOffset;                                   		// 0x000004 (0x000C)              
	FVector3                                           SrcActorDesiredOffset;                            		// 0x000010 (0x000C)              
	struct FString                                     DebugText;                                        		// 0x00001C (0x000C)              
	float                                              TimeRemaining;                                    		// 0x000028 (0x0004)              
	float                                              Duration;                                         		// 0x00002C (0x0004)              
	DWORD                                              TextColor;                                        		// 0x000030 (0x0004)              
};
//0x00001C
//CheckpointRecord[0x17C60548]
struct FCheckpointRecord
{
	FVector3                                           Location;                                         		// 0x000000 (0x000C)              
	FRotator                                           Rotation;                                         		// 0x00000C (0x000C)              
	unsigned long                                      bIsShutdown : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
};
//0x000028
//IndexedRBState[0x17C604E0]
struct FIndexedRBState
{
	FVector3                                           CenterOfMass;                                     		// 0x000000 (0x000C)              
	FVector3                                           LinearVelocity;                                   		// 0x00000C (0x000C)              
	FVector3                                           AngularVelocity;                                  		// 0x000018 (0x000C)              
	int                                                Index;                                            		// 0x000024 (0x0004)              
};
//0x000018
//RBVolumeFill[0x17C60478]
struct FRBVolumeFill
{
	TArray<struct FIndexedRBState>                     RBStates;                                         		// 0x000000 (0x000C)              
	TArray<FVector3>                                   Positions;                                        		// 0x00000C (0x000C)              
};
//0x000020
//EmitterBaseInfo[0x17C60410]
struct FEmitterBaseInfo
{
	class UParticleSystemComponent*                    PSC;                                              		// 0x000000 (0x0004)              
	class AActor*                                      Base;                                             		// 0x000004 (0x0004)              
	FVector3                                           RelativeLocation;                                 		// 0x000008 (0x000C)              
	FRotator                                           RelativeRotation;                                 		// 0x000014 (0x000C)              
};
//0x00001C
//ConsoleMessage[0x17C603A8]
struct FConsoleMessage
{
	struct FString                                     Text;                                             		// 0x000000 (0x000C)              
	DWORD                                              TextColor;                                        		// 0x00000C (0x0004)              
	double                                             MessageLife;                                      		// 0x000010 (0x0008)              
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000018 (0x0004)              
};
//0x000044
//HudLocalizedMessage[0x17C60340]
struct FHudLocalizedMessage
{
	class UClass*                                      Message;                                          		// 0x000000 (0x0004)              
	struct FString                                     StringMessage;                                    		// 0x000004 (0x000C)              
	int                                                Switch;                                           		// 0x000010 (0x0004)              
	double                                             EndOfLife;                                        		// 0x000014 (0x0008)              
	float                                              Lifetime;                                         		// 0x00001C (0x0004)              
	float                                              PosY;                                             		// 0x000020 (0x0004)              
	DWORD                                              DrawColor;                                        		// 0x000024 (0x0004)              
	int                                                FontSize;                                         		// 0x000028 (0x0004)              
	class UFont*                                       StringFont;                                       		// 0x00002C (0x0004)              
	float                                              DX;                                               		// 0x000030 (0x0004)              
	float                                              DY;                                               		// 0x000034 (0x0004)              
	unsigned long                                      Drawn : 1;                                        		// 0x000038 (0x0004) [0x00000001] 
	int                                                Count;                                            		// 0x00003C (0x0004)              
	class UObject*                                     OptionalObject;                                   		// 0x000040 (0x0004)              
};
//0x000018
//KeyValuePair[0x17C602D8]
struct FKeyValuePair
{
	struct FString                                     Key;                                              		// 0x000000 (0x000C)              
	struct FString                                     Value;                                            		// 0x00000C (0x000C)              
};
//0x00002C
//PlayerResponseLine[0x17C60270]
struct FPlayerResponseLine
{
	int                                                PlayerNum;                                        		// 0x000000 (0x0004)              
	int                                                PlayerID;                                         		// 0x000004 (0x0004)              
	struct FString                                     PlayerName;                                       		// 0x000008 (0x000C)              
	int                                                Ping;                                             		// 0x000014 (0x0004)              
	int                                                Score;                                            		// 0x000018 (0x0004)              
	int                                                StatsID;                                          		// 0x00001C (0x0004)              
	TArray<struct FKeyValuePair>                       PlayerInfo;                                       		// 0x000020 (0x000C)              
};
//0x000060
//ServerResponseLine[0x17C60208]
struct FServerResponseLine
{
	int                                                ServerID;                                         		// 0x000000 (0x0004)              
	struct FString                                     IP;                                               		// 0x000004 (0x000C)              
	int                                                Port;                                             		// 0x000010 (0x0004)              
	int                                                QueryPort;                                        		// 0x000014 (0x0004)              
	struct FString                                     ServerName;                                       		// 0x000018 (0x000C)              
	struct FString                                     MapName;                                          		// 0x000024 (0x000C)              
	struct FString                                     GameType;                                         		// 0x000030 (0x000C)              
	int                                                CurrentPlayers;                                   		// 0x00003C (0x0004)              
	int                                                MaxPlayers;                                       		// 0x000040 (0x0004)              
	int                                                Ping;                                             		// 0x000044 (0x0004)              
	TArray<struct FKeyValuePair>                       ServerInfo;                                       		// 0x000048 (0x000C)              
	TArray<struct FPlayerResponseLine>                 PlayerInfo;                                       		// 0x000054 (0x000C)              
};
//0x000031
//NavigationOctreeObject[0x17C601A0]
struct FNavigationOctreeObject
{
	struct FBox                                        BoundingBox;                                      		// 0x000000 (0x001C)              
	FVector3                                           BoxCenter;                                        		// 0x00001C (0x000C)              
	DWORD                                              OctreeNode;                                       		// 0x000028 (0x0004)              
	class UObject*                                     Owner;                                            		// 0x00002C (0x0004)              
	unsigned char                                      OwnerType;                                        		// 0x000030 (0x0001)              PROPERTY: 
};
//0x000010
//DebugNavCost[0x17C60138]
struct FDebugNavCost
{
	struct FString                                     Desc;                                             		// 0x000000 (0x000C)              
	int                                                Cost;                                             		// 0x00000C (0x0004)              
};
//0x000008 (0x00001C - 0x000014)
//CoverReference[0x17C600D0]
struct FCoverReference : FNavReference
{
	int                                                SlotIdx;                                          		// 0x000014 (0x0004)              
	int                                                Direction;                                        		// 0x000018 (0x0004)              
};
//0x000010
//LinkSlotHelper[0x17C60068]
struct FLinkSlotHelper
{
	class ACoverLink*                                  Link;                                             		// 0x000000 (0x0004)              
	TArray<int>                                        Slots;                                            		// 0x000004 (0x000C)              
};
//0x000008
//CoverInfo[0x17C60000]
struct FCoverInfo
{
	class ACoverLink*                                  Link;                                             		// 0x000000 (0x0004)              
	int                                                SlotIdx;                                          		// 0x000004 (0x0004)              
};
//0x00000C
//TargetInfo[0x1D09FF88]
struct FTargetInfo
{
	class AActor*                                      Target;                                           		// 0x000000 (0x0004)              
	int                                                SlotIdx;                                          		// 0x000004 (0x0004)              
	int                                                Direction;                                        		// 0x000008 (0x0004)              
};
//0x000034
//CovPosInfo[0x1D09FF20]
struct FCovPosInfo
{
	class ACoverLink*                                  Link;                                             		// 0x000000 (0x0004)              
	int                                                LtSlotIdx;                                        		// 0x000004 (0x0004)              
	int                                                RtSlotIdx;                                        		// 0x000008 (0x0004)              
	float                                              LtToRtPct;                                        		// 0x00000C (0x0004)              
	FVector3                                           Location;                                         		// 0x000010 (0x000C)              
	FVector3                                           Normal;                                           		// 0x00001C (0x000C)              
	FVector3                                           Tangent;                                          		// 0x000028 (0x000C)              
};
//0x000004
//FireLinkItem[0x1D09FEB8]
struct FFireLinkItem
{
	unsigned char                                      SrcType;                                          		// 0x000000 (0x0001)              PROPERTY: ECoverType
	unsigned char                                      SrcAction;                                        		// 0x000001 (0x0001)              PROPERTY: ECoverAction
	unsigned char                                      DestType;                                         		// 0x000002 (0x0001)              PROPERTY: ECoverType
	unsigned char                                      DestAction;                                       		// 0x000003 (0x0001)              PROPERTY: ECoverAction
};
//0x000030
//FireLink[0x1D09FE50]
struct FFireLink
{
	struct FNavReference                               TargetMarker;                                     		// 0x000000 (0x0014)              
	TArray<struct FFireLinkItem>                       Items;                                            		// 0x000014 (0x000C)              
	FVector3                                           LastMarkerLocation;                               		// 0x000020 (0x000C)              
	unsigned long                                      bFallbackLink : 1;                                		// 0x00002C (0x0004) [0x00000001] 
};
//0x000018
//ExposedLink[0x1D09FDE8]
struct FExposedLink
{
	struct FNavReference                               TargetMarker;                                     		// 0x000000 (0x0014)              
	float                                              ExposedScale;                                     		// 0x000014 (0x0004)              
};
//0x000018
//DangerLink[0x1D09FD80]
struct FDangerLink
{
	struct FNavReference                               DangerNav;                                        		// 0x000000 (0x0014)              
	int                                                DangerCost;                                       		// 0x000014 (0x0004)              
};
//0x0000B9
//CoverSlot[0x1D09FD18]
struct FCoverSlot
{
	class APawn*                                       SlotOwner;                                        		// 0x000000 (0x0004)              
	float                                              SlotValidAfterTime;                               		// 0x000004 (0x0004)              
	unsigned char                                      ForceCoverType;                                   		// 0x000008 (0x0001)              PROPERTY: ECoverType
	unsigned char                                      CoverType;                                        		// 0x000009 (0x0001)              PROPERTY: ECoverType
	unsigned char                                      _0x00000A[0x2];                                   		// 0x00000A (0x0002) MISSED OFFSET
	FVector3                                           LocationOffset;                                   		// 0x00000C (0x000C)              
	FRotator                                           RotationOffset;                                   		// 0x000018 (0x000C)              
	TArray<unsigned char>                              Actions;                                          		// 0x000024 (0x000C)              
	TArray<struct FFireLink>                           FireLinks;                                        		// 0x000030 (0x000C)              
	TArray<struct FFireLink>                           ForcedFireLinks;                                  		// 0x00003C (0x000C)              
	TArray<struct FCoverInfo>                          RejectedFireLinks;                                		// 0x000048 (0x000C)              
	TArray<struct FExposedLink>                        ExposedFireLinks;                                 		// 0x000054 (0x000C)              
	TArray<struct FDangerLink>                         DangerLinks;                                      		// 0x000060 (0x000C)              
	struct FCoverReference                             MantleTarget;                                     		// 0x00006C (0x001C)              
	TArray<struct FCoverReference>                     TurnTarget;                                       		// 0x000088 (0x000C)              
	TArray<struct FCoverReference>                     SlipTarget;                                       		// 0x000094 (0x000C)              
	TArray<struct FCoverReference>                     OverlapClaims;                                    		// 0x0000A0 (0x000C)              
	unsigned long                                      bLeanLeft : 1;                                    		// 0x0000AC (0x0004) [0x00000001] 
	unsigned long                                      bLeanRight : 1;                                   		// 0x0000AC (0x0004) [0x00000002] 
	unsigned long                                      bForceCanPopUp : 1;                               		// 0x0000AC (0x0004) [0x00000004] 
	unsigned long                                      bCanPopUp : 1;                                    		// 0x0000AC (0x0004) [0x00000008] 
	unsigned long                                      bCanMantle : 1;                                   		// 0x0000AC (0x0004) [0x00000010] 
	unsigned long                                      bCanClimbUp : 1;                                  		// 0x0000AC (0x0004) [0x00000020] 
	unsigned long                                      bForceCanCoverSlip_Left : 1;                      		// 0x0000AC (0x0004) [0x00000040] 
	unsigned long                                      bForceCanCoverSlip_Right : 1;                     		// 0x0000AC (0x0004) [0x00000080] 
	unsigned long                                      bCanCoverSlip_Left : 1;                           		// 0x0000AC (0x0004) [0x00000100] 
	unsigned long                                      bCanCoverSlip_Right : 1;                          		// 0x0000AC (0x0004) [0x00000200] 
	unsigned long                                      bCanSwatTurn_Left : 1;                            		// 0x0000AC (0x0004) [0x00000400] 
	unsigned long                                      bCanSwatTurn_Right : 1;                           		// 0x0000AC (0x0004) [0x00000800] 
	unsigned long                                      bEnabled : 1;                                     		// 0x0000AC (0x0004) [0x00001000] 
	unsigned long                                      bAllowPopup : 1;                                  		// 0x0000AC (0x0004) [0x00002000] 
	unsigned long                                      bAllowMantle : 1;                                 		// 0x0000AC (0x0004) [0x00004000] 
	unsigned long                                      bAllowCoverSlip : 1;                              		// 0x0000AC (0x0004) [0x00008000] 
	unsigned long                                      bAllowClimbUp : 1;                                		// 0x0000AC (0x0004) [0x00010000] 
	unsigned long                                      bAllowSwatTurn : 1;                               		// 0x0000AC (0x0004) [0x00020000] 
	unsigned long                                      bSelected : 1;                                    		// 0x0000AC (0x0004) [0x00040000] 
	float                                              LeanTraceDist;                                    		// 0x0000B0 (0x0004)              
	class ACoverSlotMarker*                            SlotMarker;                                       		// 0x0000B4 (0x0004)              
	unsigned char                                      LocationDescription;                              		// 0x0000B8 (0x0001)              PROPERTY: ECoverLocationDescription
};
//0x000002
//ManualCoverTypeInfo[0x1D09FCB0]
struct FManualCoverTypeInfo
{
	unsigned char                                      SlotIndex;                                        		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      ManualCoverType;                                  		// 0x000001 (0x0001)              PROPERTY: ECoverType
};
//0x000034
//CoverReplicationInfo[0x1D09FC48]
struct FCoverReplicationInfo
{
	class ACoverLink*                                  Link;                                             		// 0x000000 (0x0004)              
	TArray<unsigned char>                              SlotsEnabled;                                     		// 0x000004 (0x000C)              
	TArray<unsigned char>                              SlotsDisabled;                                    		// 0x000010 (0x000C)              
	TArray<unsigned char>                              SlotsAdjusted;                                    		// 0x00001C (0x000C)              
	TArray<struct FManualCoverTypeInfo>                SlotsCoverTypeChanged;                            		// 0x000028 (0x000C)              
};
//0x000008
//AutomatedTestingDatum[0x1D09FBE0]
struct FAutomatedTestingDatum
{
	int                                                NumberOfMatchesPlayed;                            		// 0x000000 (0x0004)              
	int                                                NumMapListCyclesDone;                             		// 0x000004 (0x0004)              
};
//0x000000
//TerrainHeight[0x1D09FB78]
struct FTerrainHeight
{
};
//0x000000
//TerrainInfoData[0x1D09FB10]
struct FTerrainInfoData
{
};
//0x000000
//TerrainWeightedMaterial[0x1D09FAA8]
struct FTerrainWeightedMaterial
{
};
//0x000030
//TerrainLayer[0x1D09FA40]
struct FTerrainLayer
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	class UTerrainLayerSetup*                          Setup;                                            		// 0x00000C (0x0004)              
	int                                                AlphaMapIndex;                                    		// 0x000010 (0x0004)              
	unsigned long                                      Highlighted : 1;                                  		// 0x000014 (0x0004) [0x00000001] 
	unsigned long                                      WireframeHighlighted : 1;                         		// 0x000014 (0x0004) [0x00000002] 
	unsigned long                                      Hidden : 1;                                       		// 0x000014 (0x0004) [0x00000004] 
	DWORD                                              HighlightColor;                                   		// 0x000018 (0x0004)              
	DWORD                                              WireframeColor;                                   		// 0x00001C (0x0004)              
	int                                                MinX;                                             		// 0x000020 (0x0004)              
	int                                                MinY;                                             		// 0x000024 (0x0004)              
	int                                                MaxX;                                             		// 0x000028 (0x0004)              
	int                                                MaxY;                                             		// 0x00002C (0x0004)              
};
//0x000000
//AlphaMap[0x1D09F9D8]
struct FAlphaMap
{
};
//0x000014
//TerrainDecorationInstance[0x1D09F970]
struct FTerrainDecorationInstance
{
	class UPrimitiveComponent*                         Component;                                        		// 0x000000 (0x0004)              
	float                                              X;                                                		// 0x000004 (0x0004)              
	float                                              Y;                                                		// 0x000008 (0x0004)              
	float                                              Scale;                                            		// 0x00000C (0x0004)              
	int                                                Yaw;                                              		// 0x000010 (0x0004)              
};
//0x000024
//TerrainDecoration[0x1D09F908]
struct FTerrainDecoration
{
	class UPrimitiveComponentFactory*                  Factory;                                          		// 0x000000 (0x0004)              
	float                                              MinScale;                                         		// 0x000004 (0x0004)              
	float                                              MaxScale;                                         		// 0x000008 (0x0004)              
	float                                              Density;                                          		// 0x00000C (0x0004)              
	float                                              SlopeRotationBlend;                               		// 0x000010 (0x0004)              
	int                                                RandSeed;                                         		// 0x000014 (0x0004)              
	TArray<struct FTerrainDecorationInstance>          Instances;                                        		// 0x000018 (0x000C)              
};
//0x00001C
//TerrainDecoLayer[0x1D09F8A0]
struct FTerrainDecoLayer
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	TArray<struct FTerrainDecoration>                  Decorations;                                      		// 0x00000C (0x000C)              
	int                                                AlphaMapIndex;                                    		// 0x000018 (0x0004)              
};
//0x000000
//TerrainMaterialResource[0x1D09F838]
struct FTerrainMaterialResource
{
};
//0x00000C
//CachedTerrainMaterialArray[0x1D09F7D0]
struct FCachedTerrainMaterialArray
{
	TArray<DWORD>                                      CachedMaterials;                                  		// 0x000000 (0x000C)              
};
//0x00000C
//SelectedTerrainVertex[0x1D09F768]
struct FSelectedTerrainVertex
{
	int                                                X;                                                		// 0x000000 (0x0004)              
	int                                                Y;                                                		// 0x000004 (0x0004)              
	int                                                Weight;                                           		// 0x000008 (0x0004)              
};
//0x000020
//NetViewer[0x1D09F700]
struct FNetViewer
{
	class APlayerController*                           InViewer;                                         		// 0x000000 (0x0004)              
	class AActor*                                      Viewer;                                           		// 0x000004 (0x0004)              
	FVector3                                           ViewLocation;                                     		// 0x000008 (0x000C)              
	FVector3                                           ViewDir;                                          		// 0x000014 (0x000C)              
};
//0x000004
//CompartmentRunList[0x1D09F698]
struct FCompartmentRunList
{
	unsigned long                                      RigidBody : 1;                                    		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      Fluid : 1;                                        		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      Cloth : 1;                                        		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      SoftBody : 1;                                     		// 0x000000 (0x0004) [0x00000008] 
};
//0x00000C
//PhysXSimulationProperties[0x1D09F630]
struct FPhysXSimulationProperties
{
	unsigned long                                      bUseHardware : 1;                                 		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bFixedTimeStep : 1;                               		// 0x000000 (0x0004) [0x00000002] 
	float                                              TimeStep;                                         		// 0x000004 (0x0004)              
	int                                                MaxSubSteps;                                      		// 0x000008 (0x0004)              
};
//0x00003C
//PhysXSceneProperties[0x1D09F5C8]
struct FPhysXSceneProperties
{
	struct FPhysXSimulationProperties                  PrimaryScene;                                     		// 0x000000 (0x000C)              
	struct FPhysXSimulationProperties                  CompartmentRigidBody;                             		// 0x00000C (0x000C)              
	struct FPhysXSimulationProperties                  CompartmentFluid;                                 		// 0x000018 (0x000C)              
	struct FPhysXSimulationProperties                  CompartmentCloth;                                 		// 0x000024 (0x000C)              
	struct FPhysXSimulationProperties                  CompartmentSoftBody;                              		// 0x000030 (0x000C)              
};
//0x000018
//PhysXEmitterVerticalProperties[0x1D09F560]
struct FPhysXEmitterVerticalProperties
{
	unsigned long                                      bDisableLod : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
	int                                                ParticlesLodMin;                                  		// 0x000004 (0x0004)              
	int                                                ParticlesLodMax;                                  		// 0x000008 (0x0004)              
	int                                                PacketsPerPhysXParticleSystemMax;                 		// 0x00000C (0x0004)              
	unsigned long                                      bApplyCylindricalPacketCulling : 1;               		// 0x000010 (0x0004) [0x00000001] 
	float                                              SpawnLodVsFifoBias;                               		// 0x000014 (0x0004)              
};
//0x000018
//PhysXVerticalProperties[0x1D09F4F8]
struct FPhysXVerticalProperties
{
	struct FPhysXEmitterVerticalProperties             Emitters;                                         		// 0x000000 (0x0018)              
};
//0x00000C
//BuildingTypeArray[0x1D09F490]
struct FBuildingTypeArray
{
	TArray<class URWTechNode*>                         SpawnDestroyPoints;                               		// 0x000000 (0x000C)              
};
//0x000020
//VehicleRouteDetails[0x1D09F428]
struct FVehicleRouteDetails
{
	int                                                RouteID;                                          		// 0x000000 (0x0004)              
	int                                                LinkRouteID;                                      		// 0x000004 (0x0004)              
	TArray<unsigned char>                              m_aVehicleTypesAllowed;                           		// 0x000008 (0x000C)              
	TArray<class URWTechNode*>                         PathNodes;                                        		// 0x000014 (0x000C)              
};
//0x000014
//BlockToBlockRouteRecord[0x1D09F3C0]
struct FBlockToBlockRouteRecord
{
	int                                                m_nRecycledRoute_LUTEntry_Index;                  		// 0x000000 (0x0004)              
	int                                                m_nRecycledRoute_LUTEntry_RouteIndex;             		// 0x000004 (0x0004)              
	TArray<int>                                        m_aBlockIDs;                                      		// 0x000008 (0x000C)              
};
//0x00000C
//BlockToBlockLUTEntry[0x1D09F358]
struct FBlockToBlockLUTEntry
{
	TArray<struct FBlockToBlockRouteRecord>            m_aRoutes;                                        		// 0x000000 (0x000C)              
};
//0x000018
//WithinABlockRouteRecord[0x1D09F2F0]
struct FWithinABlockRouteRecord
{
	int                                                m_nRecycledRoute_LUTEntry_Index;                  		// 0x000000 (0x0004)              
	int                                                m_nRecycledRoute_LUTEntry_RouteIndex;             		// 0x000004 (0x0004)              
	float                                              m_fCost;                                          		// 0x000008 (0x0004)              
	TArray<class URWTechNode*>                         m_aNodes;                                         		// 0x00000C (0x000C)              
};
//0x00000C
//WithinABlockLUTEntry[0x1D09F288]
struct FWithinABlockLUTEntry
{
	TArray<struct FWithinABlockRouteRecord>            m_aRoutes;                                        		// 0x000000 (0x000C)              
};
//0x000010
//WithinABlockRoutes[0x1D09F220]
struct FWithinABlockRoutes
{
	int                                                m_nBitsToShiftWABLUTIndex;                        		// 0x000000 (0x0004)              
	TArray<struct FWithinABlockLUTEntry>               m_aWithinABlockLUT;                               		// 0x000004 (0x000C)              
};
//0x00001C
//HostMigrationState[0x1D09F1B8]
struct FHostMigrationState
{
	unsigned char                                      HostMigrationProgress;                            		// 0x000000 (0x0001)              PROPERTY: EHostMigrationProgress
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              HostMigrationElapsedTime;                         		// 0x000004 (0x0004)              
	float                                              HostMigrationTravelCountdown;                     		// 0x000008 (0x0004)              
	struct FString                                     HostMigrationTravelURL;                           		// 0x00000C (0x000C)              
	unsigned long                                      bHostMigrationEnabled : 1;                        		// 0x000018 (0x0004) [0x00000001] 
};
//0x000015
//PathSizeInfo[0x1D09F150]
struct FPathSizeInfo
{
	struct FName                                       Desc;                                             		// 0x000000 (0x0008)              
	float                                              Radius;                                           		// 0x000008 (0x0004)              
	float                                              Height;                                           		// 0x00000C (0x0004)              
	float                                              CrouchHeight;                                     		// 0x000010 (0x0004)              
	unsigned char                                      PathColor;                                        		// 0x000014 (0x0001)              PROPERTY: 
};
//0x000020
//NonLocalVehicleState[0x1D09F0E8]
struct FNonLocalVehicleState
{
	FVector3                                           m_Position;                                       		// 0x000000 (0x000C)              
	unsigned char                                      _0x00000C[0x4];                                   		// 0x00000C (0x0004) MISSED OFFSET
	struct FQuat                                       m_Quaternion;                                     		// 0x000010 (0x0010)              
};
//0x000048
//VehicleState[0x1D09F080]
struct FVehicleState
{
	struct FRigidBodyState                             RBState;                                          		// 0x000000 (0x0040)              
	unsigned char                                      PackedGearSteeringThrottle;                       		// 0x000040 (0x0001)              PROPERTY: 
	unsigned char                                      PackedBrakeGasHandbrake;                          		// 0x000041 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000042[0x2];                                   		// 0x000042 (0x0002) MISSED OFFSET
	int                                                ServerView;                                       		// 0x000044 (0x0004)              
};
//0x000008
//tLinkerAndNetIndex[0x1D09F018]
struct FtLinkerAndNetIndex
{
	int                                                LinkerIndex;                                      		// 0x000000 (0x0004)              
	int                                                NetIndex;                                         		// 0x000004 (0x0004)              
};
//0x000014
//stReplacement[0x1D09EFB0]
struct FstReplacement
{
	class UObject*                                     ArchetypeToReplace;                               		// 0x000000 (0x0004)              
	class UObject*                                     ReplacementObject;                                		// 0x000004 (0x0004)              
	struct FName                                       ReplacementName;                                  		// 0x000008 (0x0008)              
	class UcActorProxy*                                Proxy;                                            		// 0x000010 (0x0004)              
};
//0x000004
//CheckpointRecord[0x1D09EF48]
struct FCheckpointRecord
{
	unsigned long                                      bCollideActors : 1;                               		// 0x000000 (0x0004) [0x00000001] 
};
//0x000008
//LevelStreamingData[0x1D09EEE0]
struct FLevelStreamingData
{
	unsigned long                                      bShouldBeLoaded : 1;                              		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bShouldBeVisible : 1;                             		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bShouldBlockOnLoad : 1;                           		// 0x000000 (0x0004) [0x00000004] 
	class ULevelStreaming*                             Level;                                            		// 0x000004 (0x0004)              
};
//0x000010
//AnimNotifyEvent[0x1D09EE78]
struct FAnimNotifyEvent
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
	class UAnimNotify*                                 Notify;                                           		// 0x000004 (0x0004)              
	struct FName                                       Comment;                                          		// 0x000008 (0x0008)              
};
//0x000024
//RawAnimSequenceTrack[0x1D09EE10]
struct FRawAnimSequenceTrack
{
	TArray<FVector3>                                   PosKeys;                                          		// 0x000000 (0x000C)              
	TArray<struct FQuat>                               RotKeys;                                          		// 0x00000C (0x000C)              
	TArray<float>                                      KeyTimes;                                         		// 0x000018 (0x000C)              
};
//0x000018
//TranslationTrack[0x1D09EDA8]
struct FTranslationTrack
{
	TArray<FVector3>                                   PosKeys;                                          		// 0x000000 (0x000C)              
	TArray<float>                                      Times;                                            		// 0x00000C (0x000C)              
};
//0x000018
//RotationTrack[0x1D09ED40]
struct FRotationTrack
{
	TArray<struct FQuat>                               RotKeys;                                          		// 0x000000 (0x000C)              
	TArray<float>                                      Times;                                            		// 0x00000C (0x000C)              
};
//0x000030
//CompressedTrack[0x1D09ECD8]
struct FCompressedTrack
{
	TArray<unsigned char>                              ByteStream;                                       		// 0x000000 (0x000C)              
	TArray<float>                                      Times;                                            		// 0x00000C (0x000C)              
	float                                              Mins[0x3];                                        		// 0x000018 (0x000C)              
	float                                              Ranges[0x3];                                      		// 0x000024 (0x000C)              
};
//0x000028
//AnimSetMeshLinkup[0x1D09EC70]
struct FAnimSetMeshLinkup
{
	struct FGuid                                       SkelMeshLinkupGUID;                               		// 0x000000 (0x0010)              
	TArray<int>                                        BoneToTrackTable;                                 		// 0x000010 (0x000C)              
	TArray<unsigned char>                              BoneUseAnimTranslation;                           		// 0x00001C (0x000C)              
};
//0x000034
//Listener[0x1D09EC08]
struct FListener
{
	class APortalVolume*                               PortalVolume;                                     		// 0x000000 (0x0004)              
	FVector3                                           Location;                                         		// 0x000004 (0x000C)              
	FVector3                                           Up;                                               		// 0x000010 (0x000C)              
	FVector3                                           Right;                                            		// 0x00001C (0x000C)              
	FVector3                                           Front;                                            		// 0x000028 (0x000C)              
};
//0x000008
//ModeSettings[0x1D09EBA0]
struct FModeSettings
{
	unsigned char                                      Mode;                                             		// 0x000000 (0x0001)              PROPERTY: ESoundMode
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              FadeTime;                                         		// 0x000004 (0x0004)              
};
//0x000014
//SoundGroupProperties[0x1D09EB38]
struct FSoundGroupProperties
{
	float                                              Volume;                                           		// 0x000000 (0x0004)              
	float                                              Pitch;                                            		// 0x000004 (0x0004)              
	float                                              VoiceCenterChannelVolume;                         		// 0x000008 (0x0004)              
	float                                              VoiceRadioVolume;                                 		// 0x00000C (0x0004)              
	unsigned long                                      bApplyEffects : 1;                                		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      bAlwaysPlay : 1;                                  		// 0x000010 (0x0004) [0x00000002] 
	unsigned long                                      bIsUISound : 1;                                   		// 0x000010 (0x0004) [0x00000004] 
	unsigned long                                      bIsMusic : 1;                                     		// 0x000010 (0x0004) [0x00000008] 
	unsigned long                                      bNoReverb : 1;                                    		// 0x000010 (0x0004) [0x00000010] 
};
//0x000028
//SoundGroup[0x1D09EAD0]
struct FSoundGroup
{
	struct FSoundGroupProperties                       Properties;                                       		// 0x000000 (0x0014)              
	struct FName                                       GroupName;                                        		// 0x000014 (0x0008)              
	TArray<struct FName>                               ChildGroupNames;                                  		// 0x00001C (0x000C)              
};
//0x000010
//SoundGroupAdjuster[0x1D09EA68]
struct FSoundGroupAdjuster
{
	struct FName                                       GroupName;                                        		// 0x000000 (0x0008)              
	float                                              VolumeAdjuster;                                   		// 0x000008 (0x0004)              
	float                                              PitchAdjuster;                                    		// 0x00000C (0x0004)              
};
//0x00000C
//SoundGroupEffect[0x1D09EA00]
struct FSoundGroupEffect
{
	TArray<struct FSoundGroupAdjuster>                 GroupEffect;                                      		// 0x000000 (0x000C)              
};
//0x000008
//StProxyReferencer[0x1D09E998]
struct FStProxyReferencer
{
	class AActor*                                      pActor;                                           		// 0x000000 (0x0004)              
	class UField*                                      pProp;                                            		// 0x000004 (0x0004)              
};
//0x000014
//CanvasIcon[0x1D09E930]
struct FCanvasIcon
{
	class UTexture2D*                                  Texture;                                          		// 0x000000 (0x0004)              
	float                                              U;                                                		// 0x000004 (0x0004)              
	float                                              V;                                                		// 0x000008 (0x0004)              
	float                                              UL;                                               		// 0x00000C (0x0004)              
	float                                              VL;                                               		// 0x000010 (0x0004)              
};
//0x000024
//DepthFieldGlowInfo[0x1D09E8C8]
struct FDepthFieldGlowInfo
{
	unsigned long                                      bEnableGlow : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
	struct FLinearColor                                GlowColor;                                        		// 0x000004 (0x0010)              
	FVector2                                           GlowOuterRadius;                                  		// 0x000014 (0x0008)              
	FVector2                                           GlowInnerRadius;                                  		// 0x00001C (0x0008)              
};
//0x000028
//FontRenderInfo[0x1D09E860]
struct FFontRenderInfo
{
	unsigned long                                      bClipText : 1;                                    		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bEnableShadow : 1;                                		// 0x000000 (0x0004) [0x00000002] 
	struct FDepthFieldGlowInfo                         GlowInfo;                                         		// 0x000004 (0x0024)              
};
//0x000030
//CanvasUVTri[0x1D09E7F8]
struct FCanvasUVTri
{
	FVector2                                           V0_Pos;                                           		// 0x000000 (0x0008)              
	FVector2                                           V0_UV;                                            		// 0x000008 (0x0008)              
	FVector2                                           V1_Pos;                                           		// 0x000010 (0x0008)              
	FVector2                                           V1_UV;                                            		// 0x000018 (0x0008)              
	FVector2                                           V2_Pos;                                           		// 0x000020 (0x0008)              
	FVector2                                           V2_UV;                                            		// 0x000028 (0x0008)              
};
//0x000028
//TextSizingParameters[0x1D09E790]
struct FTextSizingParameters
{
	float                                              DrawX;                                            		// 0x000000 (0x0004)              
	float                                              DrawY;                                            		// 0x000004 (0x0004)              
	float                                              DrawXL;                                           		// 0x000008 (0x0004)              
	float                                              DrawYL;                                           		// 0x00000C (0x0004)              
	FVector2                                           Scaling;                                          		// 0x000010 (0x0008)              
	class UFont*                                       DrawFont;                                         		// 0x000018 (0x0004)              
	FVector2                                           SpacingAdjust;                                    		// 0x00001C (0x0008)              
	float                                              ViewportHeight;                                   		// 0x000024 (0x0004)              
};
//0x000014
//WrappedStringElement[0x1D09E728]
struct FWrappedStringElement
{
	struct FString                                     Value;                                            		// 0x000000 (0x000C)              
	FVector2                                           LineExtent;                                       		// 0x00000C (0x0008)              
};
//0x000024
//tPageItem[0x1D09E6C0]
struct FtPageItem
{
	struct FString                                     m_ItemName;                                       		// 0x000000 (0x000C)              
	struct FString                                     m_UsageString;                                    		// 0x00000C (0x000C)              
	struct FString                                     m_HelpString;                                     		// 0x000018 (0x000C)              
};
//0x000144
//cCubicBezierCurveStruct[0x1D09E658]
struct FcCubicBezierCurveStruct
{
	FVector3                                           m_aPoints[0x14];                                  		// 0x000000 (0x00F0)              
	float                                              m_aSegmentLengths[0x13];                          		// 0x0000F0 (0x004C)              
	int                                                m_nNumPoints;                                     		// 0x00013C (0x0004)              
	float                                              m_fLength;                                        		// 0x000140 (0x0004)              
};
//0x000020
//SeqOpInputLink[0x1D09E5F0]
struct FSeqOpInputLink
{
	struct FString                                     LinkDesc;                                         		// 0x000000 (0x000C)              
	unsigned long                                      bHasImpulse : 1;                                  		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      bDisabled : 1;                                    		// 0x00000C (0x0004) [0x00000002] 
	unsigned long                                      bDisabledPIE : 1;                                 		// 0x00000C (0x0004) [0x00000004] 
	class USequenceOp*                                 LinkedOp;                                         		// 0x000010 (0x0004)              
	int                                                DrawY;                                            		// 0x000014 (0x0004)              
	unsigned long                                      bHidden : 1;                                      		// 0x000018 (0x0004) [0x00000001] 
	float                                              ActivateDelay;                                    		// 0x00001C (0x0004)              
};
//0x000008
//SeqOpOutputInputLink[0x1D09E588]
struct FSeqOpOutputInputLink
{
	class USequenceOp*                                 LinkedOp;                                         		// 0x000000 (0x0004)              
	int                                                InputLinkIdx;                                     		// 0x000004 (0x0004)              
};
//0x00002C
//SeqOpOutputLink[0x1D09E520]
struct FSeqOpOutputLink
{
	TArray<struct FSeqOpOutputInputLink>               Links;                                            		// 0x000000 (0x000C)              
	struct FString                                     LinkDesc;                                         		// 0x00000C (0x000C)              
	unsigned long                                      bHasImpulse : 1;                                  		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      bDisabled : 1;                                    		// 0x000018 (0x0004) [0x00000002] 
	unsigned long                                      bDisabledPIE : 1;                                 		// 0x000018 (0x0004) [0x00000004] 
	class USequenceOp*                                 LinkedOp;                                         		// 0x00001C (0x0004)              
	float                                              ActivateDelay;                                    		// 0x000020 (0x0004)              
	int                                                DrawY;                                            		// 0x000024 (0x0004)              
	unsigned long                                      bHidden : 1;                                      		// 0x000028 (0x0004) [0x00000001] 
};
//0x000040
//SeqVarLink[0x1D09E4B8]
struct FSeqVarLink
{
	class UClass*                                      ExpectedType;                                     		// 0x000000 (0x0004)              
	TArray<class USequenceVariable*>                   LinkedVariables;                                  		// 0x000004 (0x000C)              
	struct FString                                     LinkDesc;                                         		// 0x000010 (0x000C)              
	struct FName                                       LinkVar;                                          		// 0x00001C (0x0008)              
	struct FName                                       PropertyName;                                     		// 0x000024 (0x0008)              
	unsigned long                                      bWriteable : 1;                                   		// 0x00002C (0x0004) [0x00000001] 
	unsigned long                                      bHidden : 1;                                      		// 0x00002C (0x0004) [0x00000002] 
	int                                                MinVars;                                          		// 0x000030 (0x0004)              
	int                                                MaxVars;                                          		// 0x000034 (0x0004)              
	int                                                DrawX;                                            		// 0x000038 (0x0004)              
	class UField*                                      CachedProperty;                                   		// 0x00003C (0x0004)              
};
//0x000024
//SeqEventLink[0x1D09E450]
struct FSeqEventLink
{
	class UClass*                                      ExpectedType;                                     		// 0x000000 (0x0004)              
	TArray<class USequenceEvent*>                      LinkedEvents;                                     		// 0x000004 (0x000C)              
	struct FString                                     LinkDesc;                                         		// 0x000010 (0x000C)              
	int                                                DrawX;                                            		// 0x00001C (0x0004)              
	unsigned long                                      bHidden : 1;                                      		// 0x000020 (0x0004) [0x00000001] 
};
//0x000010
//ActivateOp[0x1D09E3E8]
struct FActivateOp
{
	class USequenceOp*                                 ActivatorOp;                                      		// 0x000000 (0x0004)              
	class USequenceOp*                                 Op;                                               		// 0x000004 (0x0004)              
	int                                                InputIdx;                                         		// 0x000008 (0x0004)              
	float                                              RemainingDelay;                                   		// 0x00000C (0x0004)              
};
//0x000018
//SavedTransform[0x1D09E380]
struct FSavedTransform
{
	FVector3                                           Location;                                         		// 0x000000 (0x000C)              
	FRotator                                           Rotation;                                         		// 0x00000C (0x000C)              
};
//0x00000C
//LevelStreamingNameCombo[0x1D09E318]
struct FLevelStreamingNameCombo
{
	class ULevelStreaming*                             Level;                                            		// 0x000000 (0x0004)              
	struct FName                                       LevelName;                                        		// 0x000004 (0x0008)              
};
//0x000008
//SwitchRange[0x1D09E2B0]
struct FSwitchRange
{
	int                                                Min;                                              		// 0x000000 (0x0004)              
	int                                                Max;                                              		// 0x000004 (0x0004)              
};
//0x000000 (0x000010 - 0x000010)
//WIDGET_ID[0x1D09E248]
struct FWIDGET_ID : FGuid
{
};
//0x000000 (0x000010 - 0x000010)
//STYLE_ID[0x1D09E1E0]
struct FSTYLE_ID : FGuid
{
};
//0x000014
//UIRangeData[0x1D09E178]
struct FUIRangeData
{
	float                                              CurrentValue;                                     		// 0x000000 (0x0004)              
	float                                              MinValue;                                         		// 0x000004 (0x0004)              
	float                                              MaxValue;                                         		// 0x000008 (0x0004)              
	float                                              NudgeValue;                                       		// 0x00000C (0x0004)              
	unsigned long                                      bIntRange : 1;                                    		// 0x000010 (0x0004) [0x00000001] 
};
//0x000040
//UIProviderScriptFieldValue[0x1D09E110]
struct FUIProviderScriptFieldValue
{
	struct FName                                       PropertyTag;                                      		// 0x000000 (0x0008)              
	unsigned char                                      PropertyType;                                     		// 0x000008 (0x0001)              PROPERTY: EUIDataProviderFieldType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	struct FString                                     StringValue;                                      		// 0x00000C (0x000C)              
	class USurface*                                    ImageValue;                                       		// 0x000018 (0x0004)              
	TArray<int>                                        ArrayValue;                                       		// 0x00001C (0x000C)              
	struct FUIRangeData                                RangeValue;                                       		// 0x000028 (0x0014)              
	class UObject*                                     ObjectValue;                                      		// 0x00003C (0x0004)              
};
//0x000004 (0x000044 - 0x000040)
//UIProviderFieldValue[0x1D09E0A8]
struct FUIProviderFieldValue : FUIProviderScriptFieldValue
{
	DWORD                                              CustomStringNode;                                 		// 0x000040 (0x0004)              
};
//0x000020
//UIStyleReference[0x1D09E040]
struct FUIStyleReference
{
	struct FName                                       DefaultStyleTag;                                  		// 0x000000 (0x0008)              
	class UClass*                                      RequiredStyleClass;                               		// 0x000008 (0x0004)              
	struct FSTYLE_ID                                   AssignedStyleID;                                  		// 0x00000C (0x0010)              
	class UUIStyle*                                    ResolvedStyle;                                    		// 0x00001C (0x0004)              
};
//0x000006
//UIScreenValue[0x1D09DFD8]
struct FUIScreenValue
{
	float                                              Value;                                            		// 0x000000 (0x0004)              
	unsigned char                                      ScaleType;                                        		// 0x000004 (0x0001)              PROPERTY: EPositionEvalType
	unsigned char                                      Orientation;                                      		// 0x000005 (0x0001)              PROPERTY: EUIOrientation
};
//0x000006
//UIScreenValue_Extent[0x1D09DF70]
struct FUIScreenValue_Extent
{
	float                                              Value;                                            		// 0x000000 (0x0004)              
	unsigned char                                      ScaleType;                                        		// 0x000004 (0x0001)              PROPERTY: EUIExtentEvalType
	unsigned char                                      Orientation;                                      		// 0x000005 (0x0001)              PROPERTY: EUIOrientation
};
//0x00000A
//UIScreenValue_Position[0x1D09DF08]
struct FUIScreenValue_Position
{
	float                                              Value[0x2];                                       		// 0x000000 (0x0008)              
	unsigned char                                      ScaleType[0x2];                                   		// 0x000008 (0x0002)              PROPERTY: EPositionEvalType
};
//0x000019
//UIScreenValue_Bounds[0x1D09DEA0]
struct FUIScreenValue_Bounds
{
	float                                              Value[0x4];                                       		// 0x000000 (0x0010)              
	unsigned char                                      ScaleType[0x4];                                   		// 0x000010 (0x0004)              PROPERTY: EPositionEvalType
	unsigned char                                      bInvalidated[0x4];                                		// 0x000014 (0x0004)              PROPERTY: 
	unsigned char                                      AspectRatioMode;                                  		// 0x000018 (0x0001)              PROPERTY: EUIAspectRatioConstraint
};
//0x000006 (0x000010 - 0x00000A)
//UIAnchorPosition[0x1D09DE38]
struct FUIAnchorPosition : FUIScreenValue_Position
{
	unsigned char                                      _0x00000A[0x2];                                   		// 0x00000A (0x0002) MISSED OFFSET
	float                                              ZDepth;                                           		// 0x00000C (0x0004)              
};
//0x000002 (0x00000C - 0x00000A)
//ScreenPositionRange[0x1D09DDD0]
struct FScreenPositionRange : FUIScreenValue_Position
{
	unsigned char                                      _0x00000A[0x2];                                   		// 0x00000A (0x0002) MISSED OFFSET
};
//0x000014
//UIScreenValue_DockPadding[0x1D09DD68]
struct FUIScreenValue_DockPadding
{
	float                                              PaddingValue[0x4];                                		// 0x000000 (0x0010)              
	unsigned char                                      PaddingScaleType[0x4];                            		// 0x000010 (0x0004)              PROPERTY: EUIDockPaddingEvalType
};
//0x00000A
//UIScreenValue_AutoSizeRegion[0x1D09DD00]
struct FUIScreenValue_AutoSizeRegion
{
	float                                              Value[0x2];                                       		// 0x000000 (0x0008)              
	unsigned char                                      EvalType[0x2];                                    		// 0x000008 (0x0002)              PROPERTY: EUIExtentEvalType
};
//0x000002 (0x00000C - 0x00000A)
//AutoSizePadding[0x1D09DC98]
struct FAutoSizePadding : FUIScreenValue_AutoSizeRegion
{
	unsigned char                                      _0x00000A[0x2];                                   		// 0x00000A (0x0002) MISSED OFFSET
};
//0x00001C
//AutoSizeData[0x1D09DC30]
struct FAutoSizeData
{
	struct FUIScreenValue_AutoSizeRegion               Extent;                                           		// 0x000000 (0x000C)              
	struct FAutoSizePadding                            Padding;                                          		// 0x00000C (0x000C)              
	unsigned long                                      bAutoSizeEnabled : 1;                             		// 0x000018 (0x0004) [0x00000001] 
};
//0x000018
//UIRenderingSubregion[0x1D09DBC8]
struct FUIRenderingSubregion
{
	struct FUIScreenValue_Extent                       ClampRegionSize;                                  		// 0x000000 (0x0008)              
	struct FUIScreenValue_Extent                       ClampRegionOffset;                                		// 0x000008 (0x0008)              
	unsigned char                                      ClampRegionAlignment;                             		// 0x000010 (0x0001)              PROPERTY: EUIAlignment
	unsigned char                                      _0x000011[0x3];                                   		// 0x000011 (0x0003) MISSED OFFSET
	unsigned long                                      bSubregionEnabled : 1;                            		// 0x000014 (0x0004) [0x00000001] 
};
//0x000014
//InputEventSubscription[0x1D09DB60]
struct FInputEventSubscription
{
	struct FName                                       KeyName;                                          		// 0x000000 (0x0008)              
	TArray<class UUIScreenObject*>                     Subscribers;                                      		// 0x000008 (0x000C)              
};
//0x000008
//DefaultEventSpecification[0x1D09DAF8]
struct FDefaultEventSpecification
{
	class UUIEvent*                                    EventTemplate;                                    		// 0x000000 (0x0004)              
	class UClass*                                      EventState;                                       		// 0x000004 (0x0004)              
};
//0x000024
//InputKeyAction[0x1D09DA90]
struct FInputKeyAction
{
	struct FName                                       InputKeyName;                                     		// 0x000000 (0x0008)              
	unsigned char                                      InputKeyState;                                    		// 0x000008 (0x0001)              PROPERTY: EInputEvent
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	TArray<struct FSeqOpOutputInputLink>               TriggeredOps;                                     		// 0x00000C (0x000C)              
	TArray<class USequenceOp*>                         ActionsToExecute;                                 		// 0x000018 (0x000C)              
};
//0x000004 (0x000028 - 0x000024)
//StateInputKeyAction[0x1D09DA28]
struct FStateInputKeyAction : FInputKeyAction
{
	class UClass*                                      Scope;                                            		// 0x000024 (0x0004)              
};
//0x000008
//PlayerInteractionData[0x1D09D9C0]
struct FPlayerInteractionData
{
	class UUIObject*                                   FocusedControl;                                   		// 0x000000 (0x0004)              
	class UUIObject*                                   LastFocusedControl;                               		// 0x000004 (0x0004)              
};
//0x000014
//UIFocusPropagationData[0x1D09D958]
struct FUIFocusPropagationData
{
	class UUIObject*                                   FirstFocusTarget;                                 		// 0x000000 (0x0004)              
	class UUIObject*                                   LastFocusTarget;                                  		// 0x000004 (0x0004)              
	class UUIObject*                                   NextFocusTarget;                                  		// 0x000008 (0x0004)              
	class UUIObject*                                   PrevFocusTarget;                                  		// 0x00000C (0x0004)              
	unsigned long                                      bPendingReceiveFocus : 1;                         		// 0x000010 (0x0004) [0x00000001] 
};
//0x000024
//UINavigationData[0x1D09D8F0]
struct FUINavigationData
{
	class UUIObject*                                   NavigationTarget[0x4];                            		// 0x000000 (0x0010)              
	class UUIObject*                                   ForcedNavigationTarget[0x4];                      		// 0x000010 (0x0010)              
	unsigned char                                      bNullOverride[0x4];                               		// 0x000020 (0x0004)              PROPERTY: 
};
//0x000038
//UIDockingSet[0x1D09D888]
struct FUIDockingSet
{
	class UUIObject*                                   OwnerWidget;                                      		// 0x000000 (0x0004)              
	class UUIObject*                                   TargetWidget[0x4];                                		// 0x000004 (0x0010)              
	struct FUIScreenValue_DockPadding                  DockPadding;                                      		// 0x000014 (0x0014)              
	unsigned long                                      bLockWidthWhenDocked : 1;                         		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      bLockHeightWhenDocked : 1;                        		// 0x000028 (0x0004) [0x00000002] 
	unsigned char                                      TargetFace[0x4];                                  		// 0x00002C (0x0004)              PROPERTY: EUIWidgetFace
	unsigned char                                      bResolved[0x4];                                   		// 0x000030 (0x0004)              PROPERTY: 
	unsigned char                                      bLinking[0x4];                                    		// 0x000034 (0x0004)              PROPERTY: 
};
//0x000005
//UIDockingNode[0x1D09D820]
struct FUIDockingNode
{
	class UUIObject*                                   Widget;                                           		// 0x000000 (0x0004)              
	unsigned char                                      Face;                                             		// 0x000004 (0x0001)              PROPERTY: EUIWidgetFace
};
//0x00006D
//UIRotation[0x1D09D7B8]
struct FUIRotation
{
	FRotator                                           Rotation;                                         		// 0x000000 (0x000C)              
	unsigned char                                      _0x00000C[0x4];                                   		// 0x00000C (0x0004) MISSED OFFSET
	FMatrix                                            TransformMatrix;                                  		// 0x000010 (0x0040)              
	struct FUIAnchorPosition                           AnchorPosition;                                   		// 0x000050 (0x0010)              
	struct FUIScreenValue_Position                     Anchor;                                           		// 0x000060 (0x000C)              
	unsigned char                                      AnchorType;                                       		// 0x00006C (0x0001)              PROPERTY: ERotationAnchor
};
//0x000030
//UIDataStoreBinding[0x1D09D750]
struct FUIDataStoreBinding
{
	class UUIDataStoreSubscriber*                      Subscriber;                                       		// 0x000000 (0x0004)              
	unsigned char                                      RequiredFieldType;                                		// 0x000008 (0x0001)              PROPERTY: EUIDataProviderFieldType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	struct FString                                     MarkupString;                                     		// 0x00000C (0x000C)              
	int                                                BindingIndex;                                     		// 0x000018 (0x0004)              
	struct FName                                       DataStoreName;                                    		// 0x00001C (0x0008)              
	struct FName                                       DataStoreField;                                   		// 0x000024 (0x0008)              
	class UUIDataStore*                                ResolvedDataStore;                                		// 0x00002C (0x0004)              
};
//0x000010
//UIStyleSubscriberReference[0x1D09D6E8]
struct FUIStyleSubscriberReference
{
	struct FName                                       SubscriberId;                                     		// 0x000000 (0x0008)              
	class UUIStyleResolver*                            Subscriber;                                       		// 0x000008 (0x0004)              
};
//0x00000C
//StyleReferenceId[0x1D09D680]
struct FStyleReferenceId
{
	struct FName                                       StyleReferenceTag;                                		// 0x000000 (0x0008)              
	class UField*                                      StyleProperty;                                    		// 0x000008 (0x0004)              
};
//0x000004
//UITextAttributes[0x1D09D618]
struct FUITextAttributes
{
	unsigned long                                      Bold : 1;                                         		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      Italic : 1;                                       		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      Underline : 1;                                    		// 0x000000 (0x0004) [0x00000004] 
	unsigned long                                      Shadow : 1;                                       		// 0x000000 (0x0004) [0x00000008] 
	unsigned long                                      Strikethrough : 1;                                		// 0x000000 (0x0004) [0x00000010] 
	unsigned long                                      AllCaps : 1;                                      		// 0x000000 (0x0004) [0x00000020] 
};
//0x00000E
//UIImageAdjustmentData[0x1D09D5B0]
struct FUIImageAdjustmentData
{
	struct FScreenPositionRange                        ProtectedRegion;                                  		// 0x000000 (0x000C)              
	unsigned char                                      AdjustmentType;                                   		// 0x00000C (0x0001)              PROPERTY: EMaterialAdjustmentType
	unsigned char                                      Alignment;                                        		// 0x00000D (0x0001)              PROPERTY: EUIAlignment
};
//0x000010
//TextureCoordinates[0x1D09D548]
struct FTextureCoordinates
{
	float                                              U;                                                		// 0x000000 (0x0004)              
	float                                              V;                                                		// 0x000004 (0x0004)              
	float                                              UL;                                               		// 0x000008 (0x0004)              
	float                                              VL;                                               		// 0x00000C (0x0004)              
};
//0x00001C
//UIStringCaretParameters[0x1D09D4E0]
struct FUIStringCaretParameters
{
	unsigned long                                      bDisplayCaret : 1;                                		// 0x000000 (0x0004) [0x00000001] 
	unsigned char                                      CaretType;                                        		// 0x000004 (0x0001)              PROPERTY: EUIDefaultPenColor
	unsigned char                                      _0x000005[0x3];                                   		// 0x000005 (0x0003) MISSED OFFSET
	float                                              CaretWidth;                                       		// 0x000008 (0x0004)              
	struct FName                                       CaretStyle;                                       		// 0x00000C (0x0008)              
	int                                                CaretPosition;                                    		// 0x000014 (0x0004)              
	class UMaterialInterface*                          CaretMaterial;                                    		// 0x000018 (0x0004)              
};
//0x000048
//RenderParameters[0x1D09D478]
struct FRenderParameters
{
	float                                              DrawX;                                            		// 0x000000 (0x0004)              
	float                                              DrawY;                                            		// 0x000004 (0x0004)              
	float                                              DrawXL;                                           		// 0x000008 (0x0004)              
	float                                              DrawYL;                                           		// 0x00000C (0x0004)              
	FVector2                                           Scaling;                                          		// 0x000010 (0x0008)              
	class UFont*                                       DrawFont;                                         		// 0x000018 (0x0004)              
	unsigned long                                      MonospaceFont : 1;                                		// 0x00001C (0x0004) [0x00000001] 
	unsigned char                                      TextAlignment[0x2];                               		// 0x000020 (0x0002)              PROPERTY: EUIAlignment
	unsigned char                                      _0x000022[0x2];                                   		// 0x000022 (0x0002) MISSED OFFSET
	FVector2                                           ImageExtent;                                      		// 0x000024 (0x0008)              
	struct FTextureCoordinates                         DrawCoords;                                       		// 0x00002C (0x0010)              
	FVector2                                           SpacingAdjust;                                    		// 0x00003C (0x0008)              
	float                                              ViewportHeight;                                   		// 0x000044 (0x0004)              
};
//0x000005
//TextAutoScaleValue[0x1D09D410]
struct FTextAutoScaleValue
{
	float                                              MinScale;                                         		// 0x000000 (0x0004)              
	unsigned char                                      AutoScaleMode;                                    		// 0x000004 (0x0001)              PROPERTY: ETextAutoScaleMode
};
//0x000020
//UIStyleOverride[0x1D09D3A8]
struct FUIStyleOverride
{
	struct FLinearColor                                DrawColor;                                        		// 0x000000 (0x0010)              
	float                                              Opacity;                                          		// 0x000010 (0x0004)              
	float                                              Padding[0x2];                                     		// 0x000014 (0x0008)              
	unsigned long                                      bOverrideDrawColor : 1;                           		// 0x00001C (0x0004) [0x00000001] 
	unsigned long                                      bOverrideOpacity : 1;                             		// 0x00001C (0x0004) [0x00000002] 
	unsigned long                                      bOverridePadding : 1;                             		// 0x00001C (0x0004) [0x00000004] 
};
//0x00002C (0x00004C - 0x000020)
//UITextStyleOverride[0x1D09D340]
struct FUITextStyleOverride : FUIStyleOverride
{
	class UFont*                                       DrawFont;                                         		// 0x000020 (0x0004)              
	unsigned long                                      MonospaceFont : 1;                                		// 0x000024 (0x0004) [0x00000001] 
	struct FUITextAttributes                           TextAttributes;                                   		// 0x000028 (0x0004)              
	unsigned char                                      TextAlignment[0x2];                               		// 0x00002C (0x0002)              PROPERTY: EUIAlignment
	unsigned char                                      ClipMode;                                         		// 0x00002E (0x0001)              PROPERTY: ETextClipMode
	unsigned char                                      ClipAlignment;                                    		// 0x00002F (0x0001)              PROPERTY: EUIAlignment
	struct FTextAutoScaleValue                         AutoScaling;                                      		// 0x000030 (0x0008)              
	float                                              DrawScale[0x2];                                   		// 0x000038 (0x0008)              
	float                                              SpacingAdjust[0x2];                               		// 0x000040 (0x0008)              
	unsigned long                                      bOverrideDrawFont : 1;                            		// 0x000048 (0x0004) [0x00000001] 
	unsigned long                                      bOverrideAttributes : 1;                          		// 0x000048 (0x0004) [0x00000002] 
	unsigned long                                      bOverrideAlignment : 1;                           		// 0x000048 (0x0004) [0x00000004] 
	unsigned long                                      bOverrideClipMode : 1;                            		// 0x000048 (0x0004) [0x00000008] 
	unsigned long                                      bOverrideClipAlignment : 1;                       		// 0x000048 (0x0004) [0x00000010] 
	unsigned long                                      bOverrideAutoScale : 1;                           		// 0x000048 (0x0004) [0x00000020] 
	unsigned long                                      bOverrideScale : 1;                               		// 0x000048 (0x0004) [0x00000040] 
	unsigned long                                      bOverrideSpacingAdjust : 1;                       		// 0x000048 (0x0004) [0x00000080] 
};
//0x000034 (0x000054 - 0x000020)
//UIImageStyleOverride[0x1D09D2D8]
struct FUIImageStyleOverride : FUIStyleOverride
{
	struct FTextureCoordinates                         Coordinates;                                      		// 0x000020 (0x0010)              
	struct FUIImageAdjustmentData                      Formatting[0x2];                                  		// 0x000030 (0x0020)              
	unsigned long                                      bOverrideCoordinates : 1;                         		// 0x000050 (0x0004) [0x00000001] 
	unsigned long                                      bOverrideFormatting : 1;                          		// 0x000050 (0x0004) [0x00000002] 
};
//0x000090
//UICombinedStyleData[0x1D09D270]
struct FUICombinedStyleData
{
	struct FLinearColor                                TextColor;                                        		// 0x000000 (0x0010)              
	struct FLinearColor                                ImageColor;                                       		// 0x000010 (0x0010)              
	float                                              TextPadding[0x2];                                 		// 0x000020 (0x0008)              
	float                                              ImagePadding[0x2];                                		// 0x000028 (0x0008)              
	class UFont*                                       DrawFont;                                         		// 0x000030 (0x0004)              
	unsigned long                                      MonospaceFont : 1;                                		// 0x000034 (0x0004) [0x00000001] 
	class USurface*                                    FallbackImage;                                    		// 0x000038 (0x0004)              
	struct FTextureCoordinates                         AtlasCoords;                                      		// 0x00003C (0x0010)              
	struct FUITextAttributes                           TextAttributes;                                   		// 0x00004C (0x0004)              
	unsigned char                                      TextAlignment[0x2];                               		// 0x000050 (0x0002)              PROPERTY: EUIAlignment
	unsigned char                                      TextClipMode;                                     		// 0x000052 (0x0001)              PROPERTY: ETextClipMode
	unsigned char                                      TextClipAlignment;                                		// 0x000053 (0x0001)              PROPERTY: EUIAlignment
	struct FUIImageAdjustmentData                      AdjustmentType[0x2];                              		// 0x000054 (0x0020)              
	struct FTextAutoScaleValue                         TextAutoScaling;                                  		// 0x000074 (0x0008)              
	FVector2                                           TextScale;                                        		// 0x00007C (0x0008)              
	FVector2                                           TextSpacingAdjust;                                		// 0x000084 (0x0008)              
	unsigned long                                      bInitialized : 1;                                 		// 0x00008C (0x0004) [0x00000001] 
};
//0x000130
//UIStringNodeModifier[0x1D09D208]
struct FUIStringNodeModifier
{
	struct FUICombinedStyleData                        CustomStyleData;                                  		// 0x000000 (0x0090)              
	struct FUICombinedStyleData                        BaseStyleData;                                    		// 0x000090 (0x0090)              
	TArray<struct FModifierData>                       ModifierStack;                                    		// 0x000120 (0x000C)              
	class UUIState*                                    CurrentMenuState;                                 		// 0x00012C (0x0004)              
};
//0x000010
//ModifierData[0x1D09D1A0]
struct FModifierData
{
	class UUIStyle_Data*                               Style;                                            		// 0x000000 (0x0004)              
	TArray<class UFont*>                               InlineFontStack;                                  		// 0x000004 (0x000C)              
};
//0x00002C
//UIStringNode[0x1D09D138]
struct FUIStringNode
{
	DWORD                                              VfTable;                                          		// 0x000000 (0x0004)              
	class UUIDataStore*                                NodeDataStore;                                    		// 0x000004 (0x0004)              
	DWORD                                              ParentNode;                                       		// 0x000008 (0x0004)              
	struct FString                                     SourceText;                                       		// 0x00000C (0x000C)              
	FVector2                                           Extent;                                           		// 0x000018 (0x0008)              
	FVector2                                           Scaling;                                          		// 0x000020 (0x0008)              
	unsigned long                                      bForceWrap : 1;                                   		// 0x000028 (0x0004) [0x00000001] 
};
//0x00009C (0x0000C8 - 0x00002C)
//UIStringNode_Text[0x1D09D0D0]
struct FUIStringNode_Text : FUIStringNode
{
	struct FString                                     RenderedText;                                     		// 0x00002C (0x000C)              
	struct FUICombinedStyleData                        NodeStyleParameters;                              		// 0x000038 (0x0090)              
};
//0x00001C (0x000048 - 0x00002C)
//UIStringNode_Image[0x1D09D068]
struct FUIStringNode_Image : FUIStringNode
{
	FVector2                                           ForcedExtent;                                     		// 0x00002C (0x0008)              
	struct FTextureCoordinates                         TexCoords;                                        		// 0x000034 (0x0010)              
	class UUITexture*                                  RenderedImage;                                    		// 0x000044 (0x0004)              
};
//0x000000 (0x00002C - 0x00002C)
//UIStringNode_NestedMarkupParent[0x1D09D000]
struct FUIStringNode_NestedMarkupParent : FUIStringNode
{
};
//0x000000 (0x0000C8 - 0x0000C8)
//UIStringNode_FormattedNodeParent[0x1D09CF98]
struct FUIStringNode_FormattedNodeParent : FUIStringNode_Text
{
};
//0x000014
//WrappedStringElement[0x1D09CF30]
struct FWrappedStringElement
{
	struct FString                                     Value;                                            		// 0x000000 (0x000C)              
	FVector2                                           LineExtent;                                       		// 0x00000C (0x0008)              
};
//0x00000C
//UIMouseCursor[0x1D09CEC8]
struct FUIMouseCursor
{
	struct FName                                       CursorStyle;                                      		// 0x000000 (0x0008)              
	class UUITexture*                                  Cursor;                                           		// 0x000008 (0x0004)              
};
//0x000020
//InputEventParameters[0x1D09CE60]
struct FInputEventParameters
{
	int                                                PlayerIndex;                                      		// 0x000000 (0x0004)              
	int                                                ControllerId;                                     		// 0x000004 (0x0004)              
	struct FName                                       InputKeyName;                                     		// 0x000008 (0x0008)              
	unsigned char                                      EventType;                                        		// 0x000010 (0x0001)              PROPERTY: EInputEvent
	unsigned char                                      _0x000011[0x3];                                   		// 0x000011 (0x0003) MISSED OFFSET
	float                                              InputDelta;                                       		// 0x000014 (0x0004)              
	float                                              DeltaTime;                                        		// 0x000018 (0x0004)              
	unsigned long                                      bAltPressed : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	unsigned long                                      bCtrlPressed : 1;                                 		// 0x00001C (0x0004) [0x00000002] 
	unsigned long                                      bShiftPressed : 1;                                		// 0x00001C (0x0004) [0x00000004] 
};
//0x000008 (0x000028 - 0x000020)
//SubscribedInputEventParameters[0x1D09CDF8]
struct FSubscribedInputEventParameters : FInputEventParameters
{
	struct FName                                       InputAliasName;                                   		// 0x000020 (0x0008)              
};
//0x000024
//UIAxisEmulationDefinition[0x1D09CD90]
struct FUIAxisEmulationDefinition
{
	struct FName                                       AxisInputKey;                                     		// 0x000000 (0x0008)              
	struct FName                                       AdjacentAxisInputKey;                             		// 0x000008 (0x0008)              
	unsigned long                                      bEmulateButtonPress : 1;                          		// 0x000010 (0x0004) [0x00000001] 
	struct FName                                       InputKeyToEmulate[0x2];                           		// 0x000014 (0x0010)              
};
//0x000009
//RawInputKeyEventData[0x1D09CD28]
struct FRawInputKeyEventData
{
	struct FName                                       InputKeyName;                                     		// 0x000000 (0x0008)              
	unsigned char                                      ModifierKeyFlags;                                 		// 0x000008 (0x0001)              PROPERTY: 
};
//0x000014
//UIInputActionAlias[0x1D09CCC0]
struct FUIInputActionAlias
{
	struct FName                                       InputAliasName;                                   		// 0x000000 (0x0008)              
	TArray<struct FRawInputKeyEventData>               LinkedInputKeys;                                  		// 0x000008 (0x000C)              
};
//0x00000C
//UIInputAliasValue[0x1D09CC58]
struct FUIInputAliasValue
{
	unsigned char                                      ModifierFlagMask;                                 		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       InputAliasName;                                   		// 0x000004 (0x0008)              
};
//0x00003C
//UIInputAliasMap[0x1D09CBF0]
struct FUIInputAliasMap
{
	struct FMultiMap_Mirror                            InputAliasLookupTable;                            		// 0x000000 (0x003C)              
};
//0x00001C
//UIInputAliasStateMap[0x1D09CB88]
struct FUIInputAliasStateMap
{
	struct FString                                     StateClassName;                                   		// 0x000000 (0x000C)              
	class UClass*                                      State;                                            		// 0x00000C (0x0004)              
	TArray<struct FUIInputActionAlias>                 StateInputAliases;                                		// 0x000010 (0x000C)              
};
//0x000094
//UIInputAliasClassMap[0x1D09CB20]
struct FUIInputAliasClassMap
{
	struct FString                                     WidgetClassName;                                  		// 0x000000 (0x000C)              
	class UClass*                                      WidgetClass;                                      		// 0x00000C (0x0004)              
	TArray<struct FUIInputAliasStateMap>               WidgetStates;                                     		// 0x000010 (0x000C)              
	unsigned char                                      StateLookupTable[0x3C];                           		// 0x00001C (0x003C)              UNKNOWN PROPERTY: MapProperty
	unsigned char                                      StateReverseLookupTable[0x3C];                    		// 0x000058 (0x003C)              UNKNOWN PROPERTY: MapProperty
};
//0x000010
//PlayerDataStoreGroup[0x1D09CAB8]
struct FPlayerDataStoreGroup
{
	class ULocalPlayer*                                PlayerOwner;                                      		// 0x000000 (0x0004)              
	TArray<class UUIDataStore*>                        DataStores;                                       		// 0x000004 (0x000C)              
};
//0x000014
//tEntityType[0x1D09CA50]
struct FtEntityType
{
	unsigned long                                      bActive : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	float                                              fRadius;                                          		// 0x000004 (0x0004)              
	DWORD                                              Colour;                                           		// 0x000008 (0x0004)              
	class UTexture2D*                                  pTexture;                                         		// 0x00000C (0x0004)              
	int                                                nPercentageToMagnify;                             		// 0x000010 (0x0004)              
};
//0x000018
//AutoCompleteCommand[0x1D09C9E8]
struct FAutoCompleteCommand
{
	struct FString                                     Command;                                          		// 0x000000 (0x000C)              
	struct FString                                     Desc;                                             		// 0x00000C (0x000C)              
};
//0x00001C
//AutoCompleteNode[0x1D09C980]
struct FAutoCompleteNode
{
	int                                                IndexChar;                                        		// 0x000000 (0x0004)              
	TArray<int>                                        AutoCompleteListIndices;                          		// 0x000004 (0x000C)              
	TArray<DWORD>                                      ChildNodes;                                       		// 0x000010 (0x000C)              
};
//0x00002C
//KeyBind[0x1D09C918]
struct FKeyBind
{
	struct FName                                       Name;                                             		// 0x000000 (0x0008)              
	struct FName                                       AdditionalName1;                                  		// 0x000008 (0x0008)              
	struct FString                                     Command;                                          		// 0x000010 (0x000C)              
	unsigned long                                      Control : 1;                                      		// 0x00001C (0x0004) [0x00000001] 
	unsigned long                                      Shift : 1;                                        		// 0x00001C (0x0004) [0x00000002] 
	unsigned long                                      Alt : 1;                                          		// 0x00001C (0x0004) [0x00000004] 
	struct FName                                       Group;                                            		// 0x000020 (0x0008)              
	unsigned long                                      DrivingVehicleOnly : 1;                           		// 0x000028 (0x0004) [0x00000001] 
	unsigned long                                      OnFootOnly : 1;                                   		// 0x000028 (0x0004) [0x00000002] 
	unsigned long                                      bAllowInScaleformUI : 1;                          		// 0x000028 (0x0004) [0x00000004] 
};
//0x000010
//UIKeyRepeatData[0x1D09C8B0]
struct FUIKeyRepeatData
{
	struct FName                                       CurrentRepeatKey;                                 		// 0x000000 (0x0008)              
	double                                             NextRepeatTime;                                   		// 0x000008 (0x0008)              
};
//0x000004 (0x000014 - 0x000010)
//UIAxisEmulationData[0x1D09C848]
struct FUIAxisEmulationData : FUIKeyRepeatData
{
	unsigned long                                      bEnabled : 1;                                     		// 0x000010 (0x0004) [0x00000001] 
};
//0x00000C
//UIAnimationNotify[0x1D09C7E0]
struct FUIAnimationNotify
{
	unsigned char                                      NotifyType;                                       		// 0x000000 (0x0001)              PROPERTY: EUIAnimNotifyType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       NotifyName;                                       		// 0x000004 (0x0008)              
};
//0x000038
//UIAnimationRawData[0x1D09C778]
struct FUIAnimationRawData
{
	float                                              DestAsFloat;                                      		// 0x000000 (0x0004)              
	struct FLinearColor                                DestAsColor;                                      		// 0x000004 (0x0010)              
	FRotator                                           DestAsRotator;                                    		// 0x000014 (0x000C)              
	FVector3                                           DestAsVector;                                     		// 0x000020 (0x000C)              
	struct FUIAnimationNotify                          DestAsNotify;                                     		// 0x00002C (0x000C)              
};
//0x00003C
//UIAnimationKeyFrame[0x1D09C710]
struct FUIAnimationKeyFrame
{
	float                                              TimeMark;                                         		// 0x000000 (0x0004)              
	struct FUIAnimationRawData                         Data;                                             		// 0x000004 (0x0038)              
};
//0x00001C
//UIAnimTrack[0x1D09C6A8]
struct FUIAnimTrack
{
	unsigned char                                      TrackType;                                        		// 0x000000 (0x0001)              PROPERTY: EUIAnimType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FName                                       TrackWidgetTag;                                   		// 0x000004 (0x0008)              
	TArray<struct FUIAnimationKeyFrame>                KeyFrames;                                        		// 0x00000C (0x000C)              
	class UUIObject*                                   TargetWidget;                                     		// 0x000018 (0x0004)              
};
//0x00002C
//UIAnimSeqRef[0x1D09C640]
struct FUIAnimSeqRef
{
	class UUIAnimationSeq*                             SeqRef;                                           		// 0x000000 (0x0004)              
	float                                              PlaybackRate;                                     		// 0x000004 (0x0004)              
	float                                              AnimTime;                                         		// 0x000008 (0x0004)              
	unsigned long                                      bIsPlaying : 1;                                   		// 0x00000C (0x0004) [0x00000001] 
	unsigned long                                      bIsLooping : 1;                                   		// 0x00000C (0x0004) [0x00000002] 
	int                                                LoopCount;                                        		// 0x000010 (0x0004)              
	FVector3                                           InitialRenderOffset;                              		// 0x000014 (0x000C)              
	FRotator                                           InitialRotation;                                  		// 0x000020 (0x000C)              
};
//0x000018
//UIDataProviderField[0x1D09C5D8]
struct FUIDataProviderField
{
	struct FName                                       FieldTag;                                         		// 0x000000 (0x0008)              
	unsigned char                                      FieldType;                                        		// 0x000008 (0x0001)              PROPERTY: EUIDataProviderFieldType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	TArray<class UUIDataProvider*>                     FieldProviders;                                   		// 0x00000C (0x000C)              
};
//0x000010
//ProfileSettingsArrayProvider[0x1D09C570]
struct FProfileSettingsArrayProvider
{
	int                                                ProfileSettingsId;                                		// 0x000000 (0x0004)              
	struct FName                                       ProfileSettingsName;                              		// 0x000004 (0x0008)              
	class UUIDataProvider_OnlineProfileSettingsArray*  Provider;                                         		// 0x00000C (0x0004)              
};
//0x00001C
//GameResourceDataProvider[0x1D09C508]
struct FGameResourceDataProvider
{
	struct FName                                       ProviderTag;                                      		// 0x000000 (0x0008)              
	struct FString                                     ProviderClassName;                                		// 0x000008 (0x000C)              
	unsigned long                                      bExpandProviders : 1;                             		// 0x000014 (0x0004) [0x00000001] 
	class UClass*                                      ProviderClass;                                    		// 0x000018 (0x0004)              
};
//0x00000C
//GameDataProviderTypes[0x1D09C4A0]
struct FGameDataProviderTypes
{
	class UClass*                                      GameDataProviderClass;                            		// 0x000000 (0x0004)              
	class UClass*                                      PlayerDataProviderClass;                          		// 0x000004 (0x0004)              
	class UClass*                                      TeamDataProviderClass;                            		// 0x000008 (0x0004)              
};
//0x000010
//PlayerDataProviderTypes[0x1D09C438]
struct FPlayerDataProviderTypes
{
	class UClass*                                      PlayerOwnerDataProviderClass;                     		// 0x000000 (0x0004)              
	class UClass*                                      CurrentWeaponDataProviderClass;                   		// 0x000004 (0x0004)              
	class UClass*                                      WeaponDataProviderClass;                          		// 0x000008 (0x0004)              
	class UClass*                                      PowerupDataProviderClass;                         		// 0x00000C (0x0004)              
};
//0x000028
//GameSearchCfg[0x1D09C3D0]
struct FGameSearchCfg
{
	class UClass*                                      GameSearchClass;                                  		// 0x000000 (0x0004)              
	class UClass*                                      DefaultGameSettingsClass;                         		// 0x000004 (0x0004)              
	class UClass*                                      SearchResultsProviderClass;                       		// 0x000008 (0x0004)              
	class UUIDataProvider_Settings*                    DesiredSettingsProvider;                          		// 0x00000C (0x0004)              
	TArray<class UUIDataProvider_Settings*>            SearchResults;                                    		// 0x000010 (0x000C)              
	class UOnlineGameSearch*                           Search;                                           		// 0x00001C (0x0004)              
	struct FName                                       SearchName;                                       		// 0x000020 (0x0008)              
};
//0x000014
//PlayerNickMetaData[0x1D09C368]
struct FPlayerNickMetaData
{
	struct FName                                       PlayerNickName;                                   		// 0x000000 (0x0008)              
	struct FString                                     PlayerNickColumnName;                             		// 0x000008 (0x000C)              
};
//0x000014
//RankMetaData[0x1D09C300]
struct FRankMetaData
{
	struct FName                                       RankName;                                         		// 0x000000 (0x0008)              
	struct FString                                     RankColumnName;                                   		// 0x000008 (0x000C)              
};
//0x000014
//GameSettingsCfg[0x1D09C298]
struct FGameSettingsCfg
{
	class UClass*                                      GameSettingsClass;                                		// 0x000000 (0x0004)              
	class UUIDataProvider_Settings*                    Provider;                                         		// 0x000004 (0x0004)              
	class UOnlineGameSettings*                         GameSettings;                                     		// 0x000008 (0x0004)              
	struct FName                                       SettingsName;                                     		// 0x00000C (0x0008)              
};
//0x000018
//UIInputKeyData[0x1D09C230]
struct FUIInputKeyData
{
	struct FRawInputKeyEventData                       InputKeyData;                                     		// 0x000000 (0x000C)              
	struct FString                                     ButtonFontMarkupString;                           		// 0x00000C (0x000C)              
};
//0x000050
//UIDataStoreInputAlias[0x1D09C1C8]
struct FUIDataStoreInputAlias
{
	struct FName                                       AliasName;                                        		// 0x000000 (0x0008)              
	struct FUIInputKeyData                             PlatformInputKeys[0x3];                           		// 0x000008 (0x0048)              
};
//0x00001C
//UIMenuInputMap[0x1D09C160]
struct FUIMenuInputMap
{
	struct FName                                       FieldName;                                        		// 0x000000 (0x0008)              
	struct FName                                       Set;                                              		// 0x000008 (0x0008)              
	struct FString                                     MappedText;                                       		// 0x000010 (0x000C)              
};
//0x00000C
//UISoundCue[0x1D09C0F8]
struct FUISoundCue
{
	struct FName                                       SoundName;                                        		// 0x000000 (0x0008)              
	class USoundCue*                                   SoundToPlay;                                      		// 0x000008 (0x0004)              
};
//0x000010
//SettingsArrayProvider[0x1D09C090]
struct FSettingsArrayProvider
{
	int                                                SettingsId;                                       		// 0x000000 (0x0004)              
	struct FName                                       SettingsName;                                     		// 0x000004 (0x0008)              
	class UUIDataProvider_SettingsArray*               Provider;                                         		// 0x00000C (0x0004)              
};
//0x000008
//UIDragItem[0x1D09C028]
struct FUIDragItem
{
	int                                                DragWidgetCollectionIndex;                        		// 0x000000 (0x0004)              
	class UObject*                                     ItemData;                                         		// 0x000004 (0x0004)              
};
//0x000030
//UIDragState[0x1D09BFC0]
struct FUIDragState
{
	class UUIObject*                                   DragWidget;                                       		// 0x000000 (0x0004)              
	class UUIObject*                                   DropWidget;                                       		// 0x000004 (0x0004)              
	class UUIObject*                                   LastDropWidget;                                   		// 0x000008 (0x0004)              
	unsigned char                                      Operation;                                        		// 0x00000C (0x0001)              PROPERTY: EUIDragAndDropOperation
	unsigned char                                      _0x00000D[0x3];                                   		// 0x00000D (0x0003) MISSED OFFSET
	class USurface*                                    DragImage;                                        		// 0x000010 (0x0004)              
	TArray<struct FUIDragItem>                         Items;                                            		// 0x000014 (0x000C)              
	TArray<int>                                        DropWidgetCollectionIndex;                        		// 0x000020 (0x000C)              
	unsigned long                                      AltHeld : 1;                                      		// 0x00002C (0x0004) [0x00000001] 
	unsigned long                                      CtrlHeld : 1;                                     		// 0x00002C (0x0004) [0x00000002] 
	unsigned long                                      ShiftHeld : 1;                                    		// 0x00002C (0x0004) [0x00000004] 
};
//0x000030
//CornerSizes[0x1D09BF58]
struct FCornerSizes
{
	float                                              TopLeft[0x2];                                     		// 0x000000 (0x0008)              
	float                                              TopRight[0x2];                                    		// 0x000008 (0x0008)              
	float                                              BottomLeft[0x2];                                  		// 0x000010 (0x0008)              
	float                                              BottomRight[0x2];                                 		// 0x000018 (0x0008)              
	float                                              TopHeight;                                        		// 0x000020 (0x0004)              
	float                                              BottomHeight;                                     		// 0x000024 (0x0004)              
	float                                              CenterLeftWidth;                                  		// 0x000028 (0x0004)              
	float                                              CenterRightWidth;                                 		// 0x00002C (0x0004)              
};
//0x000014
//CellHitDetectionInfo[0x1D09BEF0]
struct FCellHitDetectionInfo
{
	int                                                HitColumn;                                        		// 0x000000 (0x0004)              
	int                                                HitRow;                                           		// 0x000004 (0x0004)              
	int                                                ResizeColumn;                                     		// 0x000008 (0x0004)              
	int                                                ResizeRow;                                        		// 0x00000C (0x0004)              
	unsigned long                                      bRowDisabled : 1;                                 		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      bCellDisabled : 1;                                		// 0x000010 (0x0004) [0x00000002] 
	unsigned long                                      bOverColumnHeader : 1;                            		// 0x000010 (0x0004) [0x00000004] 
};
//0x00001C
//ContextMenuItem[0x1D09BE88]
struct FContextMenuItem
{
	class UUIContextMenu*                              OwnerMenu;                                        		// 0x000000 (0x0004)              
	DWORD                                              ParentItem;                                       		// 0x000004 (0x0004)              
	unsigned char                                      ItemType;                                         		// 0x000008 (0x0001)              PROPERTY: EContextMenuItemType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	struct FString                                     ItemText;                                         		// 0x00000C (0x000C)              
	int                                                ItemId;                                           		// 0x000018 (0x0004)              
};
//0x000028
//ArchetypeInstancePair[0x1D09BE20]
struct FArchetypeInstancePair
{
	class UUIObject*                                   WidgetArchetype;                                  		// 0x000000 (0x0004)              
	class UUIObject*                                   WidgetInstance;                                   		// 0x000004 (0x0004)              
	float                                              ArchetypeBounds[0x4];                             		// 0x000008 (0x0010)              
	float                                              InstanceBounds[0x4];                              		// 0x000018 (0x0010)              
};
//0x000020
//StyleDataReference[0x1D09BDB8]
struct FStyleDataReference
{
	class UUIStyle*                                    OwnerStyle;                                       		// 0x000000 (0x0004)              
	struct FSTYLE_ID                                   SourceStyleID;                                    		// 0x000004 (0x0010)              
	class UUIStyle*                                    SourceStyle;                                      		// 0x000014 (0x0004)              
	class UUIState*                                    SourceState;                                      		// 0x000018 (0x0004)              
	class UUIStyle_Data*                               CustomStyleData;                                  		// 0x00001C (0x0004)              
};
//0x000009
//SwitchClassInfo[0x1D09BD50]
struct FSwitchClassInfo
{
	struct FName                                       ClassName;                                        		// 0x000000 (0x0008)              
	unsigned char                                      bFallThru;                                        		// 0x000008 (0x0001)              PROPERTY: 
};
//0x00000C
//SwitchNameCase[0x1D09BCE8]
struct FSwitchNameCase
{
	struct FName                                       NameValue;                                        		// 0x000000 (0x0008)              
	unsigned long                                      bFallThru : 1;                                    		// 0x000008 (0x0004) [0x00000001] 
};
//0x000008
//SwitchObjectCase[0x1D09BC80]
struct FSwitchObjectCase
{
	class UObject*                                     ObjectValue;                                      		// 0x000000 (0x0004)              
	unsigned long                                      bFallThru : 1;                                    		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bDefaultValue : 1;                                		// 0x000004 (0x0004) [0x00000002] 
};
//0x000018
//QueuedActivationInfo[0x1D09BC18]
struct FQueuedActivationInfo
{
	class AActor*                                      InOriginator;                                     		// 0x000000 (0x0004)              
	class AActor*                                      InInstigator;                                     		// 0x000004 (0x0004)              
	TArray<int>                                        ActivateIndices;                                  		// 0x000008 (0x000C)              
	unsigned long                                      bPushTop : 1;                                     		// 0x000014 (0x0004) [0x00000001] 
};
//0x00000C
//ArrayOfEdges[0x1D09BBB0]
struct FArrayOfEdges
{
	TArray<class URWTechReachSpec*>                    m_aEdges;                                         		// 0x000000 (0x000C)              
};
//0x000030
//PlatformInterfaceData[0x1D09BB48]
struct FPlatformInterfaceData
{
	struct FName                                       DataName;                                         		// 0x000000 (0x0008)              
	unsigned char                                      Type;                                             		// 0x000008 (0x0001)              PROPERTY: EPlatformInterfaceDataType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	int                                                IntValue;                                         		// 0x00000C (0x0004)              
	float                                              FloatValue;                                       		// 0x000010 (0x0004)              
	struct FString                                     StringValue;                                      		// 0x000014 (0x000C)              
	struct FString                                     StringValue2;                                     		// 0x000020 (0x000C)              
	class UObject*                                     ObjectValue;                                      		// 0x00002C (0x0004)              
};
//0x000034
//PlatformInterfaceDelegateResult[0x1D09BAE0]
struct FPlatformInterfaceDelegateResult
{
	unsigned long                                      bSuccessful : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
	struct FPlatformInterfaceData                      Data;                                             		// 0x000004 (0x0030)              
};
//0x00000C
//DelegateArray[0x1D09BA78]
struct FDelegateArray
{
	TArray<struct FScriptDelegate>                     Delegates;                                        		// 0x000000 (0x000C)              
};
//0x000018
//EventStringParam[0x1D09BA10]
struct FEventStringParam
{
	struct FString                                     ParamName;                                        		// 0x000000 (0x000C)              
	struct FString                                     ParamValue;                                       		// 0x00000C (0x000C)              
};
//0x000018
//NotificationMessageInfo[0x1D09B9A8]
struct FNotificationMessageInfo
{
	struct FString                                     Key;                                              		// 0x000000 (0x000C)              
	struct FString                                     Value;                                            		// 0x00000C (0x000C)              
};
//0x000020
//NotificationInfo[0x1D09B940]
struct FNotificationInfo
{
	unsigned long                                      bIsLocal : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	struct FString                                     MessageBody;                                      		// 0x000004 (0x000C)              
	int                                                BadgeNumber;                                      		// 0x000010 (0x0004)              
	TArray<struct FNotificationMessageInfo>            MessageInfo;                                      		// 0x000014 (0x000C)              
};
//0x000024
//LaunchNotificationInfo[0x1D09B8D8]
struct FLaunchNotificationInfo
{
	unsigned long                                      bWasLaunchedViaNotification : 1;                  		// 0x000000 (0x0004) [0x00000001] 
	struct FNotificationInfo                           Notification;                                     		// 0x000004 (0x0020)              
};
//0x000018
//FacebookFriend[0x1D09B870]
struct FFacebookFriend
{
	struct FString                                     Name;                                             		// 0x000000 (0x000C)              
	struct FString                                     Id;                                               		// 0x00000C (0x000C)              
};
//0x00003C
//PurchaseInfo[0x1D09B808]
struct FPurchaseInfo
{
	struct FString                                     Identifier;                                       		// 0x000000 (0x000C)              
	struct FString                                     DisplayName;                                      		// 0x00000C (0x000C)              
	struct FString                                     DisplayDescription;                               		// 0x000018 (0x000C)              
	struct FString                                     DisplayPrice;                                     		// 0x000024 (0x000C)              
	struct FString                                     CurrencyType;                                     		// 0x000030 (0x000C)              
};
//0x000010
//GetSaveDataCallbackStruct[0x1D09B7A0]
struct FGetSaveDataCallbackStruct
{
	int                                                SlotIndex;                                        		// 0x000000 (0x0004)              
	struct FScriptDelegate                             Callback;                                         		// 0x000004 (0x000C)              
};
//0x000010
//SetSaveDataCallbackStruct[0x1D09B738]
struct FSetSaveDataCallbackStruct
{
	int                                                SlotIndex;                                        		// 0x000000 (0x0004)              
	struct FScriptDelegate                             Callback;                                         		// 0x000004 (0x000C)              
};
//0x000005
//SaveSlotOperation[0x1D09B6D0]
struct FSaveSlotOperation
{
	int                                                SlotIndex;                                        		// 0x000000 (0x0004)              
	unsigned char                                      SlotOperation;                                    		// 0x000004 (0x0001)              PROPERTY: SaveSlotOperationEnum
};
//0x000015
//PresetGeneratedPoint[0x1D09B668]
struct FPresetGeneratedPoint
{
	float                                              KeyIn;                                            		// 0x000000 (0x0004)              
	float                                              KeyOut;                                           		// 0x000004 (0x0004)              
	unsigned long                                      TangentsValid : 1;                                		// 0x000008 (0x0004) [0x00000001] 
	float                                              TangentIn;                                        		// 0x00000C (0x0004)              
	float                                              TangentOut;                                       		// 0x000010 (0x0004)              
	unsigned char                                      IntepMode;                                        		// 0x000014 (0x0001)              PROPERTY: EInterpCurveMode
};
//0x000008
//StatColorMapEntry[0x1D09B600]
struct FStatColorMapEntry
{
	float                                              In;                                               		// 0x000000 (0x0004)              
	DWORD                                              Out;                                              		// 0x000004 (0x0004)              
};
//0x000018
//StatColorMapping[0x1D09B598]
struct FStatColorMapping
{
	struct FString                                     StatName;                                         		// 0x000000 (0x000C)              
	TArray<struct FStatColorMapEntry>                  ColorMap;                                         		// 0x00000C (0x000C)              
};
//0x000024
//DropNoteInfo[0x1D09B530]
struct FDropNoteInfo
{
	FVector3                                           Location;                                         		// 0x000000 (0x000C)              
	FRotator                                           Rotation;                                         		// 0x00000C (0x000C)              
	struct FString                                     Comment;                                          		// 0x000018 (0x000C)              
};
//0x000044
//URL[0x1D09B4C8]
struct FURL
{
	struct FString                                     Protocol;                                         		// 0x000000 (0x000C)              
	struct FString                                     Host;                                             		// 0x00000C (0x000C)              
	int                                                Port;                                             		// 0x000018 (0x0004)              
	struct FString                                     Map;                                              		// 0x00001C (0x000C)              
	TArray<struct FString>                             Op;                                               		// 0x000028 (0x000C)              
	struct FString                                     Portal;                                           		// 0x000034 (0x000C)              
	int                                                Valid;                                            		// 0x000040 (0x0004)              
};
//0x00000C
//LevelStreamingStatus[0x1D09B460]
struct FLevelStreamingStatus
{
	struct FName                                       PackageName;                                      		// 0x000000 (0x0008)              
	unsigned long                                      bShouldBeLoaded : 1;                              		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bShouldBeVisible : 1;                             		// 0x000008 (0x0004) [0x00000002] 
};
//0x000028
//FullyLoadedPackagesInfo[0x1D09B3F8]
struct FFullyLoadedPackagesInfo
{
	unsigned char                                      FullyLoadType;                                    		// 0x000000 (0x0001)              PROPERTY: EFullyLoadPackageType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FString                                     Tag;                                              		// 0x000004 (0x000C)              
	TArray<struct FName>                               PackagesToLoad;                                   		// 0x000010 (0x000C)              
	TArray<class UObject*>                             LoadedObjects;                                    		// 0x00001C (0x000C)              
};
//0x000094
//FontImportOptionsData[0x1D09B390]
struct FFontImportOptionsData
{
	struct FString                                     FontName;                                         		// 0x000000 (0x000C)              
	float                                              Height;                                           		// 0x00000C (0x0004)              
	unsigned long                                      bEnableAntialiasing : 1;                          		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      bEnableBold : 1;                                  		// 0x000010 (0x0004) [0x00000002] 
	unsigned long                                      bEnableItalic : 1;                                		// 0x000010 (0x0004) [0x00000004] 
	unsigned long                                      bEnableUnderline : 1;                             		// 0x000010 (0x0004) [0x00000008] 
	unsigned long                                      bAlphaOnly : 1;                                   		// 0x000010 (0x0004) [0x00000010] 
	unsigned char                                      CharacterSet;                                     		// 0x000014 (0x0001)              PROPERTY: EFontImportCharacterSet
	unsigned char                                      _0x000015[0x3];                                   		// 0x000015 (0x0003) MISSED OFFSET
	struct FString                                     Chars;                                            		// 0x000018 (0x000C)              
	struct FString                                     UnicodeRange;                                     		// 0x000024 (0x000C)              
	struct FString                                     CharsFilePath;                                    		// 0x000030 (0x000C)              
	struct FString                                     CharsFileWildcard;                                		// 0x00003C (0x000C)              
	unsigned long                                      bCreatePrintableOnly : 1;                         		// 0x000048 (0x0004) [0x00000001] 
	struct FLinearColor                                ForegroundColor;                                  		// 0x00004C (0x0010)              
	unsigned long                                      bEnableDropShadow : 1;                            		// 0x00005C (0x0004) [0x00000001] 
	int                                                TexturePageWidth;                                 		// 0x000060 (0x0004)              
	int                                                TexturePageMaxHeight;                             		// 0x000064 (0x0004)              
	int                                                XPadding;                                         		// 0x000068 (0x0004)              
	int                                                YPadding;                                         		// 0x00006C (0x0004)              
	int                                                ExtendBoxTop;                                     		// 0x000070 (0x0004)              
	int                                                ExtendBoxBottom;                                  		// 0x000074 (0x0004)              
	int                                                ExtendBoxRight;                                   		// 0x000078 (0x0004)              
	int                                                ExtendBoxLeft;                                    		// 0x00007C (0x0004)              
	unsigned long                                      bEnableLegacyMode : 1;                            		// 0x000080 (0x0004) [0x00000001] 
	int                                                Kerning;                                          		// 0x000084 (0x0004)              
	unsigned long                                      bUseDistanceFieldAlpha : 1;                       		// 0x000088 (0x0004) [0x00000001] 
	int                                                DistanceFieldScaleFactor;                         		// 0x00008C (0x0004)              
	float                                              DistanceFieldScanRadiusScale;                     		// 0x000090 (0x0004)              
};
//0x000018
//FontCharacter[0x1D09B328]
struct FFontCharacter
{
	int                                                StartU;                                           		// 0x000000 (0x0004)              
	int                                                StartV;                                           		// 0x000004 (0x0004)              
	int                                                USize;                                            		// 0x000008 (0x0004)              
	int                                                VSize;                                            		// 0x00000C (0x0004)              
	unsigned char                                      TextureIndex;                                     		// 0x000010 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000011[0x3];                                   		// 0x000011 (0x0003) MISSED OFFSET
	int                                                VerticalOffset;                                   		// 0x000014 (0x0004)              
};
//0x000038
//CacheSlot[0x1D09B2C0]
struct FCacheSlot
{
	int                                                nCharacter;                                       		// 0x000000 (0x0004)              
	int                                                nTexture;                                         		// 0x000004 (0x0004)              
	int                                                nX;                                               		// 0x000008 (0x0004)              
	int                                                nY;                                               		// 0x00000C (0x0004)              
	int                                                nSizeX;                                           		// 0x000010 (0x0004)              
	int                                                nSizeY;                                           		// 0x000014 (0x0004)              
	float                                              fU;                                               		// 0x000018 (0x0004)              
	float                                              fV;                                               		// 0x00001C (0x0004)              
	float                                              fSizeU;                                           		// 0x000020 (0x0004)              
	float                                              fSizeV;                                           		// 0x000024 (0x0004)              
	int                                                nOffsetX;                                         		// 0x000028 (0x0004)              
	int                                                nOffsetY;                                         		// 0x00002C (0x0004)              
	unsigned long                                      bInUse : 1;                                       		// 0x000030 (0x0004) [0x00000001] 
	unsigned long                                      bUsedThisFrame : 1;                               		// 0x000030 (0x0004) [0x00000002] 
	int                                                nFramesSinceLastUsed;                             		// 0x000034 (0x0004)              
};
//0x000008
//DelayedChar[0x1D09B258]
struct FDelayedChar
{
	DWORD                                              pCharacter;                                       		// 0x000000 (0x0004)              
	int                                                nTexture;                                         		// 0x000004 (0x0004)              
};
//0x000008
//WaveformSample[0x1D09B1F0]
struct FWaveformSample
{
	unsigned char                                      LeftAmplitude;                                    		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      RightAmplitude;                                   		// 0x000001 (0x0001)              PROPERTY: 
	unsigned char                                      LeftFunction;                                     		// 0x000002 (0x0001)              PROPERTY: EWaveformFunction
	unsigned char                                      RightFunction;                                    		// 0x000003 (0x0001)              PROPERTY: EWaveformFunction
	float                                              Duration;                                         		// 0x000004 (0x0004)              
};
//0x000010
//TitleSafeZoneArea[0x1D09B188]
struct FTitleSafeZoneArea
{
	float                                              MaxPercentX;                                      		// 0x000000 (0x0004)              
	float                                              MaxPercentY;                                      		// 0x000004 (0x0004)              
	float                                              RecommendedPercentX;                              		// 0x000008 (0x0004)              
	float                                              RecommendedPercentY;                              		// 0x00000C (0x0004)              
};
//0x000010
//PerPlayerSplitscreenData[0x1D09B120]
struct FPerPlayerSplitscreenData
{
	float                                              SizeX;                                            		// 0x000000 (0x0004)              
	float                                              SizeY;                                            		// 0x000004 (0x0004)              
	float                                              OriginX;                                          		// 0x000008 (0x0004)              
	float                                              OriginY;                                          		// 0x00000C (0x0004)              
};
//0x00000C
//SplitscreenData[0x1D09B0B8]
struct FSplitscreenData
{
	TArray<struct FPerPlayerSplitscreenData>           PlayerData;                                       		// 0x000000 (0x000C)              
};
//0x000029
//IniLocFileEntry[0x1D09B050]
struct FIniLocFileEntry
{
	struct FString                                     Filename;                                         		// 0x000000 (0x000C)              
	struct FString                                     DLName;                                           		// 0x00000C (0x000C)              
	struct FString                                     HashCode;                                         		// 0x000018 (0x000C)              
	unsigned long                                      bIsUnicode : 1;                                   		// 0x000024 (0x0004) [0x00000001] 
	unsigned char                                      ReadState;                                        		// 0x000028 (0x0001)              PROPERTY: EOnlineEnumerationReadState
};
//0x000030
//CurveEdEntry[0x1D09AFE8]
struct FCurveEdEntry
{
	class UObject*                                     CurveObject;                                      		// 0x000000 (0x0004)              
	class UObject*                                     NotifyObjectChanged;                              		// 0x000004 (0x0004)              
	DWORD                                              CurveColor;                                       		// 0x000008 (0x0004)              
	struct FString                                     CurveName;                                        		// 0x00000C (0x000C)              
	int                                                bHideCurve;                                       		// 0x000018 (0x0004)              
	int                                                bColorCurve;                                      		// 0x00001C (0x0004)              
	int                                                bFloatingPointColorCurve;                         		// 0x000020 (0x0004)              
	int                                                bClamp;                                           		// 0x000024 (0x0004)              
	float                                              ClampLow;                                         		// 0x000028 (0x0004)              
	float                                              ClampHigh;                                        		// 0x00002C (0x0004)              
};
//0x000028
//CurveEdTab[0x1D09AF80]
struct FCurveEdTab
{
	struct FString                                     TabName;                                          		// 0x000000 (0x000C)              
	TArray<struct FCurveEdEntry>                       Curves;                                           		// 0x00000C (0x000C)              
	float                                              ViewStartInput;                                   		// 0x000018 (0x0004)              
	float                                              ViewEndInput;                                     		// 0x00001C (0x0004)              
	float                                              ViewStartOutput;                                  		// 0x000020 (0x0004)              
	float                                              ViewEndOutput;                                    		// 0x000024 (0x0004)              
};
//0x000010
//InterpEdSelKey[0x1D09AF18]
struct FInterpEdSelKey
{
	class UInterpGroup*                                Group;                                            		// 0x000000 (0x0004)              
	int                                                TrackIndex;                                       		// 0x000004 (0x0004)              
	int                                                KeyIndex;                                         		// 0x000008 (0x0004)              
	float                                              UnsnappedPosition;                                		// 0x00000C (0x0004)              
};
//0x000014
//DirectorTrackCut[0x1D09AEB0]
struct FDirectorTrackCut
{
	double                                             Time;                                             		// 0x000000 (0x0008)              
	float                                              TransitionTime;                                   		// 0x000008 (0x0004)              
	struct FName                                       TargetCamGroup;                                   		// 0x00000C (0x0008)              
};
//0x00000C
//EventTrackKey[0x1D09AE48]
struct FEventTrackKey
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
	struct FName                                       EventName;                                        		// 0x000004 (0x0008)              
};
//0x00001C
//FaceFXTrackKey[0x1D09ADE0]
struct FFaceFXTrackKey
{
	float                                              StartTime;                                        		// 0x000000 (0x0004)              
	struct FString                                     FaceFXGroupName;                                  		// 0x000004 (0x000C)              
	struct FString                                     FaceFXSeqName;                                    		// 0x000010 (0x000C)              
};
//0x00001C
//AnimControlTrackKey[0x1D09AD78]
struct FAnimControlTrackKey
{
	float                                              StartTime;                                        		// 0x000000 (0x0004)              
	struct FName                                       AnimSeqName;                                      		// 0x000004 (0x0008)              
	float                                              AnimStartOffset;                                  		// 0x00000C (0x0004)              
	float                                              AnimEndOffset;                                    		// 0x000010 (0x0004)              
	float                                              AnimPlayRate;                                     		// 0x000014 (0x0004)              
	unsigned long                                      bLooping : 1;                                     		// 0x000018 (0x0004) [0x00000001] 
	unsigned long                                      bReverse : 1;                                     		// 0x000018 (0x0004) [0x00000002] 
};
//0x00000C
//InterpLookupPoint[0x1D09AD10]
struct FInterpLookupPoint
{
	struct FName                                       GroupName;                                        		// 0x000000 (0x0008)              
	float                                              Time;                                             		// 0x000008 (0x0004)              
};
//0x00000C
//InterpLookupTrack[0x1D09ACA8]
struct FInterpLookupTrack
{
	TArray<struct FInterpLookupPoint>                  Points;                                           		// 0x000000 (0x000C)              
};
//0x000005
//ToggleTrackKey[0x1D09AC40]
struct FToggleTrackKey
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
	unsigned char                                      ToggleAction;                                     		// 0x000004 (0x0001)              PROPERTY: ETrackToggleAction
};
//0x000010
//SoundTrackKey[0x1D09ABD8]
struct FSoundTrackKey
{
	float                                              Time;                                             		// 0x000000 (0x0004)              
	float                                              Volume;                                           		// 0x000004 (0x0004)              
	float                                              Pitch;                                            		// 0x000008 (0x0004)              
	class USoundCue*                                   Sound;                                            		// 0x00000C (0x0004)              
};
//0x00001C
//ExpressionInput[0x1D09AB70]
struct FExpressionInput
{
	class UMaterialExpression*                         Expression;                                       		// 0x000000 (0x0004)              
	int                                                Mask;                                             		// 0x000004 (0x0004)              
	int                                                MaskR;                                            		// 0x000008 (0x0004)              
	int                                                MaskG;                                            		// 0x00000C (0x0004)              
	int                                                MaskB;                                            		// 0x000010 (0x0004)              
	int                                                MaskA;                                            		// 0x000014 (0x0004)              
	int                                                GCC64_Padding;                                    		// 0x000018 (0x0004)              
};
//0x000018
//MorphNodeConn[0x1D09AB08]
struct FMorphNodeConn
{
	TArray<class UMorphNodeBase*>                      ChildNodes;                                       		// 0x000000 (0x000C)              
	struct FName                                       ConnName;                                         		// 0x00000C (0x0008)              
	int                                                DrawY;                                            		// 0x000014 (0x0004)              
};
//0x00000C
//MMStats_Timer[0x1D09AAA0]
struct FMMStats_Timer
{
	unsigned long                                      bInProgress : 1;                                  		// 0x000000 (0x0004) [0x00000001] 
	double                                             MSecs;                                            		// 0x000004 (0x0008)              
};
//0x000018
//OnlineProfileSetting[0x1D09AA38]
struct FOnlineProfileSetting
{
	unsigned char                                      Owner;                                            		// 0x000000 (0x0001)              PROPERTY: EOnlineProfilePropertyOwner
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	struct FSettingsProperty                           ProfileSetting;                                   		// 0x000004 (0x0014)              
};
//0x000014
//RecentParty[0x1D09A9D0]
struct FRecentParty
{
	struct FUniqueNetId                                PartyLeader;                                      		// 0x000000 (0x0008)              
	TArray<struct FUniqueNetId>                        PartyMembers;                                     		// 0x000008 (0x000C)              
};
//0x000010
//CurrentPlayerMet[0x1D09A968]
struct FCurrentPlayerMet
{
	int                                                TeamNum;                                          		// 0x000000 (0x0004)              
	int                                                Skill;                                            		// 0x000004 (0x0004)              
	struct FUniqueNetId                                NetId;                                            		// 0x000008 (0x0008)              
};
//0x000010
//OnlineStatsColumn[0x1D09A900]
struct FOnlineStatsColumn
{
	int                                                ColumnNo;                                         		// 0x000000 (0x0004)              
	struct FSettingsData                               StatValue;                                        		// 0x000004 (0x000C)              
};
//0x00002C
//OnlineStatsRow[0x1D09A898]
struct FOnlineStatsRow
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x000000 (0x0008)              
	struct FSettingsData                               Rank;                                             		// 0x000008 (0x000C)              
	struct FString                                     NickName;                                         		// 0x000014 (0x000C)              
	TArray<struct FOnlineStatsColumn>                  Columns;                                          		// 0x000020 (0x000C)              
};
//0x000018
//ColumnMetaData[0x1D09A830]
struct FColumnMetaData
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FName                                       Name;                                             		// 0x000004 (0x0008)              
	struct FString                                     ColumnName;                                       		// 0x00000C (0x000C)              
};
//0x00000C
//ParticleBurst[0x1D09A7C8]
struct FParticleBurst
{
	int                                                Count;                                            		// 0x000000 (0x0004)              
	int                                                CountLow;                                         		// 0x000004 (0x0004)              
	float                                              Time;                                             		// 0x000008 (0x0004)              
};
//0x000010
//ParticleCurvePair[0x1D09A760]
struct FParticleCurvePair
{
	struct FString                                     CurveName;                                        		// 0x000000 (0x000C)              
	class UObject*                                     CurveObject;                                      		// 0x00000C (0x0004)              
};
//0x000004
//BeamModifierOptions[0x1D09A6F8]
struct FBeamModifierOptions
{
	unsigned long                                      bModify : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bScale : 1;                                       		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bLock : 1;                                        		// 0x000000 (0x0004) [0x00000004] 
};
//0x00001C
//ParticleEvent_GenerateInfo[0x1D09A690]
struct FParticleEvent_GenerateInfo
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: EParticleEventType
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	int                                                Frequency;                                        		// 0x000004 (0x0004)              
	int                                                LowFreq;                                          		// 0x000008 (0x0004)              
	int                                                ParticleFrequency;                                		// 0x00000C (0x0004)              
	unsigned long                                      FirstTimeOnly : 1;                                		// 0x000010 (0x0004) [0x00000001] 
	unsigned long                                      LastTimeOnly : 1;                                 		// 0x000010 (0x0004) [0x00000002] 
	unsigned long                                      UseReflectedImpactVector : 1;                     		// 0x000010 (0x0004) [0x00000004] 
	struct FName                                       CustomName;                                       		// 0x000014 (0x0008)              
};
//0x000004
//OrbitOptions[0x1D09A628]
struct FOrbitOptions
{
	unsigned long                                      bProcessDuringSpawn : 1;                          		// 0x000000 (0x0004) [0x00000001] 
	unsigned long                                      bProcessDuringUpdate : 1;                         		// 0x000000 (0x0004) [0x00000002] 
	unsigned long                                      bUseEmitterTime : 1;                              		// 0x000000 (0x0004) [0x00000004] 
};
//0x000028
//EmitterDynamicParameter[0x1D09A5C0]
struct FEmitterDynamicParameter
{
	struct FName                                       ParamName;                                        		// 0x000000 (0x0008)              
	unsigned long                                      bUseEmitterTime : 1;                              		// 0x000008 (0x0004) [0x00000001] 
	struct FRawDistributionFloat                       ParamValue;                                       		// 0x00000C (0x001C)              
};
//0x00000C
//BeamTargetData[0x1D09A558]
struct FBeamTargetData
{
	struct FName                                       TargetName;                                       		// 0x000000 (0x0008)              
	float                                              TargetPercentage;                                 		// 0x000008 (0x0004)              
};
//0x000010
//PhysXEmitterVerticalLodProperties[0x1D09A4F0]
struct FPhysXEmitterVerticalLodProperties
{
	float                                              WeightForFifo;                                    		// 0x000000 (0x0004)              
	float                                              WeightForSpawnLod;                                		// 0x000004 (0x0004)              
	float                                              SpawnLodRateVsLifeBias;                           		// 0x000008 (0x0004)              
	float                                              RelativeFadeoutTime;                              		// 0x00000C (0x0004)              
};
//0x000008
//SynchronizedActorVisibilityHistory[0x1D09A488]
struct FSynchronizedActorVisibilityHistory
{
	DWORD                                              State;                                            		// 0x000000 (0x0004)              
	DWORD                                              CriticalSection;                                  		// 0x000004 (0x0004)              
};
//0x0000E0
//CurrentPostProcessVolumeInfo[0x1D09A420]
struct FCurrentPostProcessVolumeInfo
{
	struct FPostProcessSettings                        LastSettings;                                     		// 0x000000 (0x00CC)              
	class APostProcessVolume*                          LastVolumeUsed;                                   		// 0x0000CC (0x0004)              
	double                                             BlendStartTime;                                   		// 0x0000D0 (0x0008)              
	double                                             LastBlendTime;                                    		// 0x0000D8 (0x0008)              
};
//0x000008
//LinearDOFSetup[0x1D09A3B8]
struct FLinearDOFSetup
{
	unsigned char                                      bLimited;                                         		// 0x000000 (0x0001)              PROPERTY: 
	unsigned char                                      _0x000001[0x3];                                   		// 0x000001 (0x0003) MISSED OFFSET
	float                                              LimitSize;                                        		// 0x000004 (0x0004)              
};
//0x000005
//BoneMirrorInfo[0x1D09A350]
struct FBoneMirrorInfo
{
	int                                                SourceIndex;                                      		// 0x000000 (0x0004)              
	unsigned char                                      BoneFlipAxis;                                     		// 0x000004 (0x0001)              PROPERTY: EAxis
};
//0x000020
//SkeletalMeshLODInfo[0x1D09A2E8]
struct FSkeletalMeshLODInfo
{
	float                                              DisplayFactor;                                    		// 0x000000 (0x0004)              
	float                                              LODHysteresis;                                    		// 0x000004 (0x0004)              
	TArray<int>                                        LODMaterialMap;                                   		// 0x000008 (0x000C)              
	TArray<unsigned long>                              bEnableShadowCasting;                             		// 0x000014 (0x000C)              
};
//0x000018
//ClothSpecialBoneInfo[0x1D09A280]
struct FClothSpecialBoneInfo
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
	unsigned char                                      BoneType;                                         		// 0x000008 (0x0001)              PROPERTY: ClothBoneType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	TArray<int>                                        AttachedVertexIndices;                            		// 0x00000C (0x000C)              
};
//0x000010
//SoftBodyTetraLink[0x1D09A218]
struct FSoftBodyTetraLink
{
	int                                                Index;                                            		// 0x000000 (0x0004)              
	FVector3                                           Bary;                                             		// 0x000004 (0x000C)              
};
//0x000018
//SoftBodySpecialBoneInfo[0x1D09A1B0]
struct FSoftBodySpecialBoneInfo
{
	struct FName                                       BoneName;                                         		// 0x000000 (0x0008)              
	unsigned char                                      BoneType;                                         		// 0x000008 (0x0001)              PROPERTY: SoftBodyBoneType
	unsigned char                                      _0x000009[0x3];                                   		// 0x000009 (0x0003) MISSED OFFSET
	TArray<int>                                        AttachedVertexIndices;                            		// 0x00000C (0x000C)              
};
//0x000008
//SoundNodeEditorData[0x1D09A148]
struct FSoundNodeEditorData
{
	int                                                NodePosX;                                         		// 0x000000 (0x0004)              
	int                                                NodePosY;                                         		// 0x000004 (0x0004)              
};
//0x000010
//AmbientSoundSlot[0x1D09A0E0]
struct FAmbientSoundSlot
{
	class USoundNodeWave*                              Wave;                                             		// 0x000000 (0x0004)              
	float                                              PitchScale;                                       		// 0x000004 (0x0004)              
	float                                              VolumeScale;                                      		// 0x000008 (0x0004)              
	float                                              Weight;                                           		// 0x00000C (0x0004)              
};
//0x00003C
//DistanceDatum[0x1D09A078]
struct FDistanceDatum
{
	struct FRawDistributionFloat                       FadeInDistance;                                   		// 0x000000 (0x001C)              
	struct FRawDistributionFloat                       FadeOutDistance;                                  		// 0x00001C (0x001C)              
	float                                              Volume;                                           		// 0x000038 (0x0004)              
};
//0x000014
//SubtitleCue[0x1D09A010]
struct FSubtitleCue
{
	struct FString                                     Text;                                             		// 0x000000 (0x000C)              
	double                                             Time;                                             		// 0x00000C (0x0008)              
};
//0x000008
//MatureTimings[0x1D099FA8]
struct FMatureTimings
{
	float                                              StartBleep;                                       		// 0x000000 (0x0004)              
	float                                              EndBleep;                                         		// 0x000004 (0x0004)              
};
//0x00001C
//RecognisableWord[0x1D099F40]
struct FRecognisableWord
{
	int                                                Id;                                               		// 0x000000 (0x0004)              
	struct FString                                     ReferenceWord;                                    		// 0x000004 (0x000C)              
	struct FString                                     PhoneticWord;                                     		// 0x000010 (0x000C)              
};
//0x000048
//RecogVocabulary[0x1D099ED8]
struct FRecogVocabulary
{
	TArray<struct FRecognisableWord>                   WhoDictionary;                                    		// 0x000000 (0x000C)              
	TArray<struct FRecognisableWord>                   WhatDictionary;                                   		// 0x00000C (0x000C)              
	TArray<struct FRecognisableWord>                   WhereDictionary;                                  		// 0x000018 (0x000C)              
	struct FString                                     VocabName;                                        		// 0x000024 (0x000C)              
	TArray<unsigned char>                              VocabData;                                        		// 0x000030 (0x000C)              
	TArray<unsigned char>                              WorkingVocabData;                                 		// 0x00003C (0x000C)              
};
//0x000010
//RecogUserData[0x1D099E70]
struct FRecogUserData
{
	int                                                ActiveVocabularies;                               		// 0x000000 (0x0004)              
	TArray<unsigned char>                              UserData;                                         		// 0x000004 (0x000C)              
};
//0x000008
//ChannelParams[0x1D099E08]
struct FChannelParams
{
	unsigned char                                      Type;                                             		// 0x000000 (0x0001)              PROPERTY: EUVMappingType
	unsigned char                                      Subtype;                                          		// 0x000001 (0x0001)              PROPERTY: EUVMappingSubtype
	unsigned char                                      _0x000002[0x2];                                   		// 0x000002 (0x0002) MISSED OFFSET
	class UTexture*                                    Tex;                                              		// 0x000004 (0x0004)              
};
//0x00001C
//MaterialInput[0x1D099DA0]
struct FMaterialInput
{
	class UMaterialExpression*                         Expression;                                       		// 0x000000 (0x0004)              
	int                                                Mask;                                             		// 0x000004 (0x0004)              
	int                                                MaskR;                                            		// 0x000008 (0x0004)              
	int                                                MaskG;                                            		// 0x00000C (0x0004)              
	int                                                MaskB;                                            		// 0x000010 (0x0004)              
	int                                                MaskA;                                            		// 0x000014 (0x0004)              
	int                                                GCC64_Padding;                                    		// 0x000018 (0x0004)              
};
//0x000008 (0x000024 - 0x00001C)
//ColorMaterialInput[0x1D099D38]
struct FColorMaterialInput : FMaterialInput
{
	unsigned long                                      UseConstant : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	DWORD                                              Constant;                                         		// 0x000020 (0x0004)              
};
//0x000008 (0x000024 - 0x00001C)
//ScalarMaterialInput[0x1D099CD0]
struct FScalarMaterialInput : FMaterialInput
{
	unsigned long                                      UseConstant : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	float                                              Constant;                                         		// 0x000020 (0x0004)              
};
//0x000010 (0x00002C - 0x00001C)
//VectorMaterialInput[0x1D099C68]
struct FVectorMaterialInput : FMaterialInput
{
	unsigned long                                      UseConstant : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	FVector3                                           Constant;                                         		// 0x000020 (0x000C)              
};
//0x00000C (0x000028 - 0x00001C)
//Vector2MaterialInput[0x1D099C00]
struct FVector2MaterialInput : FMaterialInput
{
	unsigned long                                      UseConstant : 1;                                  		// 0x00001C (0x0004) [0x00000001] 
	float                                              ConstantX;                                        		// 0x000020 (0x0004)              
	float                                              ConstantY;                                        		// 0x000024 (0x0004)              
};
//0x000020
//FontParameterValue[0x1D099B98]
struct FFontParameterValue
{
	struct FName                                       ParameterName;                                    		// 0x000000 (0x0008)              
	class UFont*                                       FontValue;                                        		// 0x000008 (0x0004)              
	int                                                FontPage;                                         		// 0x00000C (0x0004)              
	struct FGuid                                       ExpressionGUID;                                   		// 0x000010 (0x0010)              
};
//0x00001C
//ScalarParameterValue[0x1D099B30]
struct FScalarParameterValue
{
	struct FName                                       ParameterName;                                    		// 0x000000 (0x0008)              
	float                                              ParameterValue;                                   		// 0x000008 (0x0004)              
	struct FGuid                                       ExpressionGUID;                                   		// 0x00000C (0x0010)              
};
//0x00001C
//TextureParameterValue[0x1D099AC8]
struct FTextureParameterValue
{
	struct FName                                       ParameterName;                                    		// 0x000000 (0x0008)              
	class UTexture*                                    ParameterValue;                                   		// 0x000008 (0x0004)              
	struct FGuid                                       ExpressionGUID;                                   		// 0x00000C (0x0010)              
};
//0x000028
//VectorParameterValue[0x1D099A60]
struct FVectorParameterValue
{
	struct FName                                       ParameterName;                                    		// 0x000000 (0x0008)              
	struct FLinearColor                                ParameterValue;                                   		// 0x000008 (0x0010)              
	struct FGuid                                       ExpressionGUID;                                   		// 0x000018 (0x0010)              
};
//0x000034
//ParameterValueOverTime[0x1D0999F8]
struct FParameterValueOverTime
{
	struct FGuid                                       ExpressionGUID;                                   		// 0x000000 (0x0010)              
	double                                             StartTime;                                        		// 0x000010 (0x0008)              
	struct FName                                       ParameterName;                                    		// 0x000018 (0x0008)              
	unsigned long                                      bLoop : 1;                                        		// 0x000020 (0x0004) [0x00000001] 
	unsigned long                                      bAutoActivate : 1;                                		// 0x000020 (0x0004) [0x00000002] 
	float                                              CycleTime;                                        		// 0x000024 (0x0004)              
	unsigned long                                      bNormalizeTime : 1;                               		// 0x000028 (0x0004) [0x00000001] 
	float                                              OffsetTime;                                       		// 0x00002C (0x0004)              
	unsigned long                                      bOffsetFromEnd : 1;                               		// 0x000030 (0x0004) [0x00000001] 
};
//0x000008 (0x00003C - 0x000034)
//FontParameterValueOverTime[0x1D099990]
struct FFontParameterValueOverTime : FParameterValueOverTime
{
	class UFont*                                       FontValue;                                        		// 0x000034 (0x0004)              
	int                                                FontPage;                                         		// 0x000038 (0x0004)              
};
//0x000014 (0x000048 - 0x000034)
//ScalarParameterValueOverTime[0x1D099928]
struct FScalarParameterValueOverTime : FParameterValueOverTime
{
	float                                              ParameterValue;                                   		// 0x000034 (0x0004)              
	struct FInterpCurveFloat                           ParameterValueCurve;                              		// 0x000038 (0x0010)              
};
//0x000004 (0x000038 - 0x000034)
//TextureParameterValueOverTime[0x1D0998C0]
struct FTextureParameterValueOverTime : FParameterValueOverTime
{
	class UTexture*                                    ParameterValue;                                   		// 0x000034 (0x0004)              
};
//0x000020 (0x000054 - 0x000034)
//VectorParameterValueOverTime[0x1D099858]
struct FVectorParameterValueOverTime : FParameterValueOverTime
{
	struct FLinearColor                                ParameterValue;                                   		// 0x000034 (0x0010)              
	struct FInterpCurveVector                          ParameterValueCurve;                              		// 0x000044 (0x0010)              
};
//0x000040
//Texture3DMipMap[0x1D0997F0]
struct FTexture3DMipMap
{
	struct FUntypedBulkData_Mirror                     Data;                                             		// 0x000000 (0x0034)              
	int                                                SizeX;                                            		// 0x000034 (0x0004)              
	int                                                SizeY;                                            		// 0x000038 (0x0004)              
	int                                                SizeZ;                                            		// 0x00003C (0x0004)              
};
//0x000040
//Texture2DMipMap[0x1D099788]
struct FTexture2DMipMap
{
	struct FTextureMipBulkData_Mirror                  Data;                                             		// 0x000000 (0x0038)              
	int                                                SizeX;                                            		// 0x000038 (0x0004)              
	int                                                SizeY;                                            		// 0x00003C (0x0004)              
};
//0x00000C
//TextureLinkedListMirror[0x1D099720]
struct FTextureLinkedListMirror
{
	DWORD                                              Element;                                          		// 0x000000 (0x0004)              
	DWORD                                              Next;                                             		// 0x000004 (0x0004)              
	DWORD                                              PrevLink;                                         		// 0x000008 (0x0004)              
};
//0x000000
//TerrainWeightedMaterial[0x1D0996B8]
struct FTerrainWeightedMaterial
{
};
//0x00001C
//SourceTexture2DRegion[0x1D099650]
struct FSourceTexture2DRegion
{
	int                                                OffsetX;                                          		// 0x000000 (0x0004)              
	int                                                OffsetY;                                          		// 0x000004 (0x0004)              
	int                                                SizeX;                                            		// 0x000008 (0x0004)              
	int                                                SizeY;                                            		// 0x00000C (0x0004)              
	int                                                DestOffsetX;                                      		// 0x000010 (0x0004)              
	int                                                DestOffsetY;                                      		// 0x000014 (0x0004)              
	class UTexture2D*                                  Texture2D;                                        		// 0x000018 (0x0004)              
};
//0x000010
//FilterLimit[0x1D0995E8]
struct FFilterLimit
{
	unsigned long                                      Enabled : 1;                                      		// 0x000000 (0x0004) [0x00000001] 
	float                                              Base;                                             		// 0x000004 (0x0004)              
	float                                              NoiseScale;                                       		// 0x000008 (0x0004)              
	float                                              NoiseAmount;                                      		// 0x00000C (0x0004)              
};
//0x000054
//TerrainFilteredMaterial[0x1D099580]
struct FTerrainFilteredMaterial
{
	unsigned long                                      UseNoise : 1;                                     		// 0x000000 (0x0004) [0x00000001] 
	float                                              NoiseScale;                                       		// 0x000004 (0x0004)              
	float                                              NoisePercent;                                     		// 0x000008 (0x0004)              
	struct FFilterLimit                                MinHeight;                                        		// 0x00000C (0x0010)              
	struct FFilterLimit                                MaxHeight;                                        		// 0x00001C (0x0010)              
	struct FFilterLimit                                MinSlope;                                         		// 0x00002C (0x0010)              
	struct FFilterLimit                                MaxSlope;                                         		// 0x00003C (0x0010)              
	float                                              Alpha;                                            		// 0x00004C (0x0004)              
	class UTerrainMaterial*                            Material;                                         		// 0x000050 (0x0004)              
};
//0x000038
//TerrainFoliageMesh[0x1D099518]
struct FTerrainFoliageMesh
{
	class UStaticMesh*                                 StaticMesh;                                       		// 0x000000 (0x0004)              
	class UMaterialInterface*                          Material;                                         		// 0x000004 (0x0004)              
	int                                                Density;                                          		// 0x000008 (0x0004)              
	float                                              MaxDrawRadius;                                    		// 0x00000C (0x0004)              
	float                                              MinTransitionRadius;                              		// 0x000010 (0x0004)              
	float                                              MinScale;                                         		// 0x000014 (0x0004)              
	float                                              MaxScale;                                         		// 0x000018 (0x0004)              
	float                                              MinUniformScale;                                  		// 0x00001C (0x0004)              
	float                                              MaxUniformScale;                                  		// 0x000020 (0x0004)              
	float                                              MinThinningRadius;                                		// 0x000024 (0x0004)              
	int                                                Seed;                                             		// 0x000028 (0x0004)              
	float                                              SwayScale;                                        		// 0x00002C (0x0004)              
	float                                              AlphaMapThreshold;                                		// 0x000030 (0x0004)              
	float                                              SlopeRotationBlend;                               		// 0x000034 (0x0004)              
};
//0x000008
//UIStringSelectionRegion[0x1D0994B0]
struct FUIStringSelectionRegion
{
	int                                                SelectionStartCharIndex;                          		// 0x000000 (0x0004)              
	int                                                SelectionEndCharIndex;                            		// 0x000004 (0x0004)              
};
//0x00000C
//UIListSortingParameters[0x1D099448]
struct FUIListSortingParameters
{
	int                                                PrimaryIndex;                                     		// 0x000000 (0x0004)              
	int                                                SecondaryIndex;                                   		// 0x000004 (0x0004)              
	unsigned long                                      bReversePrimarySorting : 1;                       		// 0x000008 (0x0004) [0x00000001] 
	unsigned long                                      bReverseSecondarySorting : 1;                     		// 0x000008 (0x0004) [0x00000002] 
	unsigned long                                      bCaseSensitive : 1;                               		// 0x000008 (0x0004) [0x00000004] 
	unsigned long                                      bIntSortPrimary : 1;                              		// 0x000008 (0x0004) [0x00000008] 
	unsigned long                                      bIntSortSecondary : 1;                            		// 0x000008 (0x0004) [0x00000010] 
	unsigned long                                      bFloatSortPrimary : 1;                            		// 0x000008 (0x0004) [0x00000020] 
	unsigned long                                      bFloatSortSecondary : 1;                          		// 0x000008 (0x0004) [0x00000040] 
};
//0x000014
//UIListItemDataBinding[0x1D0993E0]
struct FUIListItemDataBinding
{
	class UUIListElementCellProvider*                  DataSourceProvider;                               		// 0x000000 (0x0004)              
	struct FName                                       DataSourceTag;                                    		// 0x000008 (0x0008)              
	int                                                DataSourceIndex;                                  		// 0x000010 (0x0004)              
};
//0x000040
//UIListElementCell[0x1D099378]
struct FUIListElementCell
{
	int                                                ContainerElementIndex;                            		// 0x000000 (0x0004)              
	class UUIList*                                     OwnerList;                                        		// 0x000004 (0x0004)              
	struct FUIStyleReference                           m_CellStyle;                                      		// 0x000008 (0x0020)              
	unsigned char                                      CellState;                                        		// 0x000028 (0x0001)              PROPERTY: EUIListElementState
	unsigned char                                      _0x000029[0x3];                                   		// 0x000029 (0x0003) MISSED OFFSET
	class UUITexture*                                  m_CellBackground;                                 		// 0x00002C (0x0004)              
	unsigned long                                      bScaleContentsToFit : 1;                          		// 0x000030 (0x0004) [0x00000001] 
	struct FName                                       CellDataField;                                    		// 0x000034 (0x0008)              
	class UObject*                                     ValueObject;                                      		// 0x00003C (0x0004)              
};
//0x000030 (0x000070 - 0x000040)
//UIListElementCellTemplate[0x1D099310]
struct FUIListElementCellTemplate : FUIListElementCell
{
	struct FString                                     ColumnHeaderText;                                 		// 0x000040 (0x000C)              
	struct FUIScreenValue_Extent                       CellSize;                                         		// 0x00004C (0x0008)              
	unsigned long                                      bCellSizeIgnoredForScaling : 1;                   		// 0x000054 (0x0004) [0x00000001] 
	struct FUIScreenValue_Position                     CellOffset;                                       		// 0x000058 (0x000C)              
	int                                                CellOffsetRelativeToCell;                         		// 0x000064 (0x0004)              
	unsigned long                                      bAvoidHitByCursor : 1;                            		// 0x000068 (0x0004) [0x00000001] 
	float                                              CellPosition;                                     		// 0x00006C (0x0004)              
};
//0x000021
//UIListItem[0x1D0992A8]
struct FUIListItem
{
	struct FUIListItemDataBinding                      DataSource;                                       		// 0x000000 (0x0014)              
	TArray<struct FUIListElementCell>                  Cells;                                            		// 0x000014 (0x000C)              
	unsigned char                                      ElementState;                                     		// 0x000020 (0x0001)              PROPERTY: EUIListElementState
};
//0x00000C
//UIElementCellSchema[0x1D099240]
struct FUIElementCellSchema
{
	TArray<struct FUIListElementCellTemplate>          Cells;                                            		// 0x000000 (0x000C)              
};
//0x00000C
//SoundEventMapping[0x1D0991D8]
struct FSoundEventMapping
{
	struct FName                                       SoundEventName;                                   		// 0x000000 (0x0008)              
	class USoundCue*                                   SoundToPlay;                                      		// 0x000008 (0x0004)              
};
//0x00000C
//StaticMeshLODElement[0x02FA10A8]
struct FStaticMeshLODElement
{
	class UMaterialInterface*                          Material;                                         		// 0x000000 (0x0004)              
	unsigned long                                      bEnableShadowCasting : 1;                         		// 0x000004 (0x0004) [0x00000001] 
	unsigned long                                      bEnableCollision : 1;                             		// 0x000008 (0x0004) [0x00000001] 
};
//0x00000C
//StaticMeshLODInfo[0x02FA1040]
struct FStaticMeshLODInfo
{
	TArray<struct FStaticMeshLODElement>               Elements;                                         		// 0x000000 (0x000C)              
};

/*
-----------------------------------------------------------------
 - Classes
-----------------------------------------------------------------
*/
//0x00000D (0x000059 - 0x00004C)
//ActorComponent[0x026BF960]
class UActorComponent : public UComponent
{
public:
	DWORD                                              Scene;                                            		// 0x00004C (0x0004)              
	class AActor*                                      Owner;                                            		// 0x000050 (0x0004)              
	unsigned long                                      bAttached : 1;                                    		// 0x000054 (0x0004) [0x00000001] 
	unsigned long                                      bTickInEditor : 1;                                		// 0x000054 (0x0004) [0x00000002] 
	unsigned long                                      bNeedsReattach : 1;                               		// 0x000054 (0x0004) [0x00000004] 
	unsigned long                                      bNeedsUpdateTransform : 1;                        		// 0x000054 (0x0004) [0x00000008] 
	unsigned char                                      TickGroup;                                        		// 0x000058 (0x0001)              PROPERTY: ETickingGroup

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class Engine.ActorComponent");
		return pClassPointer;
	};

public:
	void ForceUpdate(bool bTransformOnly);//Engine.ActorComponent.ForceUpdate
	void SetComponentRBFixed(bool bFixed);//Engine.ActorComponent.SetComponentRBFixed
	void SetTickGroup(unsigned char NewTickGroup);//Engine.ActorComponent.SetTickGroup
};
UClass* UActorComponent::pClassPointer = NULL;

//0x0000AB (0x000104 - 0x000059)
//cBlobShadowComponent[0x026BEB20]
class UcBlobShadowComponent : public UActorComponent
{
public:
	unsigned char                                      _0x000059[0x3];                                   		// 0x000059 (0x0003) MISSED OFFSET
	unsigned long                                      m_bEnabled : 1;                                   		// 0x00005C (0x0004) [0x00000001] 
	FVector3                                           m_Scale3D;                                        		// 0x000060 (0x000C)              
	FVector3                                           m_Translation;                                    		// 0x00006C (0x000C)              
	class UTexture*                                    m_Texture;                                        		// 0x000078 (0x0004)              
	float                                              m_fCullDistance;                                  		// 0x00007C (0x0004)              
	FMatrix                                            m_CachedParentToWorld;                            		// 0x000080 (0x0040)              
	FMatrix                                            m_LocalToWorld;                                   		// 0x0000C0 (0x0040)              
	DWORD                                              SceneInfo;                                        		// 0x000100 (0x0004)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class Engine.cBlobShadowComponent");
		return pClassPointer;
	};

public:
	void RecalcLocalToWorld();//Engine.cBlobShadowComponent.RecalcLocalToWorld
	void SetScale3D(FVector3 Scale3D);//Engine.cBlobShadowComponent.SetScale3D
	void SetTranslation(FVector3 Translation);//Engine.cBlobShadowComponent.SetTranslation
};
UClass* UcBlobShadowComponent::pClassPointer = NULL;

//0x000153 (0x0001AC - 0x000059)
//AudioComponent[0x026BFE20]
class UAudioComponent : public UActorComponent
{
public:
	unsigned char                                      _0x000059[0x3];                                   		// 0x000059 (0x0003) MISSED OFFSET
	class USoundCue*                                   SoundCue;                                         		// 0x00005C (0x0004)              
	class USoundNode*                                  CueFirstNode;                                     		// 0x000060 (0x0004)              
	TArray<struct FAudioComponentParam>                InstanceParameters;                               		// 0x000064 (0x000C)              
	unsigned long                                      bUseOwnerLocation : 1;                            		// 0x000070 (0x0004) [0x00000001] 
	unsigned long                                      bAutoPlay : 1;                                    		// 0x000070 (0x0004) [0x00000002] 
	unsigned long                                      bAutoDestroy : 1;                                 		// 0x000070 (0x0004) [0x00000004] 
	unsigned long                                      bStopWhenOwnerDestroyed : 1;                      		// 0x000070 (0x0004) [0x00000008] 
	unsigned long                                      bShouldRemainActiveIfDropped : 1;                 		// 0x000070 (0x0004) [0x00000010] 
	unsigned long                                      bWasOccluded : 1;                                 		// 0x000070 (0x0004) [0x00000020] 
	unsigned long                                      bSuppressSubtitles : 1;                           		// 0x000070 (0x0004) [0x00000040] 
	unsigned long                                      bWasPlaying : 1;                                  		// 0x000070 (0x0004) [0x00000080] 
	unsigned long                                      bApplyEffects : 1;                                		// 0x000070 (0x0004) [0x00000100] 
	unsigned long                                      bAlwaysPlay : 1;                                  		// 0x000070 (0x0004) [0x00000200] 
	unsigned long                                      bAllowSpatialization : 1;                         		// 0x000070 (0x0004) [0x00000400] 
	unsigned long                                      bIsUISound : 1;                                   		// 0x000070 (0x0004) [0x00000800] 
	unsigned long                                      bIsMusic : 1;                                     		// 0x000070 (0x0004) [0x00001000] 
	unsigned long                                      bNoReverb : 1;                                    		// 0x000070 (0x0004) [0x00002000] 
	unsigned long                                      bFinished : 1;                                    		// 0x000070 (0x0004) [0x00004000] 
	unsigned long                                      bIgnoreForFlushing : 1;                           		// 0x000070 (0x0004) [0x00008000] 
	TArray<DWORD>                                      WaveInstances;                                    		// 0x000074 (0x000C)              
	TArray<unsigned char>                              SoundNodeData;                                    		// 0x000080 (0x000C)              
	unsigned char                                      SoundNodeOffsetMap[0x3C];                         		// 0x00008C (0x003C)              UNKNOWN PROPERTY: MapProperty
	struct FMultiMap_Mirror                            SoundNodeResetWaveMap;                            		// 0x0000C8 (0x003C)              
	DWORD                                              Listener;                                         		// 0x000104 (0x0004)              
	float                                              PlaybackTime;                                     		// 0x000108 (0x0004)              
	class APortalVolume*                               PortalVolume;                                     		// 0x00010C (0x0004)              
	FVector3                                           Location;                                         		// 0x000110 (0x000C)              
	FVector3                                           ComponentLocation;                                		// 0x00011C (0x000C)              
	float                                              SubtitlePriority;                                 		// 0x000128 (0x0004)              
	float                                              FadeInStartTime;                                  		// 0x00012C (0x0004)              
	float                                              FadeInStopTime;                                   		// 0x000130 (0x0004)              
	float                                              FadeInTargetVolume;                               		// 0x000134 (0x0004)              
	float                                              FadeOutStartTime;                                 		// 0x000138 (0x0004)              
	float                                              FadeOutStopTime;                                  		// 0x00013C (0x0004)              
	float                                              FadeOutTargetVolume;                              		// 0x000140 (0x0004)              
	float                                              AdjustVolumeStartTime;                            		// 0x000144 (0x0004)              
	float                                              AdjustVolumeStopTime;                             		// 0x000148 (0x0004)              
	float                                              AdjustVolumeTargetVolume;                         		// 0x00014C (0x0004)              
	float                                              CurrAdjustVolumeTargetVolume;                     		// 0x000150 (0x0004)              
	class USoundNode*                                  CurrentNotifyBufferFinishedHook;                  		// 0x000154 (0x0004)              
	FVector3                                           CurrentLocation;                                  		// 0x000158 (0x000C)              
	float                                              CurrentVolume;                                    		// 0x000164 (0x0004)              
	float                                              CurrentPitch;                                     		// 0x000168 (0x0004)              
	float                                              CurrentHighFrequencyGain;                         		// 0x00016C (0x0004)              
	int                                                CurrentUseSpatialization;                         		// 0x000170 (0x0004)              
	int                                                CurrentUseSeamlessLooping;                        		// 0x000174 (0x0004)              
	float                                              CurrentVolumeMultiplier;                          		// 0x000178 (0x0004)              
	float                                              CurrentPitchMultiplier;                           		// 0x00017C (0x0004)              
	float                                              CurrentVoiceCenterChannelVolume;                  		// 0x000180 (0x0004)              
	float                                              CurrentVoiceRadioVolume;                          		// 0x000184 (0x0004)              
	float                                              VolumeMultiplier;                                 		// 0x000188 (0x0004)              
	float                                              PitchMultiplier;                                  		// 0x00018C (0x0004)              
	float                                              OcclusionCheckInterval;                           		// 0x000190 (0x0004)              
	double                                             LastOcclusionCheckTime;                           		// 0x000194 (0x0008)              
	class UDrawSoundRadiusComponent*                   PreviewSoundRadius;                               		// 0x00019C (0x0004)              
	struct FScriptDelegate                             __OnAudioFinished__Delegate;                      		// 0x0001A0 (0x000C)              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = UObject::FindClass("Class Engine.AudioComponent");
		return pClassPointer;
	};

public:
	void OcclusionChanged(bool bNowOccluded);//Engine.AudioComponent.OcclusionChanged
	void Play();//Engine.AudioComponent.Play
	void Stop();//Engine.AudioComponent.Stop
	bool IsPlaying();//Engine.AudioComponent.IsPlaying
	void FadeOut(float FadeOutDuration,float FadeVolumeLevel);//Engine.AudioComponent.FadeOut
	void FadeIn(float FadeInDuration,float FadeVolumeLevel);//Engine.AudioComponent.FadeIn
	void OnAudioFinished(class UAudioComponent* AC);//Engine.AudioComponent.OnAudioFinished
	void AdjustVolume(float AdjustVolumeDuration,float AdjustVolumeLevel);//Engine.AudioComponent.AdjustVolume
	void SetWaveParameter(struct FName InName,class USoundNodeWave* InWave);//Engine.AudioComponent.SetWaveParameter
	void SetFloatParameter(struct FName InName,float InFloat);//Engine.AudioComponent.SetFloatParameter
	void ResetToDefaults();//Engine.AudioComponent.ResetToDefaults
};
UClass* UAudioComponent::pClassPointer = NULL;

//0x000187 (0x0001E0 - 0x000059)
//PrimitiveComponent[0x026BF5D0]
class UPrimitiveComponent : public UActorComponent
{
public:
	unsigned char                                      _0x000059[0x3];                                   		// 0x000059 (0x0003) MISSED OFFSET
	DWORD                                              SceneInfo;                                        		// 0x00005C (0x0004)              
